[Killed] BlockStatement
src/topics/bookmarks.js:10:56
 const user = require('../user');
 
 module.exports = function (Topics) {
-    Topics.getUserBookmark = async function (tid, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return null;
-        }
-        return await db.sortedSetScore(`tid:${tid}:bookmarks`, uid);
-    };
+    Topics.getUserBookmark = async function (tid, uid) {};
 
     Topics.getUserBookmarks = async function (tids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ConditionalExpression
src/topics/bookmarks.js:11:13
 
 module.exports = function (Topics) {
     Topics.getUserBookmark = async function (tid, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (true) {
             return null;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/topics/bookmarks.js:11:37
 
 module.exports = function (Topics) {
     Topics.getUserBookmark = async function (tid, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return null;
-        }
+        if (parseInt(uid, 10) <= 0) {}
         return await db.sortedSetScore(`tid:${tid}:bookmarks`, uid);
     };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/topics/bookmarks.js:17:58
         return await db.sortedSetScore(`tid:${tid}:bookmarks`, uid);
     };
 
-    Topics.getUserBookmarks = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return tids.map(() => null);
-        }
-        return await db.sortedSetsScore(tids.map(tid => `tid:${tid}:bookmarks`), uid);
-    };
+    Topics.getUserBookmarks = async function (tids, uid) {};
 
     Topics.setUserBookmark = async function (tid, uid, index) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/bookmarks.js:18:37
     };
 
     Topics.getUserBookmarks = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return tids.map(() => null);
-        }
+        if (parseInt(uid, 10) <= 0) {}
         return await db.sortedSetsScore(tids.map(tid => `tid:${tid}:bookmarks`), uid);
     };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/topics/bookmarks.js:18:13
     };
 
     Topics.getUserBookmarks = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (parseInt(uid, 10) > 0) {
             return tids.map(() => null);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/bookmarks.js:19:29
 
     Topics.getUserBookmarks = async function (tids, uid) {
         if (parseInt(uid, 10) <= 0) {
-            return tids.map(() => null);
+            return tids.map(() => undefined);
         }
         return await db.sortedSetsScore(tids.map(tid => `tid:${tid}:bookmarks`), uid);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/bookmarks.js:21:50
         if (parseInt(uid, 10) <= 0) {
             return tids.map(() => null);
         }
-        return await db.sortedSetsScore(tids.map(tid => `tid:${tid}:bookmarks`), uid);
+        return await db.sortedSetsScore(tids.map(() => undefined), uid);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/bookmarks.js:24:63
         return await db.sortedSetsScore(tids.map(tid => `tid:${tid}:bookmarks`), uid);
     };
 
-    Topics.setUserBookmark = async function (tid, uid, index) {
-        await db.sortedSetAdd(`tid:${tid}:bookmarks`, index, uid);
-    };
+    Topics.setUserBookmark = async function (tid, uid, index) {};
 
     Topics.getTopicBookmarks = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/bookmarks.js:25:31
     };
 
     Topics.setUserBookmark = async function (tid, uid, index) {
-        await db.sortedSetAdd(`tid:${tid}:bookmarks`, index, uid);
+        await db.sortedSetAdd(``, index, uid);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/bookmarks.js:28:53
         await db.sortedSetAdd(`tid:${tid}:bookmarks`, index, uid);
     };
 
-    Topics.getTopicBookmarks = async function (tid) {
-        return await db.getSortedSetRangeWithScores(`tid:${tid}:bookmarks`, 0, -1);
-    };
+    Topics.getTopicBookmarks = async function (tid) {};
 
     Topics.updateTopicBookmarks = async function (tid, pids) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] UnaryOperator
src/topics/bookmarks.js:29:80
     };
 
     Topics.getTopicBookmarks = async function (tid) {
-        return await db.getSortedSetRangeWithScores(`tid:${tid}:bookmarks`, 0, -1);
+        return await db.getSortedSetRangeWithScores(`tid:${tid}:bookmarks`, 0, +1);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/bookmarks.js:35:47
     Topics.updateTopicBookmarks = async function (tid, pids) {
         const maxIndex = await Topics.getPostCount(tid);
         const indices = await db.sortedSetRanks(`tid:${tid}:posts`, pids);
-        const postIndices = indices.map(i => (i === null ? 0 : i + 1));
+        const postIndices = indices.map(i => (false ? 0 : i + 1));
         const minIndex = Math.min(...postIndices);
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/bookmarks.js:35:47
     Topics.updateTopicBookmarks = async function (tid, pids) {
         const maxIndex = await Topics.getPostCount(tid);
         const indices = await db.sortedSetRanks(`tid:${tid}:posts`, pids);
-        const postIndices = indices.map(i => (i === null ? 0 : i + 1));
+        const postIndices = indices.map(i => (true ? 0 : i + 1));
         const minIndex = Math.min(...postIndices);
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/topics/bookmarks.js:36:26
         const maxIndex = await Topics.getPostCount(tid);
         const indices = await db.sortedSetRanks(`tid:${tid}:posts`, pids);
         const postIndices = indices.map(i => (i === null ? 0 : i + 1));
-        const minIndex = Math.min(...postIndices);
+        const minIndex = Math.max(...postIndices);
 
         const bookmarks = await Topics.getTopicBookmarks(tid);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/bookmarks.js:40:39
 
         const bookmarks = await Topics.getTopicBookmarks(tid);
 
-        const uidData = bookmarks.map(b => ({ uid: b.value, bookmark: parseInt(b.score, 10) }))
+        const uidData = bookmarks.map(() => undefined)
             .filter(data => data.bookmark >= minIndex);
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/topics/bookmarks.js:40:25
 
         const bookmarks = await Topics.getTopicBookmarks(tid);
 
-        const uidData = bookmarks.map(b => ({ uid: b.value, bookmark: parseInt(b.score, 10) }))
-            .filter(data => data.bookmark >= minIndex);
+        const uidData = bookmarks.map(b => ({
+  uid: b.value,
+  bookmark: parseInt(b.score, 10)
+}));
 
         await async.eachLimit(uidData, 50, async (data) => {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/topics/bookmarks.js:41:29
         const bookmarks = await Topics.getTopicBookmarks(tid);
 
         const uidData = bookmarks.map(b => ({ uid: b.value, bookmark: parseInt(b.score, 10) }))
-            .filter(data => data.bookmark >= minIndex);
+            .filter(data => data.bookmark > minIndex);
 
         await async.eachLimit(uidData, 50, async (data) => {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/bookmarks.js:41:29
         const bookmarks = await Topics.getTopicBookmarks(tid);
 
         const uidData = bookmarks.map(b => ({ uid: b.value, bookmark: parseInt(b.score, 10) }))
-            .filter(data => data.bookmark >= minIndex);
+            .filter(data => true);
 
         await async.eachLimit(uidData, 50, async (data) => {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/bookmarks.js:43:60
         const uidData = bookmarks.map(b => ({ uid: b.value, bookmark: parseInt(b.score, 10) }))
             .filter(data => data.bookmark >= minIndex);
 
-        await async.eachLimit(uidData, 50, async (data) => {
-            let bookmark = Math.min(data.bookmark, maxIndex);
-
-            postIndices.forEach((i) => {
-                if (i < data.bookmark) {
-                    bookmark -= 1;
-                }
-            });
-
-            // make sure the bookmark is valid if we removed the last post
-            bookmark = Math.min(bookmark, maxIndex - pids.length);
-            if (bookmark === data.bookmark) {
-                return;
-            }
-
-            const settings = await user.getSettings(data.uid);
-            if (settings.topicPostSort === 'most_votes') {
-                return;
-            }
-
-            await Topics.setUserBookmark(tid, data.uid, bookmark);
-        });
+        await async.eachLimit(uidData, 50, async (data) => {});
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/topics/bookmarks.js:44:28
             .filter(data => data.bookmark >= minIndex);
 
         await async.eachLimit(uidData, 50, async (data) => {
-            let bookmark = Math.min(data.bookmark, maxIndex);
+            let bookmark = Math.max(data.bookmark, maxIndex);
 
             postIndices.forEach((i) => {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/bookmarks.js:46:40
         await async.eachLimit(uidData, 50, async (data) => {
             let bookmark = Math.min(data.bookmark, maxIndex);
 
-            postIndices.forEach((i) => {
-                if (i < data.bookmark) {
-                    bookmark -= 1;
-                }
-            });
+            postIndices.forEach((i) => {});
 
             // make sure the bookmark is valid if we removed the last post
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/bookmarks.js:47:21
             let bookmark = Math.min(data.bookmark, maxIndex);
 
             postIndices.forEach((i) => {
-                if (i < data.bookmark) {
+                if (true) {
                     bookmark -= 1;
                 }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/topics/bookmarks.js:47:21
             let bookmark = Math.min(data.bookmark, maxIndex);
 
             postIndices.forEach((i) => {
-                if (i < data.bookmark) {
+                if (i <= data.bookmark) {
                     bookmark -= 1;
                 }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] AssignmentOperator
src/topics/bookmarks.js:48:21
 
             postIndices.forEach((i) => {
                 if (i < data.bookmark) {
-                    bookmark -= 1;
+                    bookmark += 1;
                 }
             });
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/topics/bookmarks.js:53:24
             });
 
             // make sure the bookmark is valid if we removed the last post
-            bookmark = Math.min(bookmark, maxIndex - pids.length);
+            bookmark = Math.max(bookmark, maxIndex - pids.length);
             if (bookmark === data.bookmark) {
                 return;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArithmeticOperator
src/topics/bookmarks.js:53:43
             });
 
             // make sure the bookmark is valid if we removed the last post
-            bookmark = Math.min(bookmark, maxIndex - pids.length);
+            bookmark = Math.min(bookmark, maxIndex + pids.length);
             if (bookmark === data.bookmark) {
                 return;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/topics/bookmarks.js:54:17
 
             // make sure the bookmark is valid if we removed the last post
             bookmark = Math.min(bookmark, maxIndex - pids.length);
-            if (bookmark === data.bookmark) {
+            if (bookmark !== data.bookmark) {
                 return;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/bookmarks.js:54:17
 
             // make sure the bookmark is valid if we removed the last post
             bookmark = Math.min(bookmark, maxIndex - pids.length);
-            if (bookmark === data.bookmark) {
+            if (false) {
                 return;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/bookmarks.js:59:17
             }
 
             const settings = await user.getSettings(data.uid);
-            if (settings.topicPostSort === 'most_votes') {
+            if (true) {
                 return;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/bookmarks.js:59:17
             }
 
             const settings = await user.getSettings(data.uid);
-            if (settings.topicPostSort === 'most_votes') {
+            if (false) {
                 return;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing
