[Killed] ArithmeticOperator
src/topics/create.js:231:26
 
         postData.user = userInfo[0];
         postData.topic = topicInfo;
-        postData.index = topicInfo.postcount - 1;
+        postData.index = topicInfo.postcount + 1;
 
         posts.overrideGuestHandle(postData, data.handle);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/create.js:236:31
         posts.overrideGuestHandle(postData, data.handle);
 
         postData.votes = 0;
-        postData.bookmarked = false;
+        postData.bookmarked = true;
         postData.display_edit_tools = true;
         postData.display_delete_tools = true;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/create.js:237:39
 
         postData.votes = 0;
         postData.bookmarked = false;
-        postData.display_edit_tools = true;
+        postData.display_edit_tools = false;
         postData.display_delete_tools = true;
         postData.display_moderator_tools = true;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/create.js:238:41
         postData.votes = 0;
         postData.bookmarked = false;
         postData.display_edit_tools = true;
-        postData.display_delete_tools = true;
+        postData.display_delete_tools = false;
         postData.display_moderator_tools = true;
         postData.display_move_tools = true;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/create.js:239:44
         postData.bookmarked = false;
         postData.display_edit_tools = true;
         postData.display_delete_tools = true;
-        postData.display_moderator_tools = true;
+        postData.display_moderator_tools = false;
         postData.display_move_tools = true;
         postData.selfPost = false;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BooleanLiteral
src/topics/create.js:240:39
         postData.display_edit_tools = true;
         postData.display_delete_tools = true;
         postData.display_moderator_tools = true;
-        postData.display_move_tools = true;
+        postData.display_move_tools = false;
         postData.selfPost = false;
         postData.timestampISO = utils.toISOString(postData.timestamp);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/create.js:241:29
         postData.display_delete_tools = true;
         postData.display_moderator_tools = true;
         postData.display_move_tools = true;
-        postData.selfPost = false;
+        postData.selfPost = true;
         postData.timestampISO = utils.toISOString(postData.timestamp);
         postData.topic.title = String(postData.topic.title);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/create.js:248:42
         return postData;
     }
 
-    Topics.checkTitle = function (title) {
-        check(title, meta.config.minimumTitleLength, meta.config.maximumTitleLength, 'title-too-short', 'title-too-long');
-    };
+    Topics.checkTitle = function (title) {};
 
     Topics.checkContent = function (content) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/create.js:252:46
         check(title, meta.config.minimumTitleLength, meta.config.maximumTitleLength, 'title-too-short', 'title-too-long');
     };
 
-    Topics.checkContent = function (content) {
-        check(content, meta.config.minimumPostLength, meta.config.maximumPostLength, 'content-too-short', 'content-too-long');
-    };
+    Topics.checkContent = function (content) {};
 
     function check(item, min, max, minError, maxError) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/create.js:253:86
     };
 
     Topics.checkContent = function (content) {
-        check(content, meta.config.minimumPostLength, meta.config.maximumPostLength, 'content-too-short', 'content-too-long');
+        check(content, meta.config.minimumPostLength, meta.config.maximumPostLength, "", 'content-too-long');
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/create.js:256:56
         check(content, meta.config.minimumPostLength, meta.config.maximumPostLength, 'content-too-short', 'content-too-long');
     };
 
-    function check(item, min, max, minError, maxError) {
-        // Trim and remove HTML (latter for composers that send in HTML, like redactor)
-        if (typeof item === 'string') {
-            item = utils.stripHTMLTags(item).trim();
-        }
-
-        if (item === null || item === undefined || item.length < parseInt(min, 10)) {
-            throw new Error(`[[error:${minError}, ${min}]]`);
-        } else if (item.length > parseInt(max, 10)) {
-            throw new Error(`[[error:${maxError}, ${max}]]`);
-        }
-    }
+    function check(item, min, max, minError, maxError) {}
 
     async function guestHandleValid(data) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/create.js:258:39
 
     function check(item, min, max, minError, maxError) {
         // Trim and remove HTML (latter for composers that send in HTML, like redactor)
-        if (typeof item === 'string') {
-            item = utils.stripHTMLTags(item).trim();
-        }
+        if (typeof item === 'string') {}
 
         if (item === null || item === undefined || item.length < parseInt(min, 10)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:258:13
 
     function check(item, min, max, minError, maxError) {
         // Trim and remove HTML (latter for composers that send in HTML, like redactor)
-        if (typeof item === 'string') {
+        if (false) {
             item = utils.stripHTMLTags(item).trim();
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/create.js:259:20
     function check(item, min, max, minError, maxError) {
         // Trim and remove HTML (latter for composers that send in HTML, like redactor)
         if (typeof item === 'string') {
-            item = utils.stripHTMLTags(item).trim();
+            item = utils.stripHTMLTags(item);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:262:52
             item = utils.stripHTMLTags(item).trim();
         }
 
-        if (item === null || item === undefined || item.length < parseInt(min, 10)) {
+        if (item === null || item === undefined || false) {
             throw new Error(`[[error:${minError}, ${min}]]`);
         } else if (item.length > parseInt(max, 10)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/create.js:262:13
             item = utils.stripHTMLTags(item).trim();
         }
 
-        if (item === null || item === undefined || item.length < parseInt(min, 10)) {
+        if (item !== null || item === undefined || item.length < parseInt(min, 10)) {
             throw new Error(`[[error:${minError}, ${min}]]`);
         } else if (item.length > parseInt(max, 10)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/create.js:263:29
         }
 
         if (item === null || item === undefined || item.length < parseInt(min, 10)) {
-            throw new Error(`[[error:${minError}, ${min}]]`);
+            throw new Error(``);
         } else if (item.length > parseInt(max, 10)) {
             throw new Error(`[[error:${maxError}, ${max}]]`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:264:20
 
         if (item === null || item === undefined || item.length < parseInt(min, 10)) {
             throw new Error(`[[error:${minError}, ${min}]]`);
-        } else if (item.length > parseInt(max, 10)) {
+        } else if (false) {
             throw new Error(`[[error:${maxError}, ${max}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/create.js:264:20
 
         if (item === null || item === undefined || item.length < parseInt(min, 10)) {
             throw new Error(`[[error:${minError}, ${min}]]`);
-        } else if (item.length > parseInt(max, 10)) {
+        } else if (item.length <= parseInt(max, 10)) {
             throw new Error(`[[error:${maxError}, ${max}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/create.js:269:43
         }
     }
 
-    async function guestHandleValid(data) {
-        if (meta.config.allowGuestHandles && parseInt(data.uid, 10) === 0 && data.handle) {
-            if (data.handle.length > meta.config.maximumUsernameLength) {
-                throw new Error('[[error:guest-handle-invalid]]');
-            }
-            const exists = await user.existsBySlug(slugify(data.handle));
-            if (exists) {
-                throw new Error('[[error:username-taken]]');
-            }
-        }
-    }
+    async function guestHandleValid(data) {}
 
     async function canReply(data, topicData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:270:13
     }
 
     async function guestHandleValid(data) {
-        if (meta.config.allowGuestHandles && parseInt(data.uid, 10) === 0 && data.handle) {
+        if (false) {
             if (data.handle.length > meta.config.maximumUsernameLength) {
                 throw new Error('[[error:guest-handle-invalid]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/create.js:270:13
     }
 
     async function guestHandleValid(data) {
-        if (meta.config.allowGuestHandles && parseInt(data.uid, 10) === 0 && data.handle) {
+        if (meta.config.allowGuestHandles && parseInt(data.uid, 10) === 0 || data.handle) {
             if (data.handle.length > meta.config.maximumUsernameLength) {
                 throw new Error('[[error:guest-handle-invalid]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/create.js:271:17
 
     async function guestHandleValid(data) {
         if (meta.config.allowGuestHandles && parseInt(data.uid, 10) === 0 && data.handle) {
-            if (data.handle.length > meta.config.maximumUsernameLength) {
+            if (data.handle.length >= meta.config.maximumUsernameLength) {
                 throw new Error('[[error:guest-handle-invalid]]');
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:271:17
 
     async function guestHandleValid(data) {
         if (meta.config.allowGuestHandles && parseInt(data.uid, 10) === 0 && data.handle) {
-            if (data.handle.length > meta.config.maximumUsernameLength) {
+            if (true) {
                 throw new Error('[[error:guest-handle-invalid]]');
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:275:17
                 throw new Error('[[error:guest-handle-invalid]]');
             }
             const exists = await user.existsBySlug(slugify(data.handle));
-            if (exists) {
+            if (false) {
                 throw new Error('[[error:username-taken]]');
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:275:17
                 throw new Error('[[error:guest-handle-invalid]]');
             }
             const exists = await user.existsBySlug(slugify(data.handle));
-            if (exists) {
+            if (true) {
                 throw new Error('[[error:username-taken]]');
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/create.js:282:13
     }
 
     async function canReply(data, topicData) {
-        if (!topicData) {
+        if (true) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:282:13
     }
 
     async function canReply(data, topicData) {
-        if (!topicData) {
+        if (false) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/create.js:283:29
 
     async function canReply(data, topicData) {
         if (!topicData) {
-            throw new Error('[[error:no-topic]]');
+            throw new Error("");
         }
         const { tid, uid } = data;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/create.js:290:35
 
         const [canReply, canSchedule, isAdminOrMod] = await Promise.all([
             privileges.topics.can('topics:reply', tid, uid),
-            privileges.topics.can('topics:schedule', tid, uid),
+            privileges.topics.can("", tid, uid),
             privileges.categories.isAdminOrMod(cid, uid),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/create.js:294:13
             privileges.categories.isAdminOrMod(cid, uid),
         ]);
 
-        if (locked && !isAdminOrMod) {
+        if (false) {
             throw new Error('[[error:topic-locked]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/create.js:294:13
             privileges.categories.isAdminOrMod(cid, uid),
         ]);
 
-        if (locked && !isAdminOrMod) {
+        if (locked || !isAdminOrMod) {
             throw new Error('[[error:topic-locked]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/topics/create.js:295:29
         ]);
 
         if (locked && !isAdminOrMod) {
-            throw new Error('[[error:topic-locked]]');
+            throw new Error("");
         }
 

[Killed] BooleanLiteral
src/topics/create.js:298:13
             throw new Error('[[error:topic-locked]]');
         }
 
-        if (!scheduled && deleted && !isAdminOrMod) {
+        if (scheduled && deleted && !isAdminOrMod) {
             throw new Error('[[error:topic-deleted]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/create.js:298:13
             throw new Error('[[error:topic-locked]]');
         }
 
-        if (!scheduled && deleted && !isAdminOrMod) {
+        if (false) {
             throw new Error('[[error:topic-deleted]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/create.js:302:26
             throw new Error('[[error:topic-deleted]]');
         }
 
-        if (scheduled && !canSchedule) {
+        if (scheduled && canSchedule) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/create.js:302:13
             throw new Error('[[error:topic-deleted]]');
         }
 
-        if (scheduled && !canSchedule) {
+        if (scheduled || !canSchedule) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/create.js:306:24
             throw new Error('[[error:no-privileges]]');
         }
 
-        if (!canReply) {
-            throw new Error('[[error:no-privileges]]');
-        }
+        if (!canReply) {}
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/create.js:306:13
             throw new Error('[[error:no-privileges]]');
         }
 
-        if (!canReply) {
+        if (false) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/create.js:307:29
         }
 
         if (!canReply) {
-            throw new Error('[[error:no-privileges]]');
+            throw new Error("");
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
