[Killed] StringLiteral
src/topics/data.js:13:5
 
 const intFields = [
     'tid', 'cid', 'uid', 'mainPid', 'postcount',
-    'viewcount', 'postercount', 'deleted', 'locked', 'pinned',
+    "", 'postercount', 'deleted', 'locked', 'pinned',
     'pinExpiry', 'timestamp', 'upvotes', 'downvotes', 'lastposttime',
     'deleterUid',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/data.js:14:31
 const intFields = [
     'tid', 'cid', 'uid', 'mainPid', 'postcount',
     'viewcount', 'postercount', 'deleted', 'locked', 'pinned',
-    'pinExpiry', 'timestamp', 'upvotes', 'downvotes', 'lastposttime',
+    'pinExpiry', 'timestamp', "", 'downvotes', 'lastposttime',
     'deleterUid',
 ];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/data.js:14:5
 const intFields = [
     'tid', 'cid', 'uid', 'mainPid', 'postcount',
     'viewcount', 'postercount', 'deleted', 'locked', 'pinned',
-    'pinExpiry', 'timestamp', 'upvotes', 'downvotes', 'lastposttime',
+    "", 'timestamp', 'upvotes', 'downvotes', 'lastposttime',
     'deleterUid',
 ];
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/data.js:15:5
     'tid', 'cid', 'uid', 'mainPid', 'postcount',
     'viewcount', 'postercount', 'deleted', 'locked', 'pinned',
     'pinExpiry', 'timestamp', 'upvotes', 'downvotes', 'lastposttime',
-    'deleterUid',
+    "",
 ];
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/topics/data.js:19:60
 ];
 
 module.exports = function (Topics) {
-    Topics.getTopicsFields = async function (tids, fields) {
-        if (!Array.isArray(tids) || !tids.length) {
-            return [];
-        }
-
-        // "scheduled" is derived from "timestamp"
-        if (fields.includes('scheduled') && !fields.includes('timestamp')) {
-            fields.push('timestamp');
-        }
-
-        const keys = tids.map(tid => `topic:${tid}`);
-        const topics = await db.getObjects(keys, fields);
-        const result = await plugins.hooks.fire('filter:topic.getFields', {
-            tids: tids,
-            topics: topics,
-            fields: fields,
-            keys: keys,
-        });
-        result.topics.forEach(topic => modifyTopic(topic, fields));
-        return result.topics;
-    };
+    Topics.getTopicsFields = async function (tids, fields) {};
 
     Topics.getTopicField = async function (tid, field) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:20:13
 
 module.exports = function (Topics) {
     Topics.getTopicsFields = async function (tids, fields) {
-        if (!Array.isArray(tids) || !tids.length) {
+        if (false) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/data.js:20:13
 
 module.exports = function (Topics) {
     Topics.getTopicsFields = async function (tids, fields) {
-        if (!Array.isArray(tids) || !tids.length) {
+        if (!Array.isArray(tids) && !tids.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/data.js:21:20
 module.exports = function (Topics) {
     Topics.getTopicsFields = async function (tids, fields) {
         if (!Array.isArray(tids) || !tids.length) {
-            return [];
+            return ["Stryker was here"];
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:25:13
         }
 
         // "scheduled" is derived from "timestamp"
-        if (fields.includes('scheduled') && !fields.includes('timestamp')) {
+        if (true) {
             fields.push('timestamp');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/data.js:25:13
         }
 
         // "scheduled" is derived from "timestamp"
-        if (fields.includes('scheduled') && !fields.includes('timestamp')) {
+        if (fields.includes('scheduled') || !fields.includes('timestamp')) {
             fields.push('timestamp');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/data.js:26:25
 
         // "scheduled" is derived from "timestamp"
         if (fields.includes('scheduled') && !fields.includes('timestamp')) {
-            fields.push('timestamp');
+            fields.push("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/data.js:29:31
             fields.push('timestamp');
         }
 
-        const keys = tids.map(tid => `topic:${tid}`);
+        const keys = tids.map(() => undefined);
         const topics = await db.getObjects(keys, fields);
         const result = await plugins.hooks.fire('filter:topic.getFields', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/data.js:29:38
             fields.push('timestamp');
         }
 
-        const keys = tids.map(tid => `topic:${tid}`);
+        const keys = tids.map(tid => ``);
         const topics = await db.getObjects(keys, fields);
         const result = await plugins.hooks.fire('filter:topic.getFields', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/data.js:31:49
 
         const keys = tids.map(tid => `topic:${tid}`);
         const topics = await db.getObjects(keys, fields);
-        const result = await plugins.hooks.fire('filter:topic.getFields', {
+        const result = await plugins.hooks.fire("", {
             tids: tids,
             topics: topics,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/data.js:31:75
 
         const keys = tids.map(tid => `topic:${tid}`);
         const topics = await db.getObjects(keys, fields);
-        const result = await plugins.hooks.fire('filter:topic.getFields', {
-            tids: tids,
-            topics: topics,
-            fields: fields,
-            keys: keys,
-        });
+        const result = await plugins.hooks.fire('filter:topic.getFields', {});
         result.topics.forEach(topic => modifyTopic(topic, fields));
         return result.topics;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/data.js:37:31
             fields: fields,
             keys: keys,
         });
-        result.topics.forEach(topic => modifyTopic(topic, fields));
+        result.topics.forEach(() => undefined);
         return result.topics;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:41:56
         return result.topics;
     };
 
-    Topics.getTopicField = async function (tid, field) {
-        const topic = await Topics.getTopicFields(tid, [field]);
-        return topic ? topic[field] : null;
-    };
+    Topics.getTopicField = async function (tid, field) {};
 
     Topics.getTopicFields = async function (tid, fields) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:46:58
         return topic ? topic[field] : null;
     };
 
-    Topics.getTopicFields = async function (tid, fields) {
-        const topics = await Topics.getTopicsFields([tid], fields);
-        return topics ? topics[0] : null;
-    };
+    Topics.getTopicFields = async function (tid, fields) {};
 
     Topics.getTopicData = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/data.js:47:53
     };
 
     Topics.getTopicFields = async function (tid, fields) {
-        const topics = await Topics.getTopicsFields([tid], fields);
+        const topics = await Topics.getTopicsFields([], fields);
         return topics ? topics[0] : null;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:51:48
         return topics ? topics[0] : null;
     };
 
-    Topics.getTopicData = async function (tid) {
-        const topics = await Topics.getTopicsFields([tid], []);
-        return topics && topics.length ? topics[0] : null;
-    };
+    Topics.getTopicData = async function (tid) {};
 
     Topics.getTopicsData = async function (tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/data.js:52:53
     };
 
     Topics.getTopicData = async function (tid) {
-        const topics = await Topics.getTopicsFields([tid], []);
+        const topics = await Topics.getTopicsFields([], []);
         return topics && topics.length ? topics[0] : null;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/data.js:53:16
 
     Topics.getTopicData = async function (tid) {
         const topics = await Topics.getTopicsFields([tid], []);
-        return topics && topics.length ? topics[0] : null;
+        return topics || topics.length ? topics[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:53:16
 
     Topics.getTopicData = async function (tid) {
         const topics = await Topics.getTopicsFields([tid], []);
-        return topics && topics.length ? topics[0] : null;
+        return false ? topics[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:56:50
         return topics && topics.length ? topics[0] : null;
     };
 
-    Topics.getTopicsData = async function (tids) {
-        return await Topics.getTopicsFields(tids, []);
-    };
+    Topics.getTopicsData = async function (tids) {};
 
     Topics.getCategoryData = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/data.js:60:51
         return await Topics.getTopicsFields(tids, []);
     };
 
-    Topics.getCategoryData = async function (tid) {
-        const cid = await Topics.getTopicField(tid, 'cid');
-        return await categories.getCategoryData(cid);
-    };
+    Topics.getCategoryData = async function (tid) {};
 
     Topics.setTopicField = async function (tid, field, value) {

[NoCoverage] StringLiteral
src/topics/data.js:61:53
     };
 
     Topics.getCategoryData = async function (tid) {
-        const cid = await Topics.getTopicField(tid, 'cid');
+        const cid = await Topics.getTopicField(tid, "");
         return await categories.getCategoryData(cid);
     };

[Killed] BlockStatement
src/topics/data.js:65:63
         return await categories.getCategoryData(cid);
     };
 
-    Topics.setTopicField = async function (tid, field, value) {
-        await db.setObjectField(`topic:${tid}`, field, value);
-    };
+    Topics.setTopicField = async function (tid, field, value) {};
 
     Topics.setTopicFields = async function (tid, data) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:69:56
         await db.setObjectField(`topic:${tid}`, field, value);
     };
 
-    Topics.setTopicFields = async function (tid, data) {
-        await db.setObject(`topic:${tid}`, data);
-    };
+    Topics.setTopicFields = async function (tid, data) {};
 
     Topics.deleteTopicField = async function (tid, field) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:73:59
         await db.setObject(`topic:${tid}`, data);
     };
 
-    Topics.deleteTopicField = async function (tid, field) {
-        await db.deleteObjectField(`topic:${tid}`, field);
-    };
+    Topics.deleteTopicField = async function (tid, field) {};
 
     Topics.deleteTopicFields = async function (tid, fields) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:77:61
         await db.deleteObjectField(`topic:${tid}`, field);
     };
 
-    Topics.deleteTopicFields = async function (tid, fields) {
-        await db.deleteObjectFields(`topic:${tid}`, fields);
-    };
+    Topics.deleteTopicFields = async function (tid, fields) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:82:33
     };
 };
 
-function escapeTitle(topicData) {
-    if (topicData) {
-        if (topicData.title) {
-            topicData.title = translator.escape(validator.escape(topicData.title));
-        }
-        if (topicData.titleRaw) {
-            topicData.titleRaw = translator.escape(topicData.titleRaw);
-        }
-    }
-}
+function escapeTitle(topicData) {}
 
 function modifyTopic(topic, fields) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:83:9
 };
 
 function escapeTitle(topicData) {
-    if (topicData) {
+    if (false) {
         if (topicData.title) {
             topicData.title = translator.escape(validator.escape(topicData.title));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:83:20
 };
 
 function escapeTitle(topicData) {
-    if (topicData) {
-        if (topicData.title) {
-            topicData.title = translator.escape(validator.escape(topicData.title));
-        }
-        if (topicData.titleRaw) {
-            topicData.titleRaw = translator.escape(topicData.titleRaw);
-        }
-    }
+    if (topicData) {}
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:84:30
 
 function escapeTitle(topicData) {
     if (topicData) {
-        if (topicData.title) {
-            topicData.title = translator.escape(validator.escape(topicData.title));
-        }
+        if (topicData.title) {}
         if (topicData.titleRaw) {
             topicData.titleRaw = translator.escape(topicData.titleRaw);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:84:13
 
 function escapeTitle(topicData) {
     if (topicData) {
-        if (topicData.title) {
+        if (false) {
             topicData.title = translator.escape(validator.escape(topicData.title));
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/data.js:87:13
         if (topicData.title) {
             topicData.title = translator.escape(validator.escape(topicData.title));
         }
-        if (topicData.titleRaw) {
+        if (false) {
             topicData.titleRaw = translator.escape(topicData.titleRaw);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:87:13
         if (topicData.title) {
             topicData.title = translator.escape(validator.escape(topicData.title));
         }
-        if (topicData.titleRaw) {
+        if (true) {
             topicData.titleRaw = translator.escape(topicData.titleRaw);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:94:20
 }
 
 function modifyTopic(topic, fields) {
-    console.assert(typeof topic === 'object');
+    console.assert(true);
     console.assert(Array.isArray(fields));
     if (!topic) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:94:20
 }
 
 function modifyTopic(topic, fields) {
-    console.assert(typeof topic === 'object');
+    console.assert(false);
     console.assert(Array.isArray(fields));
     if (!topic) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:96:9
 function modifyTopic(topic, fields) {
     console.assert(typeof topic === 'object');
     console.assert(Array.isArray(fields));
-    if (!topic) {
+    if (false) {
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:96:9
 function modifyTopic(topic, fields) {
     console.assert(typeof topic === 'object');
     console.assert(Array.isArray(fields));
-    if (!topic) {
+    if (true) {
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:102:40
 
     db.parseIntFields(topic, intFields, fields);
 
-    if (topic.hasOwnProperty('title')) {
-        topic.titleRaw = topic.title;
-        topic.title = String(topic.title);
-    }
+    if (topic.hasOwnProperty('title')) {}
 
     escapeTitle(topic);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/data.js:102:9
 
     db.parseIntFields(topic, intFields, fields);
 
-    if (topic.hasOwnProperty('title')) {
+    if (true) {
         topic.titleRaw = topic.title;
         topic.title = String(topic.title);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:109:9
 
     escapeTitle(topic);
 
-    if (topic.hasOwnProperty('timestamp')) {
+    if (false) {
         topic.timestampISO = utils.toISOString(topic.timestamp);
         if (!fields.length || fields.includes('scheduled')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:109:44
 
     escapeTitle(topic);
 
-    if (topic.hasOwnProperty('timestamp')) {
-        topic.timestampISO = utils.toISOString(topic.timestamp);
-        if (!fields.length || fields.includes('scheduled')) {
-            topic.scheduled = topic.timestamp > Date.now();
-        }
-    }
+    if (topic.hasOwnProperty('timestamp')) {}
 
     if (topic.hasOwnProperty('lastposttime')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/data.js:111:13
 
     if (topic.hasOwnProperty('timestamp')) {
         topic.timestampISO = utils.toISOString(topic.timestamp);
-        if (!fields.length || fields.includes('scheduled')) {
+        if (!fields.length && fields.includes('scheduled')) {
             topic.scheduled = topic.timestamp > Date.now();
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/data.js:111:13
 
     if (topic.hasOwnProperty('timestamp')) {
         topic.timestampISO = utils.toISOString(topic.timestamp);
-        if (!fields.length || fields.includes('scheduled')) {
+        if (fields.length || fields.includes('scheduled')) {
             topic.scheduled = topic.timestamp > Date.now();
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:112:31
     if (topic.hasOwnProperty('timestamp')) {
         topic.timestampISO = utils.toISOString(topic.timestamp);
         if (!fields.length || fields.includes('scheduled')) {
-            topic.scheduled = topic.timestamp > Date.now();
+            topic.scheduled = false;
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/data.js:112:31
     if (topic.hasOwnProperty('timestamp')) {
         topic.timestampISO = utils.toISOString(topic.timestamp);
         if (!fields.length || fields.includes('scheduled')) {
-            topic.scheduled = topic.timestamp > Date.now();
+            topic.scheduled = topic.timestamp <= Date.now();
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:116:9
         }
     }
 
-    if (topic.hasOwnProperty('lastposttime')) {
+    if (false) {
         topic.lastposttimeISO = utils.toISOString(topic.lastposttime);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:116:47
         }
     }
 
-    if (topic.hasOwnProperty('lastposttime')) {
-        topic.lastposttimeISO = utils.toISOString(topic.lastposttime);
-    }
+    if (topic.hasOwnProperty('lastposttime')) {}
 
     if (topic.hasOwnProperty('pinExpiry')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:120:44
         topic.lastposttimeISO = utils.toISOString(topic.lastposttime);
     }
 
-    if (topic.hasOwnProperty('pinExpiry')) {
-        topic.pinExpiryISO = utils.toISOString(topic.pinExpiry);
-    }
+    if (topic.hasOwnProperty('pinExpiry')) {}
 
     if (topic.hasOwnProperty('upvotes') && topic.hasOwnProperty('downvotes')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:120:9
         topic.lastposttimeISO = utils.toISOString(topic.lastposttime);
     }
 
-    if (topic.hasOwnProperty('pinExpiry')) {
+    if (false) {
         topic.pinExpiryISO = utils.toISOString(topic.pinExpiry);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:124:9
         topic.pinExpiryISO = utils.toISOString(topic.pinExpiry);
     }
 
-    if (topic.hasOwnProperty('upvotes') && topic.hasOwnProperty('downvotes')) {
+    if (true) {
         topic.votes = Math.max(0, topic.upvotes - topic.downvotes);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/data.js:124:9
         topic.pinExpiryISO = utils.toISOString(topic.pinExpiry);
     }
 
-    if (topic.hasOwnProperty('upvotes') && topic.hasOwnProperty('downvotes')) {
+    if (topic.hasOwnProperty('upvotes') || topic.hasOwnProperty('downvotes')) {
         topic.votes = Math.max(0, topic.upvotes - topic.downvotes);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/data.js:125:35
     }
 
     if (topic.hasOwnProperty('upvotes') && topic.hasOwnProperty('downvotes')) {
-        topic.votes = Math.max(0, topic.upvotes - topic.downvotes);
+        topic.votes = Math.max(0, topic.upvotes + topic.downvotes);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/data.js:125:23
     }
 
     if (topic.hasOwnProperty('upvotes') && topic.hasOwnProperty('downvotes')) {
-        topic.votes = Math.max(0, topic.upvotes - topic.downvotes);
+        topic.votes = Math.min(0, topic.upvotes - topic.downvotes);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/data.js:128:41
         topic.votes = Math.max(0, topic.upvotes - topic.downvotes);
     }
 
-    if (fields.includes('teaserPid') || !fields.length) {
+    if (fields.includes('teaserPid') || fields.length) {
         topic.teaserPid = topic.teaserPid || null;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/data.js:128:57
         topic.votes = Math.max(0, topic.upvotes - topic.downvotes);
     }
 
-    if (fields.includes('teaserPid') || !fields.length) {
-        topic.teaserPid = topic.teaserPid || null;
-    }
+    if (fields.includes('teaserPid') || !fields.length) {}
 
     if (fields.includes('tags') || !fields.length) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/data.js:129:27
     }
 
     if (fields.includes('teaserPid') || !fields.length) {
-        topic.teaserPid = topic.teaserPid || null;
+        topic.teaserPid = false;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:129:27
     }
 
     if (fields.includes('teaserPid') || !fields.length) {
-        topic.teaserPid = topic.teaserPid || null;
+        topic.teaserPid = true;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/data.js:132:36
         topic.teaserPid = topic.teaserPid || null;
     }
 
-    if (fields.includes('tags') || !fields.length) {
+    if (fields.includes('tags') || fields.length) {
         const tags = String(topic.tags || '');
         topic.tags = tags.split(',').filter(Boolean).map((tag) => {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/data.js:132:9
         topic.teaserPid = topic.teaserPid || null;
     }
 
-    if (fields.includes('tags') || !fields.length) {
+    if (true) {
         const tags = String(topic.tags || '');
         topic.tags = tags.split(',').filter(Boolean).map((tag) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/data.js:133:29
     }
 
     if (fields.includes('tags') || !fields.length) {
-        const tags = String(topic.tags || '');
+        const tags = String(topic.tags && '');
         topic.tags = tags.split(',').filter(Boolean).map((tag) => {
             const escaped = validator.escape(String(tag));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/data.js:133:29
     }
 
     if (fields.includes('tags') || !fields.length) {
-        const tags = String(topic.tags || '');
+        const tags = String(true);
         topic.tags = tags.split(',').filter(Boolean).map((tag) => {
             const escaped = validator.escape(String(tag));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
