[Killed] StringLiteral
src/topics/events.js:27:15
  */
 Events._types = {
     pin: {
-        icon: 'fa-thumb-tack',
+        icon: "",
         text: '[[topic:pinned-by]]',
     },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/events.js:28:15
 Events._types = {
     pin: {
         icon: 'fa-thumb-tack',
-        text: '[[topic:pinned-by]]',
+        text: "",
     },
     unpin: {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/events.js:31:15
         text: '[[topic:pinned-by]]',
     },
     unpin: {
-        icon: 'fa-thumb-tack',
+        icon: "",
         text: '[[topic:unpinned-by]]',
     },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/events.js:32:15
     },
     unpin: {
         icon: 'fa-thumb-tack',
-        text: '[[topic:unpinned-by]]',
+        text: "",
     },
     lock: {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/topics/events.js:34:11
         icon: 'fa-thumb-tack',
         text: '[[topic:unpinned-by]]',
     },
-    lock: {
-        icon: 'fa-lock',
-        text: '[[topic:locked-by]]',
-    },
+    lock: {},
     unlock: {
         icon: 'fa-unlock',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/topics/events.js:42:13
         icon: 'fa-unlock',
         text: '[[topic:unlocked-by]]',
     },
-    delete: {
-        icon: 'fa-trash',
-        text: '[[topic:deleted-by]]',
-    },
+    delete: {},
     restore: {
         icon: 'fa-trash-o',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/topics/events.js:46:14
         icon: 'fa-trash',
         text: '[[topic:deleted-by]]',
     },
-    restore: {
-        icon: 'fa-trash-o',
-        text: '[[topic:restored-by]]',
-    },
+    restore: {},
     move: {
         icon: 'fa-arrow-circle-right',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/events.js:47:15
         text: '[[topic:deleted-by]]',
     },
     restore: {
-        icon: 'fa-trash-o',
+        icon: "",
         text: '[[topic:restored-by]]',
     },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/topics/events.js:50:11
         icon: 'fa-trash-o',
         text: '[[topic:restored-by]]',
     },
-    move: {
-        icon: 'fa-arrow-circle-right',
-        // text: '[[topic:moved-from-by]]',
-    },
+    move: {},
     'post-queue': {
         icon: 'fa-history',
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/events.js:51:15
         text: '[[topic:restored-by]]',
     },
     move: {
-        icon: 'fa-arrow-circle-right',
+        icon: "",
         // text: '[[topic:moved-from-by]]',
     },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/events.js:60:15
         href: '/post-queue',
     },
     backlink: {
-        icon: 'fa-link',
+        icon: "",
         text: '[[topic:backlink]]',
     },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/topics/events.js:63:11
         icon: 'fa-link',
         text: '[[topic:backlink]]',
     },
-    fork: {
-        icon: 'fa-code-fork',
-        text: '[[topic:forked-by]]',
-    },
+    fork: {},
 };
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/events.js:64:15
         text: '[[topic:backlink]]',
     },
     fork: {
-        icon: 'fa-code-fork',
+        icon: "",
         text: '[[topic:forked-by]]',
     },
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/topics/events.js:69:27
     },
 };
 
-Events.init = async () => {
-    // Allow plugins to define additional topic event types
-    const { types } = await plugins.hooks.fire('filter:topicEvents.init', { types: Events._types });
-    Events._types = types;
-};
+Events.init = async () => {};
 
 Events.get = async (tid, uid, reverse = false) => {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] ObjectLiteral
src/topics/events.js:71:75
 
 Events.init = async () => {
     // Allow plugins to define additional topic event types
-    const { types } = await plugins.hooks.fire('filter:topicEvents.init', { types: Events._types });
+    const { types } = await plugins.hooks.fire('filter:topicEvents.init', {});
     Events._types = types;
 };
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] StringLiteral
src/topics/events.js:71:48
 
 Events.init = async () => {
     // Allow plugins to define additional topic event types
-    const { types } = await plugins.hooks.fire('filter:topicEvents.init', { types: Events._types });
+    const { types } = await plugins.hooks.fire("", { types: Events._types });
     Events._types = types;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot destructure property 'types' of '(intermediate value)' as it is undefined.

[Killed] BooleanLiteral
src/topics/events.js:75:41
     Events._types = types;
 };
 
-Events.get = async (tid, uid, reverse = false) => {
+Events.get = async (tid, uid, reverse = true) => {
     const topics = require('.');
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:75:51
     Events._types = types;
 };
 
-Events.get = async (tid, uid, reverse = false) => {
-    const topics = require('.');
-
-    if (!await topics.exists(tid)) {
-        throw new Error('[[error:no-topic]]');
-    }
-
-    let eventIds = await db.getSortedSetRangeWithScores(`topic:${tid}:events`, 0, -1);
-    const keys = eventIds.map(obj => `topicEvent:${obj.value}`);
-    const timestamps = eventIds.map(obj => obj.score);
-    eventIds = eventIds.map(obj => obj.value);
-    let events = await db.getObjects(keys);
-    events = await modifyEvent({ tid, uid, eventIds, timestamps, events });
-    if (reverse) {
-        events.reverse();
-    }
-    return events;
-};
+Events.get = async (tid, uid, reverse = false) => {};
 
 async function getUserInfo(uids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/events.js:78:9
 Events.get = async (tid, uid, reverse = false) => {
     const topics = require('.');
 
-    if (!await topics.exists(tid)) {
+    if (await topics.exists(tid)) {
         throw new Error('[[error:no-topic]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:78:9
 Events.get = async (tid, uid, reverse = false) => {
     const topics = require('.');
 
-    if (!await topics.exists(tid)) {
+    if (true) {
         throw new Error('[[error:no-topic]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/topics/events.js:79:25
     const topics = require('.');
 
     if (!await topics.exists(tid)) {
-        throw new Error('[[error:no-topic]]');
+        throw new Error("");
     }
 

[Killed] UnaryOperator
src/topics/events.js:82:83
         throw new Error('[[error:no-topic]]');
     }
 
-    let eventIds = await db.getSortedSetRangeWithScores(`topic:${tid}:events`, 0, -1);
+    let eventIds = await db.getSortedSetRangeWithScores(`topic:${tid}:events`, 0, +1);
     const keys = eventIds.map(obj => `topicEvent:${obj.value}`);
     const timestamps = eventIds.map(obj => obj.score);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/events.js:82:57
         throw new Error('[[error:no-topic]]');
     }
 
-    let eventIds = await db.getSortedSetRangeWithScores(`topic:${tid}:events`, 0, -1);
+    let eventIds = await db.getSortedSetRangeWithScores(``, 0, -1);
     const keys = eventIds.map(obj => `topicEvent:${obj.value}`);
     const timestamps = eventIds.map(obj => obj.score);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:83:31
     }
 
     let eventIds = await db.getSortedSetRangeWithScores(`topic:${tid}:events`, 0, -1);
-    const keys = eventIds.map(obj => `topicEvent:${obj.value}`);
+    const keys = eventIds.map(() => undefined);
     const timestamps = eventIds.map(obj => obj.score);
     eventIds = eventIds.map(obj => obj.value);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/events.js:83:38
     }
 
     let eventIds = await db.getSortedSetRangeWithScores(`topic:${tid}:events`, 0, -1);
-    const keys = eventIds.map(obj => `topicEvent:${obj.value}`);
+    const keys = eventIds.map(obj => ``);
     const timestamps = eventIds.map(obj => obj.score);
     eventIds = eventIds.map(obj => obj.value);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:84:37
 
     let eventIds = await db.getSortedSetRangeWithScores(`topic:${tid}:events`, 0, -1);
     const keys = eventIds.map(obj => `topicEvent:${obj.value}`);
-    const timestamps = eventIds.map(obj => obj.score);
+    const timestamps = eventIds.map(() => undefined);
     eventIds = eventIds.map(obj => obj.value);
     let events = await db.getObjects(keys);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:85:29
     let eventIds = await db.getSortedSetRangeWithScores(`topic:${tid}:events`, 0, -1);
     const keys = eventIds.map(obj => `topicEvent:${obj.value}`);
     const timestamps = eventIds.map(obj => obj.score);
-    eventIds = eventIds.map(obj => obj.value);
+    eventIds = eventIds.map(() => undefined);
     let events = await db.getObjects(keys);
     events = await modifyEvent({ tid, uid, eventIds, timestamps, events });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/events.js:87:32
     const timestamps = eventIds.map(obj => obj.score);
     eventIds = eventIds.map(obj => obj.value);
     let events = await db.getObjects(keys);
-    events = await modifyEvent({ tid, uid, eventIds, timestamps, events });
+    events = await modifyEvent({});
     if (reverse) {
         events.reverse();
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:88:9
     eventIds = eventIds.map(obj => obj.value);
     let events = await db.getObjects(keys);
     events = await modifyEvent({ tid, uid, eventIds, timestamps, events });
-    if (reverse) {
+    if (true) {
         events.reverse();
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:88:9
     eventIds = eventIds.map(obj => obj.value);
     let events = await db.getObjects(keys);
     events = await modifyEvent({ tid, uid, eventIds, timestamps, events });
-    if (reverse) {
+    if (false) {
         events.reverse();
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:89:9
     let events = await db.getObjects(keys);
     events = await modifyEvent({ tid, uid, eventIds, timestamps, events });
     if (reverse) {
-        events.reverse();
+        events;
     }
     return events;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:94:34
     return events;
 };
 
-async function getUserInfo(uids) {
-    uids = uids.filter((uid, idx) => !isNaN(parseInt(uid, 10)) && uids.indexOf(uid) === idx);
-    const userData = await user.getUsersFields(uids, ['picture', 'username', 'userslug']);
-    const userMap = userData.reduce((memo, cur) => memo.set(cur.uid, cur), new Map());
-    userMap.set('system', {
-        system: true,
-    });
-
-    return userMap;
-}
+async function getUserInfo(uids) {}
 
 async function getCategoryInfo(cids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:95:24
 };
 
 async function getUserInfo(uids) {
-    uids = uids.filter((uid, idx) => !isNaN(parseInt(uid, 10)) && uids.indexOf(uid) === idx);
+    uids = uids.filter(() => undefined);
     const userData = await user.getUsersFields(uids, ['picture', 'username', 'userslug']);
     const userMap = userData.reduce((memo, cur) => memo.set(cur.uid, cur), new Map());
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:95:12
 };
 
 async function getUserInfo(uids) {
-    uids = uids.filter((uid, idx) => !isNaN(parseInt(uid, 10)) && uids.indexOf(uid) === idx);
+    uids = uids;
     const userData = await user.getUsersFields(uids, ['picture', 'username', 'userslug']);
     const userMap = userData.reduce((memo, cur) => memo.set(cur.uid, cur), new Map());
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:97:37
 async function getUserInfo(uids) {
     uids = uids.filter((uid, idx) => !isNaN(parseInt(uid, 10)) && uids.indexOf(uid) === idx);
     const userData = await user.getUsersFields(uids, ['picture', 'username', 'userslug']);
-    const userMap = userData.reduce((memo, cur) => memo.set(cur.uid, cur), new Map());
+    const userMap = userData.reduce(() => undefined, new Map());
     userMap.set('system', {
         system: true,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/events.js:98:27
     uids = uids.filter((uid, idx) => !isNaN(parseInt(uid, 10)) && uids.indexOf(uid) === idx);
     const userData = await user.getUsersFields(uids, ['picture', 'username', 'userslug']);
     const userMap = userData.reduce((memo, cur) => memo.set(cur.uid, cur), new Map());
-    userMap.set('system', {
-        system: true,
-    });
+    userMap.set('system', {});
 
     return userMap;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/events.js:99:17
     const userData = await user.getUsersFields(uids, ['picture', 'username', 'userslug']);
     const userMap = userData.reduce((memo, cur) => memo.set(cur.uid, cur), new Map());
     userMap.set('system', {
-        system: true,
+        system: false,
     });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:105:38
     return userMap;
 }
 
-async function getCategoryInfo(cids) {
-    const uniqCids = _.uniq(cids);
-    const catData = await categories.getCategoriesFields(uniqCids, ['name', 'slug', 'icon', 'color', 'bgColor']);
-    return _.zipObject(uniqCids, catData);
-}
+async function getCategoryInfo(cids) {}
 
 async function modifyEvent({ tid, uid, eventIds, timestamps, events }) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/events.js:107:69
 
 async function getCategoryInfo(cids) {
     const uniqCids = _.uniq(cids);
-    const catData = await categories.getCategoriesFields(uniqCids, ['name', 'slug', 'icon', 'color', 'bgColor']);
+    const catData = await categories.getCategoriesFields(uniqCids, ["", 'slug', 'icon', 'color', 'bgColor']);
     return _.zipObject(uniqCids, catData);
 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:114:9
 async function modifyEvent({ tid, uid, eventIds, timestamps, events }) {
     // Add posts from post queue
     const isPrivileged = await user.isPrivileged(uid);
-    if (isPrivileged) {
+    if (false) {
         const queuedPosts = await posts.getQueuedPosts({ tid }, { metadata: false });
         events.push(...queuedPosts.map(item => ({
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:114:23
 async function modifyEvent({ tid, uid, eventIds, timestamps, events }) {
     // Add posts from post queue
     const isPrivileged = await user.isPrivileged(uid);
-    if (isPrivileged) {
-        const queuedPosts = await posts.getQueuedPosts({ tid }, { metadata: false });
-        events.push(...queuedPosts.map(item => ({
-            type: 'post-queue',
-            timestamp: item.data.timestamp || Date.now(),
-            uid: item.data.uid,
-        })));
-        queuedPosts.forEach((item) => {
-            timestamps.push(item.data.timestamp || Date.now());
-        });
-    }
+    if (isPrivileged) {}
 
     const [users, fromCategories] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/events.js:115:77
     // Add posts from post queue
     const isPrivileged = await user.isPrivileged(uid);
     if (isPrivileged) {
-        const queuedPosts = await posts.getQueuedPosts({ tid }, { metadata: false });
+        const queuedPosts = await posts.getQueuedPosts({ tid }, { metadata: true });
         events.push(...queuedPosts.map(item => ({
             type: 'post-queue',
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/events.js:115:56
     // Add posts from post queue
     const isPrivileged = await user.isPrivileged(uid);
     if (isPrivileged) {
-        const queuedPosts = await posts.getQueuedPosts({ tid }, { metadata: false });
+        const queuedPosts = await posts.getQueuedPosts({}, { metadata: false });
         events.push(...queuedPosts.map(item => ({
             type: 'post-queue',
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/events.js:116:40
     const isPrivileged = await user.isPrivileged(uid);
     if (isPrivileged) {
         const queuedPosts = await posts.getQueuedPosts({ tid }, { metadata: false });
-        events.push(...queuedPosts.map(item => ({
-            type: 'post-queue',
-            timestamp: item.data.timestamp || Date.now(),
-            uid: item.data.uid,
-        })));
+        events.push(...queuedPosts.map(() => undefined));
         queuedPosts.forEach((item) => {
             timestamps.push(item.data.timestamp || Date.now());
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] LogicalOperator
src/topics/events.js:118:24
         const queuedPosts = await posts.getQueuedPosts({ tid }, { metadata: false });
         events.push(...queuedPosts.map(item => ({
             type: 'post-queue',
-            timestamp: item.data.timestamp || Date.now(),
+            timestamp: item.data.timestamp && Date.now(),
             uid: item.data.uid,
         })));

[NoCoverage] ConditionalExpression
src/topics/events.js:118:24
         const queuedPosts = await posts.getQueuedPosts({ tid }, { metadata: false });
         events.push(...queuedPosts.map(item => ({
             type: 'post-queue',
-            timestamp: item.data.timestamp || Date.now(),
+            timestamp: true,
             uid: item.data.uid,
         })));

[NoCoverage] BlockStatement
src/topics/events.js:121:39
             timestamp: item.data.timestamp || Date.now(),
             uid: item.data.uid,
         })));
-        queuedPosts.forEach((item) => {
-            timestamps.push(item.data.timestamp || Date.now());
-        });
+        queuedPosts.forEach((item) => {});
     }
 

[NoCoverage] ConditionalExpression
src/topics/events.js:122:29
             uid: item.data.uid,
         })));
         queuedPosts.forEach((item) => {
-            timestamps.push(item.data.timestamp || Date.now());
+            timestamps.push(true);
         });
     }

[NoCoverage] ConditionalExpression
src/topics/events.js:122:29
             uid: item.data.uid,
         })));
         queuedPosts.forEach((item) => {
-            timestamps.push(item.data.timestamp || Date.now());
+            timestamps.push(false);
         });
     }

[Killed] ArrowFunction
src/topics/events.js:127:32
     }
 
     const [users, fromCategories] = await Promise.all([
-        getUserInfo(events.map(event => event.uid).filter(Boolean)),
+        getUserInfo(events.map(() => undefined).filter(Boolean)),
         getCategoryInfo(events.map(event => event.fromCid).filter(Boolean)),
     ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:127:21
     }
 
     const [users, fromCategories] = await Promise.all([
-        getUserInfo(events.map(event => event.uid).filter(Boolean)),
+        getUserInfo(events.map(event => event.uid)),
         getCategoryInfo(events.map(event => event.fromCid).filter(Boolean)),
     ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:128:25
 
     const [users, fromCategories] = await Promise.all([
         getUserInfo(events.map(event => event.uid).filter(Boolean)),
-        getCategoryInfo(events.map(event => event.fromCid).filter(Boolean)),
+        getCategoryInfo(events.map(event => event.fromCid)),
     ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:128:36
 
     const [users, fromCategories] = await Promise.all([
         getUserInfo(events.map(event => event.uid).filter(Boolean)),
-        getCategoryInfo(events.map(event => event.fromCid).filter(Boolean)),
+        getCategoryInfo(events.map(() => undefined).filter(Boolean)),
     ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:132:9
     ]);
 
     // Remove backlink events if backlinks are disabled
-    if (meta.config.topicBacklinks !== 1) {
+    if (true) {
         events = events.filter(event => event.type !== 'backlink');
     } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/events.js:132:9
     ]);
 
     // Remove backlink events if backlinks are disabled
-    if (meta.config.topicBacklinks !== 1) {
+    if (meta.config.topicBacklinks === 1) {
         events = events.filter(event => event.type !== 'backlink');
     } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/events.js:133:41
 
     // Remove backlink events if backlinks are disabled
     if (meta.config.topicBacklinks !== 1) {
-        events = events.filter(event => event.type !== 'backlink');
+        events = events.filter(event => event.type === 'backlink');
     } else {
         // remove backlinks that we dont have read permission
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:133:32
 
     // Remove backlink events if backlinks are disabled
     if (meta.config.topicBacklinks !== 1) {
-        events = events.filter(event => event.type !== 'backlink');
+        events = events.filter(() => undefined);
     } else {
         // remove backlinks that we dont have read permission
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:134:12
     // Remove backlink events if backlinks are disabled
     if (meta.config.topicBacklinks !== 1) {
         events = events.filter(event => event.type !== 'backlink');
-    } else {
-        // remove backlinks that we dont have read permission
-        const backlinkPids = events.filter(e => e.type === 'backlink')
-            .map(e => e.href.split('/').pop());
-        const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
-        events = events.filter(
-            e => e.type !== 'backlink' || pids.includes(e.href.split('/').pop())
-        );
-    }
+    } else {}
 
     // Remove events whose types no longer exist (e.g. plugin uninstalled)
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/events.js:136:49
         events = events.filter(event => event.type !== 'backlink');
     } else {
         // remove backlinks that we dont have read permission
-        const backlinkPids = events.filter(e => e.type === 'backlink')
+        const backlinkPids = events.filter(e => true)
             .map(e => e.href.split('/').pop());
         const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/events.js:136:49
         events = events.filter(event => event.type !== 'backlink');
     } else {
         // remove backlinks that we dont have read permission
-        const backlinkPids = events.filter(e => e.type === 'backlink')
+        const backlinkPids = events.filter(e => e.type !== 'backlink')
             .map(e => e.href.split('/').pop());
         const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:137:18
     } else {
         // remove backlinks that we dont have read permission
         const backlinkPids = events.filter(e => e.type === 'backlink')
-            .map(e => e.href.split('/').pop());
+            .map(() => undefined);
         const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
         events = events.filter(
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:138:28
         // remove backlinks that we dont have read permission
         const backlinkPids = events.filter(e => e.type === 'backlink')
             .map(e => e.href.split('/').pop());
-        const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
+        const pids = await privileges.posts;
         events = events.filter(
             e => e.type !== 'backlink' || pids.includes(e.href.split('/').pop())
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
