[Killed] StringLiteral
src/topics/events.js:138:52
         // remove backlinks that we dont have read permission
         const backlinkPids = events.filter(e => e.type === 'backlink')
             .map(e => e.href.split('/').pop());
-        const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
+        const pids = await privileges.posts.filter("", backlinkPids, uid);
         events = events.filter(
             e => e.type !== 'backlink' || pids.includes(e.href.split('/').pop())
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:139:18
         const backlinkPids = events.filter(e => e.type === 'backlink')
             .map(e => e.href.split('/').pop());
         const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
-        events = events.filter(
-            e => e.type !== 'backlink' || pids.includes(e.href.split('/').pop())
-        );
+        events = events;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/events.js:140:18
             .map(e => e.href.split('/').pop());
         const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
         events = events.filter(
-            e => e.type !== 'backlink' || pids.includes(e.href.split('/').pop())
+            e => e.type === 'backlink' || pids.includes(e.href.split('/').pop())
         );
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:140:13
             .map(e => e.href.split('/').pop());
         const pids = await privileges.posts.filter('topics:read', backlinkPids, uid);
         events = events.filter(
-            e => e.type !== 'backlink' || pids.includes(e.href.split('/').pop())
+            () => undefined
         );
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:145:28
     }
 
     // Remove events whose types no longer exist (e.g. plugin uninstalled)
-    events = events.filter(event => Events._types.hasOwnProperty(event.type));
+    events = events.filter(() => undefined);
 
     // Add user & metadata
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:145:14
     }
 
     // Remove events whose types no longer exist (e.g. plugin uninstalled)
-    events = events.filter(event => Events._types.hasOwnProperty(event.type));
+    events = events;
 
     // Add user & metadata
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:148:36
     events = events.filter(event => Events._types.hasOwnProperty(event.type));
 
     // Add user & metadata
-    events.forEach((event, idx) => {
-        event.id = parseInt(eventIds[idx], 10);
-        event.timestamp = timestamps[idx];
-        event.timestampISO = new Date(timestamps[idx]).toISOString();
-        if (event.hasOwnProperty('uid')) {
-            event.user = users.get(event.uid === 'system' ? 'system' : parseInt(event.uid, 10));
-        }
-        if (event.hasOwnProperty('fromCid')) {
-            event.fromCategory = fromCategories[event.fromCid];
-            event.text = translator.compile('topic:moved-from-by', event.fromCategory.name);
-        }
-
-        Object.assign(event, Events._types[event.type]);
-    });
+    events.forEach((event, idx) => {});
 
     // Sort events
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:152:42
         event.id = parseInt(eventIds[idx], 10);
         event.timestamp = timestamps[idx];
         event.timestampISO = new Date(timestamps[idx]).toISOString();
-        if (event.hasOwnProperty('uid')) {
-            event.user = users.get(event.uid === 'system' ? 'system' : parseInt(event.uid, 10));
-        }
+        if (event.hasOwnProperty('uid')) {}
         if (event.hasOwnProperty('fromCid')) {
             event.fromCategory = fromCategories[event.fromCid];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:152:13
         event.id = parseInt(eventIds[idx], 10);
         event.timestamp = timestamps[idx];
         event.timestampISO = new Date(timestamps[idx]).toISOString();
-        if (event.hasOwnProperty('uid')) {
+        if (true) {
             event.user = users.get(event.uid === 'system' ? 'system' : parseInt(event.uid, 10));
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/topics/events.js:153:36
         event.timestamp = timestamps[idx];
         event.timestampISO = new Date(timestamps[idx]).toISOString();
         if (event.hasOwnProperty('uid')) {
-            event.user = users.get(event.uid === 'system' ? 'system' : parseInt(event.uid, 10));
+            event.user = users.get(event.uid !== 'system' ? 'system' : parseInt(event.uid, 10));
         }
         if (event.hasOwnProperty('fromCid')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:153:36
         event.timestamp = timestamps[idx];
         event.timestampISO = new Date(timestamps[idx]).toISOString();
         if (event.hasOwnProperty('uid')) {
-            event.user = users.get(event.uid === 'system' ? 'system' : parseInt(event.uid, 10));
+            event.user = users.get(true ? 'system' : parseInt(event.uid, 10));
         }
         if (event.hasOwnProperty('fromCid')) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:155:13
         if (event.hasOwnProperty('uid')) {
             event.user = users.get(event.uid === 'system' ? 'system' : parseInt(event.uid, 10));
         }
-        if (event.hasOwnProperty('fromCid')) {
+        if (true) {
             event.fromCategory = fromCategories[event.fromCid];
             event.text = translator.compile('topic:moved-from-by', event.fromCategory.name);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:155:13
         if (event.hasOwnProperty('uid')) {
             event.user = users.get(event.uid === 'system' ? 'system' : parseInt(event.uid, 10));
         }
-        if (event.hasOwnProperty('fromCid')) {
+        if (false) {
             event.fromCategory = fromCategories[event.fromCid];
             event.text = translator.compile('topic:moved-from-by', event.fromCategory.name);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/events.js:157:45
         }
         if (event.hasOwnProperty('fromCid')) {
             event.fromCategory = fromCategories[event.fromCid];
-            event.text = translator.compile('topic:moved-from-by', event.fromCategory.name);
+            event.text = translator.compile("", event.fromCategory.name);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:164:5
     });
 
     // Sort events
-    events.sort((a, b) => a.timestamp - b.timestamp);
+    events;
 
     return events;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/events.js:164:27
     });
 
     // Sort events
-    events.sort((a, b) => a.timestamp - b.timestamp);
+    events.sort((a, b) => a.timestamp + b.timestamp);
 
     return events;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/events.js:172:23
 Events.log = async (tid, payload) => {
     const topics = require('.');
     const { type } = payload;
-    const timestamp = payload.timestamp || Date.now();
+    const timestamp = payload.timestamp && Date.now();
 
     if (!Events._types.hasOwnProperty(type)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:172:23
 Events.log = async (tid, payload) => {
     const topics = require('.');
     const { type } = payload;
-    const timestamp = payload.timestamp || Date.now();
+    const timestamp = false;
 
     if (!Events._types.hasOwnProperty(type)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/events.js:174:9
     const { type } = payload;
     const timestamp = payload.timestamp || Date.now();
 
-    if (!Events._types.hasOwnProperty(type)) {
+    if (Events._types.hasOwnProperty(type)) {
         throw new Error(`[[error:topic-event-unrecognized, ${type}]]`);
     } else if (!await topics.exists(tid)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:174:9
     const { type } = payload;
     const timestamp = payload.timestamp || Date.now();
 
-    if (!Events._types.hasOwnProperty(type)) {
+    if (false) {
         throw new Error(`[[error:topic-event-unrecognized, ${type}]]`);
     } else if (!await topics.exists(tid)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/topics/events.js:175:25
     const timestamp = payload.timestamp || Date.now();
 
     if (!Events._types.hasOwnProperty(type)) {
-        throw new Error(`[[error:topic-event-unrecognized, ${type}]]`);
+        throw new Error(``);
     } else if (!await topics.exists(tid)) {
         throw new Error('[[error:no-topic]]');

[Killed] ConditionalExpression
src/topics/events.js:176:16
 
     if (!Events._types.hasOwnProperty(type)) {
         throw new Error(`[[error:topic-event-unrecognized, ${type}]]`);
-    } else if (!await topics.exists(tid)) {
+    } else if (false) {
         throw new Error('[[error:no-topic]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:176:16
 
     if (!Events._types.hasOwnProperty(type)) {
         throw new Error(`[[error:topic-event-unrecognized, ${type}]]`);
-    } else if (!await topics.exists(tid)) {
+    } else if (true) {
         throw new Error('[[error:no-topic]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/events.js:183:22
     const eventId = await db.incrObjectField('global', 'nextTopicEventId');
 
     await Promise.all([
-        db.setObject(`topicEvent:${eventId}`, payload),
+        db.setObject(``, payload),
         db.sortedSetAdd(`topic:${tid}:events`, timestamp, eventId),
     ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/events.js:184:25
 
     await Promise.all([
         db.setObject(`topicEvent:${eventId}`, payload),
-        db.sortedSetAdd(`topic:${tid}:events`, timestamp, eventId),
+        db.sortedSetAdd(``, timestamp, eventId),
     ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/events.js:189:21
 
     let events = await modifyEvent({
         eventIds: [eventId],
-        timestamps: [timestamp],
+        timestamps: [],
         events: [payload],
     });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/events.js:193:44
         events: [payload],
     });
 
-    ({ events } = await plugins.hooks.fire('filter:topic.events.log', { events }));
+    ({ events } = await plugins.hooks.fire("", { events }));
     return events;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:197:46
     return events;
 };
 
-Events.purge = async (tid, eventIds = []) => {
-    if (eventIds.length) {
-        const isTopicEvent = await db.isSortedSetMembers(`topic:${tid}:events`, eventIds);
-        eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
-        await Promise.all([
-            db.sortedSetRemove(`topic:${tid}:events`, eventIds),
-            db.deleteAll(eventIds.map(id => `topicEvent:${id}`)),
-        ]);
-    } else {
-        const keys = [`topic:${tid}:events`];
-        const eventIds = await db.getSortedSetRange(keys[0], 0, -1);
-        keys.push(...eventIds.map(id => `topicEvent:${id}`));
-
-        await db.deleteAll(keys);
-    }
-};
+Events.purge = async (tid, eventIds = []) => {};
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/events.js:198:9
 };
 
 Events.purge = async (tid, eventIds = []) => {
-    if (eventIds.length) {
+    if (true) {
         const isTopicEvent = await db.isSortedSetMembers(`topic:${tid}:events`, eventIds);
         eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:198:26
 };
 
 Events.purge = async (tid, eventIds = []) => {
-    if (eventIds.length) {
-        const isTopicEvent = await db.isSortedSetMembers(`topic:${tid}:events`, eventIds);
-        eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
-        await Promise.all([
-            db.sortedSetRemove(`topic:${tid}:events`, eventIds),
-            db.deleteAll(eventIds.map(id => `topicEvent:${id}`)),
-        ]);
-    } else {
+    if (eventIds.length) {} else {
         const keys = [`topic:${tid}:events`];
         const eventIds = await db.getSortedSetRange(keys[0], 0, -1);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/events.js:199:58
 
 Events.purge = async (tid, eventIds = []) => {
     if (eventIds.length) {
-        const isTopicEvent = await db.isSortedSetMembers(`topic:${tid}:events`, eventIds);
+        const isTopicEvent = await db.isSortedSetMembers(``, eventIds);
         eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/events.js:200:20
 Events.purge = async (tid, eventIds = []) => {
     if (eventIds.length) {
         const isTopicEvent = await db.isSortedSetMembers(`topic:${tid}:events`, eventIds);
-        eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
+        eventIds = eventIds;
         await Promise.all([
             db.sortedSetRemove(`topic:${tid}:events`, eventIds),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:200:36
 Events.purge = async (tid, eventIds = []) => {
     if (eventIds.length) {
         const isTopicEvent = await db.isSortedSetMembers(`topic:${tid}:events`, eventIds);
-        eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
+        eventIds = eventIds.filter(() => undefined);
         await Promise.all([
             db.sortedSetRemove(`topic:${tid}:events`, eventIds),
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/events.js:202:32
         const isTopicEvent = await db.isSortedSetMembers(`topic:${tid}:events`, eventIds);
         eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
         await Promise.all([
-            db.sortedSetRemove(`topic:${tid}:events`, eventIds),
+            db.sortedSetRemove(``, eventIds),
             db.deleteAll(eventIds.map(id => `topicEvent:${id}`)),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:203:39
         eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
         await Promise.all([
             db.sortedSetRemove(`topic:${tid}:events`, eventIds),
-            db.deleteAll(eventIds.map(id => `topicEvent:${id}`)),
+            db.deleteAll(eventIds.map(() => undefined)),
         ]);
     } else {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/events.js:203:45
         eventIds = eventIds.filter((id, index) => isTopicEvent[index]);
         await Promise.all([
             db.sortedSetRemove(`topic:${tid}:events`, eventIds),
-            db.deleteAll(eventIds.map(id => `topicEvent:${id}`)),
+            db.deleteAll(eventIds.map(id => ``)),
         ]);
     } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/events.js:205:12
             db.sortedSetRemove(`topic:${tid}:events`, eventIds),
             db.deleteAll(eventIds.map(id => `topicEvent:${id}`)),
         ]);
-    } else {
-        const keys = [`topic:${tid}:events`];
-        const eventIds = await db.getSortedSetRange(keys[0], 0, -1);
-        keys.push(...eventIds.map(id => `topicEvent:${id}`));
-
-        await db.deleteAll(keys);
-    }
+    } else {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/events.js:207:65
         ]);
     } else {
         const keys = [`topic:${tid}:events`];
-        const eventIds = await db.getSortedSetRange(keys[0], 0, -1);
+        const eventIds = await db.getSortedSetRange(keys[0], 0, +1);
         keys.push(...eventIds.map(id => `topicEvent:${id}`));
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/events.js:208:35
     } else {
         const keys = [`topic:${tid}:events`];
         const eventIds = await db.getSortedSetRange(keys[0], 0, -1);
-        keys.push(...eventIds.map(id => `topicEvent:${id}`));
+        keys.push(...eventIds.map(() => undefined));
 
         await db.deleteAll(keys);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/events.js:208:41
     } else {
         const keys = [`topic:${tid}:events`];
         const eventIds = await db.getSortedSetRange(keys[0], 0, -1);
-        keys.push(...eventIds.map(id => `topicEvent:${id}`));
+        keys.push(...eventIds.map(id => ``));
 
         await db.deleteAll(keys);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing
