[Killed] BlockStatement
src/topics/delete.js:13:47
 
 
 module.exports = function (Topics) {
-    Topics.delete = async function (tid, uid) {
-        await removeTopicPidsFromCid(tid);
-        await Topics.setTopicFields(tid, {
-            deleted: 1,
-            deleterUid: uid,
-            deletedTimestamp: Date.now(),
-        });
-    };
+    Topics.delete = async function (tid, uid) {};
 
     async function removeTopicPidsFromCid(tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/delete.js:22:48
         });
     };
 
-    async function removeTopicPidsFromCid(tid) {
-        const [cid, pids] = await Promise.all([
-            Topics.getTopicField(tid, 'cid'),
-            Topics.getPids(tid),
-        ]);
-        await db.sortedSetRemove(`cid:${cid}:pids`, pids);
-        await categories.updateRecentTidForCid(cid);
-    }
+    async function removeTopicPidsFromCid(tid) {}
 
     async function addTopicPidsToCid(tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:24:39
 
     async function removeTopicPidsFromCid(tid) {
         const [cid, pids] = await Promise.all([
-            Topics.getTopicField(tid, 'cid'),
+            Topics.getTopicField(tid, ""),
             Topics.getPids(tid),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/delete.js:31:43
         await categories.updateRecentTidForCid(cid);
     }
 
-    async function addTopicPidsToCid(tid) {
-        const [cid, pids] = await Promise.all([
-            Topics.getTopicField(tid, 'cid'),
-            Topics.getPids(tid),
-        ]);
-        let postData = await posts.getPostsFields(pids, ['pid', 'timestamp', 'deleted']);
-        postData = postData.filter(post => post && !post.deleted);
-        const pidsToAdd = postData.map(post => post.pid);
-        const scores = postData.map(post => post.timestamp);
-        await db.sortedSetAdd(`cid:${cid}:pids`, scores, pidsToAdd);
-        await categories.updateRecentTidForCid(cid);
-    }
+    async function addTopicPidsToCid(tid) {}
 
     Topics.restore = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/delete.js:36:57
             Topics.getTopicField(tid, 'cid'),
             Topics.getPids(tid),
         ]);
-        let postData = await posts.getPostsFields(pids, ['pid', 'timestamp', 'deleted']);
+        let postData = await posts.getPostsFields(pids, []);
         postData = postData.filter(post => post && !post.deleted);
         const pidsToAdd = postData.map(post => post.pid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/delete.js:37:52
             Topics.getPids(tid),
         ]);
         let postData = await posts.getPostsFields(pids, ['pid', 'timestamp', 'deleted']);
-        postData = postData.filter(post => post && !post.deleted);
+        postData = postData.filter(post => post && post.deleted);
         const pidsToAdd = postData.map(post => post.pid);
         const scores = postData.map(post => post.timestamp);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/delete.js:37:44
             Topics.getPids(tid),
         ]);
         let postData = await posts.getPostsFields(pids, ['pid', 'timestamp', 'deleted']);
-        postData = postData.filter(post => post && !post.deleted);
+        postData = postData.filter(post => post || !post.deleted);
         const pidsToAdd = postData.map(post => post.pid);
         const scores = postData.map(post => post.timestamp);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/delete.js:38:40
         ]);
         let postData = await posts.getPostsFields(pids, ['pid', 'timestamp', 'deleted']);
         postData = postData.filter(post => post && !post.deleted);
-        const pidsToAdd = postData.map(post => post.pid);
+        const pidsToAdd = postData.map(() => undefined);
         const scores = postData.map(post => post.timestamp);
         await db.sortedSetAdd(`cid:${cid}:pids`, scores, pidsToAdd);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/delete.js:39:37
         let postData = await posts.getPostsFields(pids, ['pid', 'timestamp', 'deleted']);
         postData = postData.filter(post => post && !post.deleted);
         const pidsToAdd = postData.map(post => post.pid);
-        const scores = postData.map(post => post.timestamp);
+        const scores = postData.map(() => undefined);
         await db.sortedSetAdd(`cid:${cid}:pids`, scores, pidsToAdd);
         await categories.updateRecentTidForCid(cid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/delete.js:44:43
         await categories.updateRecentTidForCid(cid);
     }
 
-    Topics.restore = async function (tid) {
-        await Promise.all([
-            Topics.deleteTopicFields(tid, [
-                'deleterUid', 'deletedTimestamp',
-            ]),
-            addTopicPidsToCid(tid),
-        ]);
-        await Topics.setTopicField(tid, 'deleted', 0);
-    };
+    Topics.restore = async function (tid) {};
 
     Topics.purgePostsAndTopic = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/delete.js:46:43
 
     Topics.restore = async function (tid) {
         await Promise.all([
-            Topics.deleteTopicFields(tid, [
-                'deleterUid', 'deletedTimestamp',
-            ]),
+            Topics.deleteTopicFields(tid, []),
             addTopicPidsToCid(tid),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:47:31
     Topics.restore = async function (tid) {
         await Promise.all([
             Topics.deleteTopicFields(tid, [
-                'deleterUid', 'deletedTimestamp',
+                'deleterUid', "",
             ]),
             addTopicPidsToCid(tid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/delete.js:54:59
         await Topics.setTopicField(tid, 'deleted', 0);
     };
 
-    Topics.purgePostsAndTopic = async function (tid, uid) {
-        const mainPid = await Topics.getTopicField(tid, 'mainPid');
-        await batch.processSortedSet(`tid:${tid}:posts`, async (pids) => {
-            await posts.purge(pids, uid);
-        }, { alwaysStartAt: 0, batch: 500 });
-        await posts.purge(mainPid, uid);
-        await Topics.purge(tid, uid);
-    };
+    Topics.purgePostsAndTopic = async function (tid, uid) {};
 
     Topics.purge = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/delete.js:56:74
 
     Topics.purgePostsAndTopic = async function (tid, uid) {
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
-        await batch.processSortedSet(`tid:${tid}:posts`, async (pids) => {
-            await posts.purge(pids, uid);
-        }, { alwaysStartAt: 0, batch: 500 });
+        await batch.processSortedSet(`tid:${tid}:posts`, async (pids) => {}, { alwaysStartAt: 0, batch: 500 });
         await posts.purge(mainPid, uid);
         await Topics.purge(tid, uid);

[Killed] StringLiteral
src/topics/delete.js:56:38
 
     Topics.purgePostsAndTopic = async function (tid, uid) {
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
-        await batch.processSortedSet(`tid:${tid}:posts`, async (pids) => {
+        await batch.processSortedSet(``, async (pids) => {
             await posts.purge(pids, uid);
         }, { alwaysStartAt: 0, batch: 500 });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/delete.js:58:12
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
         await batch.processSortedSet(`tid:${tid}:posts`, async (pids) => {
             await posts.purge(pids, uid);
-        }, { alwaysStartAt: 0, batch: 500 });
+        }, {});
         await posts.purge(mainPid, uid);
         await Topics.purge(tid, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/delete.js:68:13
             Topics.getTopicData(tid),
             Topics.getTopicTags(tid),
         ]);
-        if (!deletedTopic) {
+        if (deletedTopic) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/delete.js:68:13
             Topics.getTopicData(tid),
             Topics.getTopicTags(tid),
         ]);
-        if (!deletedTopic) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/delete.js:75:26
         await deleteFromFollowersIgnorers(tid);
 
         await Promise.all([
-            db.deleteAll([
-                `tid:${tid}:followers`,
-                `tid:${tid}:ignorers`,
-                `tid:${tid}:posts`,
-                `tid:${tid}:posts:votes`,
-                `tid:${tid}:bookmarks`,
-                `tid:${tid}:posters`,
-            ]),
+            db.deleteAll([]),
             db.sortedSetsRemove([
                 'topics:tid',
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:76:17
 
         await Promise.all([
             db.deleteAll([
-                `tid:${tid}:followers`,
+                ``,
                 `tid:${tid}:ignorers`,
                 `tid:${tid}:posts`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:79:17
                 `tid:${tid}:followers`,
                 `tid:${tid}:ignorers`,
                 `tid:${tid}:posts`,
-                `tid:${tid}:posts:votes`,
+                ``,
                 `tid:${tid}:bookmarks`,
                 `tid:${tid}:posters`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:84:17
                 `tid:${tid}:posters`,
             ]),
             db.sortedSetsRemove([
-                'topics:tid',
+                "",
                 'topics:recent',
                 'topics:posts',
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:85:17
             ]),
             db.sortedSetsRemove([
                 'topics:tid',
-                'topics:recent',
+                "",
                 'topics:posts',
                 'topics:views',
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:88:17
                 'topics:recent',
                 'topics:posts',
                 'topics:views',
-                'topics:votes',
+                "",
                 'topics:scheduled',
             ], tid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:98:25
             reduceCounters(tid),
         ]);
         plugins.hooks.fire('action:topic.purge', { topic: deletedTopic, uid: uid });
-        await db.delete(`topic:${tid}`);
+        await db.delete(``);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/delete.js:101:53
         await db.delete(`topic:${tid}`);
     };
 
-    async function deleteFromFollowersIgnorers(tid) {
-        const [followers, ignorers] = await Promise.all([
-            db.getSetMembers(`tid:${tid}:followers`),
-            db.getSetMembers(`tid:${tid}:ignorers`),
-        ]);
-        const followerKeys = followers.map(uid => `uid:${uid}:followed_tids`);
-        const ignorerKeys = ignorers.map(uid => `uid:${uid}ignored_tids`);
-        await db.sortedSetsRemove(followerKeys.concat(ignorerKeys), tid);
-    }
+    async function deleteFromFollowersIgnorers(tid) {}
 
     async function deleteTopicFromCategoryAndUser(tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/delete.js:106:44
             db.getSetMembers(`tid:${tid}:followers`),
             db.getSetMembers(`tid:${tid}:ignorers`),
         ]);
-        const followerKeys = followers.map(uid => `uid:${uid}:followed_tids`);
+        const followerKeys = followers.map(() => undefined);
         const ignorerKeys = ignorers.map(uid => `uid:${uid}ignored_tids`);
         await db.sortedSetsRemove(followerKeys.concat(ignorerKeys), tid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/delete.js:107:42
             db.getSetMembers(`tid:${tid}:ignorers`),
         ]);
         const followerKeys = followers.map(uid => `uid:${uid}:followed_tids`);
-        const ignorerKeys = ignorers.map(uid => `uid:${uid}ignored_tids`);
+        const ignorerKeys = ignorers.map(() => undefined);
         await db.sortedSetsRemove(followerKeys.concat(ignorerKeys), tid);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/delete.js:111:56
         await db.sortedSetsRemove(followerKeys.concat(ignorerKeys), tid);
     }
 
-    async function deleteTopicFromCategoryAndUser(tid) {
-        const topicData = await Topics.getTopicFields(tid, ['cid', 'uid']);
-        await Promise.all([
-            db.sortedSetsRemove([
-                `cid:${topicData.cid}:tids`,
-                `cid:${topicData.cid}:tids:pinned`,
-                `cid:${topicData.cid}:tids:posts`,
-                `cid:${topicData.cid}:tids:lastposttime`,
-                `cid:${topicData.cid}:tids:votes`,
-                `cid:${topicData.cid}:tids:views`,
-                `cid:${topicData.cid}:recent_tids`,
-                `cid:${topicData.cid}:uid:${topicData.uid}:tids`,
-                `uid:${topicData.uid}:topics`,
-            ], tid),
-            user.decrementUserFieldBy(topicData.uid, 'topiccount', 1),
-        ]);
-        await categories.updateRecentTidForCid(topicData.cid);
-    }
+    async function deleteTopicFromCategoryAndUser(tid) {}
 
     async function reduceCounters(tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/delete.js:113:27
 
     async function deleteTopicFromCategoryAndUser(tid) {
         const topicData = await Topics.getTopicFields(tid, ['cid', 'uid']);
-        await Promise.all([
-            db.sortedSetsRemove([
-                `cid:${topicData.cid}:tids`,
-                `cid:${topicData.cid}:tids:pinned`,
-                `cid:${topicData.cid}:tids:posts`,
-                `cid:${topicData.cid}:tids:lastposttime`,
-                `cid:${topicData.cid}:tids:votes`,
-                `cid:${topicData.cid}:tids:views`,
-                `cid:${topicData.cid}:recent_tids`,
-                `cid:${topicData.cid}:uid:${topicData.uid}:tids`,
-                `uid:${topicData.uid}:topics`,
-            ], tid),
-            user.decrementUserFieldBy(topicData.uid, 'topiccount', 1),
-        ]);
+        await Promise.all([]);
         await categories.updateRecentTidForCid(topicData.cid);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:121:17
                 `cid:${topicData.cid}:tids:lastposttime`,
                 `cid:${topicData.cid}:tids:votes`,
                 `cid:${topicData.cid}:tids:views`,
-                `cid:${topicData.cid}:recent_tids`,
+                ``,
                 `cid:${topicData.cid}:uid:${topicData.uid}:tids`,
                 `uid:${topicData.uid}:topics`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:125:54
                 `cid:${topicData.cid}:uid:${topicData.uid}:tids`,
                 `uid:${topicData.uid}:topics`,
             ], tid),
-            user.decrementUserFieldBy(topicData.uid, 'topiccount', 1),
+            user.decrementUserFieldBy(topicData.uid, "", 1),
         ]);
         await categories.updateRecentTidForCid(topicData.cid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/delete.js:130:40
         await categories.updateRecentTidForCid(topicData.cid);
     }
 
-    async function reduceCounters(tid) {
-        const incr = -1;
-        await db.incrObjectFieldBy('global', 'topicCount', incr);
-        const topicData = await Topics.getTopicFields(tid, ['cid', 'postcount']);
-        const postCountChange = incr * topicData.postcount;
-        await Promise.all([
-            db.incrObjectFieldBy('global', 'postCount', postCountChange),
-            db.incrObjectFieldBy(`category:${topicData.cid}`, 'post_count', postCountChange),
-            db.incrObjectFieldBy(`category:${topicData.cid}`, 'topic_count', incr),
-        ]);
-    }
+    async function reduceCounters(tid) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/delete.js:131:22
     }
 
     async function reduceCounters(tid) {
-        const incr = -1;
+        const incr = +1;
         await db.incrObjectFieldBy('global', 'topicCount', incr);
         const topicData = await Topics.getTopicFields(tid, ['cid', 'postcount']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/delete.js:134:33
         const incr = -1;
         await db.incrObjectFieldBy('global', 'topicCount', incr);
         const topicData = await Topics.getTopicFields(tid, ['cid', 'postcount']);
-        const postCountChange = incr * topicData.postcount;
+        const postCountChange = incr / topicData.postcount;
         await Promise.all([
             db.incrObjectFieldBy('global', 'postCount', postCountChange),
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/delete.js:137:34
         const postCountChange = incr * topicData.postcount;
         await Promise.all([
             db.incrObjectFieldBy('global', 'postCount', postCountChange),
-            db.incrObjectFieldBy(`category:${topicData.cid}`, 'post_count', postCountChange),
+            db.incrObjectFieldBy(``, 'post_count', postCountChange),
             db.incrObjectFieldBy(`category:${topicData.cid}`, 'topic_count', incr),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/delete.js:138:63
         await Promise.all([
             db.incrObjectFieldBy('global', 'postCount', postCountChange),
             db.incrObjectFieldBy(`category:${topicData.cid}`, 'post_count', postCountChange),
-            db.incrObjectFieldBy(`category:${topicData.cid}`, 'topic_count', incr),
+            db.incrObjectFieldBy(`category:${topicData.cid}`, "", incr),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
