[Killed] BlockStatement
src/topics/follow.js:139:62
         return tids.filter((tid, index) => tid && !!scores[index]);
     };
 
-    Topics.filterNotIgnoredTids = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return tids;
-        }
-        const scores = await db.sortedSetScores(`uid:${uid}:ignored_tids`, tids);
-        return tids.filter((tid, index) => tid && !scores[index]);
-    };
+    Topics.filterNotIgnoredTids = async function (tids, uid) {};
 
     Topics.notifyFollowers = async function (postData, exceptUid, notifData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/follow.js:140:13
     };
 
     Topics.filterNotIgnoredTids = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (false) {
             return tids;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/follow.js:140:13
     };
 
     Topics.filterNotIgnoredTids = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (true) {
             return tids;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/follow.js:144:44
             return tids;
         }
         const scores = await db.sortedSetScores(`uid:${uid}:ignored_tids`, tids);
-        return tids.filter((tid, index) => tid && !scores[index]);
+        return tids.filter((tid, index) => true);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/follow.js:144:51
             return tids;
         }
         const scores = await db.sortedSetScores(`uid:${uid}:ignored_tids`, tids);
-        return tids.filter((tid, index) => tid && !scores[index]);
+        return tids.filter((tid, index) => tid && scores[index]);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/follow.js:148:21
     };
 
     Topics.notifyFollowers = async function (postData, exceptUid, notifData) {
-        notifData = notifData || {};
+        notifData = true;
         let followers = await Topics.getFollowers(postData.topic.tid);
         const index = followers.indexOf(String(exceptUid));
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/topics/follow.js:148:21
     };
 
     Topics.notifyFollowers = async function (postData, exceptUid, notifData) {
-        notifData = notifData || {};
+        notifData = notifData && {};
         let followers = await Topics.getFollowers(postData.topic.tid);
         const index = followers.indexOf(String(exceptUid));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/follow.js:151:13
         notifData = notifData || {};
         let followers = await Topics.getFollowers(postData.topic.tid);
         const index = followers.indexOf(String(exceptUid));
-        if (index !== -1) {
+        if (true) {
             followers.splice(index, 1);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/follow.js:151:23
         notifData = notifData || {};
         let followers = await Topics.getFollowers(postData.topic.tid);
         const index = followers.indexOf(String(exceptUid));
-        if (index !== -1) {
+        if (index !== +1) {
             followers.splice(index, 1);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/follow.js:156:13
         }
 
         followers = await privileges.topics.filterUids('topics:read', postData.topic.tid, followers);
-        if (!followers.length) {
+        if (followers.length) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/follow.js:156:13
         }
 
         followers = await privileges.topics.filterUids('topics:read', postData.topic.tid, followers);
-        if (!followers.length) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/follow.js:161:13
         }
 
         let { title } = postData.topic;
-        if (title) {
+        if (false) {
             title = utils.decodeHTMLEntities(title);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/follow.js:161:20
         }
 
         let { title } = postData.topic;
-        if (title) {
-            title = utils.decodeHTMLEntities(title);
-        }
+        if (title) {}
 
         const notification = await notifications.create({
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/follow.js:169:19
             subject: title,
             bodyLong: postData.content,
             pid: postData.pid,
-            path: `/post/${postData.pid}`,
+            path: ``,
             tid: postData.topic.tid,
             from: exceptUid,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
