[Killed] ConditionalExpression
src/topics/merge.js:8:19
 
 module.exports = function (Topics) {
     Topics.merge = async function (tids, uid, options) {
-        options = options || {};
+        options = true;
 
         const topicsData = await Topics.getTopicsFields(tids, ['scheduled']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/merge.js:8:19
 
 module.exports = function (Topics) {
     Topics.merge = async function (tids, uid, options) {
-        options = options || {};
+        options = false;
 
         const topicsData = await Topics.getTopicsFields(tids, ['scheduled']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/merge.js:11:13
         options = options || {};
 
         const topicsData = await Topics.getTopicsFields(tids, ['scheduled']);
-        if (topicsData.some(t => t.scheduled)) {
+        if (topicsData.every(t => t.scheduled)) {
             throw new Error('[[error:cant-merge-scheduled]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/merge.js:11:13
         options = options || {};
 
         const topicsData = await Topics.getTopicsFields(tids, ['scheduled']);
-        if (topicsData.some(t => t.scheduled)) {
+        if (false) {
             throw new Error('[[error:cant-merge-scheduled]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/topics/merge.js:12:29
 
         const topicsData = await Topics.getTopicsFields(tids, ['scheduled']);
         if (topicsData.some(t => t.scheduled)) {
-            throw new Error('[[error:cant-merge-scheduled]]');
+            throw new Error("");
         }
 

[Killed] BlockStatement
src/topics/merge.js:17:30
 
         const oldestTid = findOldestTopic(tids);
         let mergeIntoTid = oldestTid;
-        if (options.mainTid) {
-            mergeIntoTid = options.mainTid;
-        } else if (options.newTopicTitle) {
+        if (options.mainTid) {} else if (options.newTopicTitle) {
             mergeIntoTid = await createNewTopic(options.newTopicTitle, oldestTid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/merge.js:17:13
 
         const oldestTid = findOldestTopic(tids);
         let mergeIntoTid = oldestTid;
-        if (options.mainTid) {
+        if (true) {
             mergeIntoTid = options.mainTid;
         } else if (options.newTopicTitle) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/merge.js:19:43
         let mergeIntoTid = oldestTid;
         if (options.mainTid) {
             mergeIntoTid = options.mainTid;
-        } else if (options.newTopicTitle) {
-            mergeIntoTid = await createNewTopic(options.newTopicTitle, oldestTid);
-        }
+        } else if (options.newTopicTitle) {}
 
         const otherTids = tids.sort((a, b) => a - b)
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/merge.js:19:20
         let mergeIntoTid = oldestTid;
         if (options.mainTid) {
             mergeIntoTid = options.mainTid;
-        } else if (options.newTopicTitle) {
+        } else if (false) {
             mergeIntoTid = await createNewTopic(options.newTopicTitle, oldestTid);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/merge.js:23:37
             mergeIntoTid = await createNewTopic(options.newTopicTitle, oldestTid);
         }
 
-        const otherTids = tids.sort((a, b) => a - b)
+        const otherTids = tids.sort(() => undefined)
             .filter(tid => tid && parseInt(tid, 10) !== parseInt(mergeIntoTid, 10));
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/merge.js:23:27
             mergeIntoTid = await createNewTopic(options.newTopicTitle, oldestTid);
         }
 
-        const otherTids = tids.sort((a, b) => a - b)
-            .filter(tid => tid && parseInt(tid, 10) !== parseInt(mergeIntoTid, 10));
+        const otherTids = tids.sort((a, b) => a - b);
 
         for (const tid of otherTids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/merge.js:24:28
         }
 
         const otherTids = tids.sort((a, b) => a - b)
-            .filter(tid => tid && parseInt(tid, 10) !== parseInt(mergeIntoTid, 10));
+            .filter(tid => tid || parseInt(tid, 10) !== parseInt(mergeIntoTid, 10));
 
         for (const tid of otherTids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/merge.js:24:35
         }
 
         const otherTids = tids.sort((a, b) => a - b)
-            .filter(tid => tid && parseInt(tid, 10) !== parseInt(mergeIntoTid, 10));
+            .filter(tid => tid && true);
 
         for (const tid of otherTids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/merge.js:26:38
         const otherTids = tids.sort((a, b) => a - b)
             .filter(tid => tid && parseInt(tid, 10) !== parseInt(mergeIntoTid, 10));
 
-        for (const tid of otherTids) {
-            /* eslint-disable no-await-in-loop */
-            const pids = await Topics.getPids(tid);
-            for (const pid of pids) {
-                await Topics.movePostToTopic(uid, pid, mergeIntoTid);
-            }
-
-            await Topics.setTopicField(tid, 'mainPid', 0);
-            await Topics.delete(tid, uid);
-            await Topics.setTopicFields(tid, {
-                mergeIntoTid: mergeIntoTid,
-                mergerUid: uid,
-                mergedTimestamp: Date.now(),
-            });
-        }
+        for (const tid of otherTids) {}
 
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/merge.js:29:37
         for (const tid of otherTids) {
             /* eslint-disable no-await-in-loop */
             const pids = await Topics.getPids(tid);
-            for (const pid of pids) {
-                await Topics.movePostToTopic(uid, pid, mergeIntoTid);
-            }
+            for (const pid of pids) {}
 
             await Topics.setTopicField(tid, 'mainPid', 0);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/merge.js:35:46
 
             await Topics.setTopicField(tid, 'mainPid', 0);
             await Topics.delete(tid, uid);
-            await Topics.setTopicFields(tid, {
-                mergeIntoTid: mergeIntoTid,
-                mergerUid: uid,
-                mergedTimestamp: Date.now(),
-            });
+            await Topics.setTopicFields(tid, {});
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/merge.js:47:50
             updateViewCount(mergeIntoTid, tids),
         ]);
 
-        plugins.hooks.fire('action:topic.merge', {
-            uid: uid,
-            tids: tids,
-            mergeIntoTid: mergeIntoTid,
-            otherTids: otherTids,
-        });
+        plugins.hooks.fire('action:topic.merge', {});
         return mergeIntoTid;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/merge.js:56:53
         return mergeIntoTid;
     };
 
-    async function createNewTopic(title, oldestTid) {
-        const topicData = await Topics.getTopicFields(oldestTid, ['uid', 'cid']);
-        const params = {
-            uid: topicData.uid,
-            cid: topicData.cid,
-            title: title,
-        };
-        const result = await plugins.hooks.fire('filter:topic.mergeCreateNewTopic', {
-            oldestTid: oldestTid,
-            params: params,
-        });
-        const tid = await Topics.create(result.params);
-        return tid;
-    }
+    async function createNewTopic(title, oldestTid) {}
 
     async function updateViewCount(mergeIntoTid, tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/merge.js:63:85
             cid: topicData.cid,
             title: title,
         };
-        const result = await plugins.hooks.fire('filter:topic.mergeCreateNewTopic', {
-            oldestTid: oldestTid,
-            params: params,
-        });
+        const result = await plugins.hooks.fire('filter:topic.mergeCreateNewTopic', {});
         const tid = await Topics.create(result.params);
         return tid;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/merge.js:71:56
         return tid;
     }
 
-    async function updateViewCount(mergeIntoTid, tids) {
-        const topicData = await Topics.getTopicsFields(tids, ['viewcount']);
-        const totalViewCount = topicData.reduce(
-            (count, topic) => count + parseInt(topic.viewcount, 10), 0
-        );
-        await Topics.setTopicField(mergeIntoTid, 'viewcount', totalViewCount);
-    }
+    async function updateViewCount(mergeIntoTid, tids) {}
 
     function findOldestTopic(tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/merge.js:72:62
     }
 
     async function updateViewCount(mergeIntoTid, tids) {
-        const topicData = await Topics.getTopicsFields(tids, ['viewcount']);
+        const topicData = await Topics.getTopicsFields(tids, []);
         const totalViewCount = topicData.reduce(
             (count, topic) => count + parseInt(topic.viewcount, 10), 0
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/merge.js:74:31
     async function updateViewCount(mergeIntoTid, tids) {
         const topicData = await Topics.getTopicsFields(tids, ['viewcount']);
         const totalViewCount = topicData.reduce(
-            (count, topic) => count + parseInt(topic.viewcount, 10), 0
+            (count, topic) => count - parseInt(topic.viewcount, 10), 0
         );
         await Topics.setTopicField(mergeIntoTid, 'viewcount', totalViewCount);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/merge.js:74:13
     async function updateViewCount(mergeIntoTid, tids) {
         const topicData = await Topics.getTopicsFields(tids, ['viewcount']);
         const totalViewCount = topicData.reduce(
-            (count, topic) => count + parseInt(topic.viewcount, 10), 0
+            () => undefined, 0
         );
         await Topics.setTopicField(mergeIntoTid, 'viewcount', totalViewCount);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/merge.js:79:36
         await Topics.setTopicField(mergeIntoTid, 'viewcount', totalViewCount);
     }
 
-    function findOldestTopic(tids) {
-        return Math.min.apply(null, tids);
-    }
+    function findOldestTopic(tids) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
