[Killed] ConditionalExpression
src/topics/fork.js:13:13
 
 module.exports = function (Topics) {
     Topics.createTopicFromPosts = async function (uid, title, pids, fromTid) {
-        if (title) {
+        if (true) {
             title = title.trim();
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:13:13
 
 module.exports = function (Topics) {
     Topics.createTopicFromPosts = async function (uid, title, pids, fromTid) {
-        if (title) {
+        if (false) {
             title = title.trim();
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/fork.js:14:21
 module.exports = function (Topics) {
     Topics.createTopicFromPosts = async function (uid, title, pids, fromTid) {
         if (title) {
-            title = title.trim();
+            title = title;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/fork.js:17:13
             title = title.trim();
         }
 
-        if (title.length < meta.config.minimumTitleLength) {
+        if (title.length >= meta.config.minimumTitleLength) {
             throw new Error(`[[error:title-too-short, ${meta.config.minimumTitleLength}]]`);
         } else if (title.length > meta.config.maximumTitleLength) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:17:13
             title = title.trim();
         }
 
-        if (title.length < meta.config.minimumTitleLength) {
+        if (true) {
             throw new Error(`[[error:title-too-short, ${meta.config.minimumTitleLength}]]`);
         } else if (title.length > meta.config.maximumTitleLength) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/fork.js:19:20
 
         if (title.length < meta.config.minimumTitleLength) {
             throw new Error(`[[error:title-too-short, ${meta.config.minimumTitleLength}]]`);
-        } else if (title.length > meta.config.maximumTitleLength) {
+        } else if (title.length >= meta.config.maximumTitleLength) {
             throw new Error(`[[error:title-too-long, ${meta.config.maximumTitleLength}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:19:20
 
         if (title.length < meta.config.minimumTitleLength) {
             throw new Error(`[[error:title-too-short, ${meta.config.minimumTitleLength}]]`);
-        } else if (title.length > meta.config.maximumTitleLength) {
+        } else if (true) {
             throw new Error(`[[error:title-too-long, ${meta.config.maximumTitleLength}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/fork.js:23:13
             throw new Error(`[[error:title-too-long, ${meta.config.maximumTitleLength}]]`);
         }
 
-        if (!pids || !pids.length) {
+        if (false) {
             throw new Error('[[error:invalid-pid]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/fork.js:23:13
             throw new Error(`[[error:title-too-long, ${meta.config.maximumTitleLength}]]`);
         }
 
-        if (!pids || !pids.length) {
+        if (true) {
             throw new Error('[[error:invalid-pid]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/fork.js:27:19
             throw new Error('[[error:invalid-pid]]');
         }
 
-        pids.sort((a, b) => a - b);
+        pids.sort(() => undefined);
 
         const mainPid = pids[0];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/fork.js:27:29
             throw new Error('[[error:invalid-pid]]');
         }
 
-        pids.sort((a, b) => a - b);
+        pids.sort((a, b) => a + b);
 
         const mainPid = pids[0];
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrayDeclaration
src/topics/fork.js:32:60
         const mainPid = pids[0];
         const cid = await posts.getCidByPid(mainPid);
 
-        const [postData, isAdminOrMod] = await Promise.all([
-            posts.getPostData(mainPid),
-            privileges.categories.isAdminOrMod(cid, uid),
-        ]);
+        const [postData, isAdminOrMod] = await Promise.all([]);
 
         if (!isAdminOrMod) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:37:13
             privileges.categories.isAdminOrMod(cid, uid),
         ]);
 
-        if (!isAdminOrMod) {
+        if (false) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/fork.js:37:13
             privileges.categories.isAdminOrMod(cid, uid),
         ]);
 
-        if (!isAdminOrMod) {
+        if (true) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:41:27
             throw new Error('[[error:no-privileges]]');
         }
 
-        const scheduled = postData.timestamp > Date.now();
+        const scheduled = false;
         const params = {
             uid: postData.uid,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/fork.js:41:27
             throw new Error('[[error:no-privileges]]');
         }
 
-        const scheduled = postData.timestamp > Date.now();
+        const scheduled = postData.timestamp >= Date.now();
         const params = {
             uid: postData.uid,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:46:24
             uid: postData.uid,
             title: title,
             cid: cid,
-            timestamp: scheduled && postData.timestamp,
+            timestamp: false,
         };
         const result = await plugins.hooks.fire('filter:topic.fork', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:46:24
             uid: postData.uid,
             title: title,
             cid: cid,
-            timestamp: scheduled && postData.timestamp,
+            timestamp: true,
         };
         const result = await plugins.hooks.fire('filter:topic.fork', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/fork.js:56:33
         const tid = await Topics.create(result.params);
         await Topics.updateTopicBookmarks(fromTid, pids);
 
-        for (const pid of pids) {
-            /* eslint-disable no-await-in-loop */
-            const canEdit = await privileges.posts.canEdit(pid, uid);
-            if (!canEdit.flag) {
-                throw new Error(canEdit.message);
-            }
-            await Topics.movePostToTopic(uid, pid, tid, scheduled);
-        }
+        for (const pid of pids) {}
 
         await Topics.updateLastPostTime(tid, scheduled ? (postData.timestamp + 1) : Date.now());
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/fork.js:59:17
         for (const pid of pids) {
             /* eslint-disable no-await-in-loop */
             const canEdit = await privileges.posts.canEdit(pid, uid);
-            if (!canEdit.flag) {
+            if (canEdit.flag) {
                 throw new Error(canEdit.message);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:59:17
         for (const pid of pids) {
             /* eslint-disable no-await-in-loop */
             const canEdit = await privileges.posts.canEdit(pid, uid);
-            if (!canEdit.flag) {
+            if (false) {
                 throw new Error(canEdit.message);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArithmeticOperator
src/topics/fork.js:65:59
             await Topics.movePostToTopic(uid, pid, tid, scheduled);
         }
 
-        await Topics.updateLastPostTime(tid, scheduled ? (postData.timestamp + 1) : Date.now());
+        await Topics.updateLastPostTime(tid, scheduled ? (postData.timestamp - 1) : Date.now());
 
         await Promise.all([

[Killed] ObjectLiteral
src/topics/fork.js:68:40
         await Topics.updateLastPostTime(tid, scheduled ? (postData.timestamp + 1) : Date.now());
 
         await Promise.all([
-            Topics.setTopicFields(tid, {
-                upvotes: postData.upvotes,
-                downvotes: postData.downvotes,
-            }),
+            Topics.setTopicFields(tid, {}),
             db.sortedSetsAdd(['topics:votes', `cid:${cid}:tids:votes`], postData.votes, tid),
             Topics.events.log(fromTid, { type: 'fork', uid, href: `/topic/${tid}`, timestamp: postData.timestamp }),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/fork.js:72:31
                 upvotes: postData.upvotes,
                 downvotes: postData.downvotes,
             }),
-            db.sortedSetsAdd(['topics:votes', `cid:${cid}:tids:votes`], postData.votes, tid),
+            db.sortedSetsAdd(["", `cid:${cid}:tids:votes`], postData.votes, tid),
             Topics.events.log(fromTid, { type: 'fork', uid, href: `/topic/${tid}`, timestamp: postData.timestamp }),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ObjectLiteral
src/topics/fork.js:73:40
                 downvotes: postData.downvotes,
             }),
             db.sortedSetsAdd(['topics:votes', `cid:${cid}:tids:votes`], postData.votes, tid),
-            Topics.events.log(fromTid, { type: 'fork', uid, href: `/topic/${tid}`, timestamp: postData.timestamp }),
+            Topics.events.log(fromTid, {}),
         ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/fork.js:73:67
                 downvotes: postData.downvotes,
             }),
             db.sortedSetsAdd(['topics:votes', `cid:${cid}:tids:votes`], postData.votes, tid),
-            Topics.events.log(fromTid, { type: 'fork', uid, href: `/topic/${tid}`, timestamp: postData.timestamp }),
+            Topics.events.log(fromTid, { type: 'fork', uid, href: ``, timestamp: postData.timestamp }),
         ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/fork.js:81:84
         return await Topics.getTopicData(tid);
     };
 
-    Topics.movePostToTopic = async function (callerUid, pid, tid, forceScheduled = false) {
+    Topics.movePostToTopic = async function (callerUid, pid, tid, forceScheduled = true) {
         tid = parseInt(tid, 10);
         const topicData = await Topics.getTopicFields(tid, ['tid', 'scheduled']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/fork.js:83:68
 
     Topics.movePostToTopic = async function (callerUid, pid, tid, forceScheduled = false) {
         tid = parseInt(tid, 10);
-        const topicData = await Topics.getTopicFields(tid, ['tid', 'scheduled']);
+        const topicData = await Topics.getTopicFields(tid, ['tid', ""]);
         if (!topicData.tid) {
             throw new Error('[[error:no-topic]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:84:13
     Topics.movePostToTopic = async function (callerUid, pid, tid, forceScheduled = false) {
         tid = parseInt(tid, 10);
         const topicData = await Topics.getTopicFields(tid, ['tid', 'scheduled']);
-        if (!topicData.tid) {
+        if (false) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:84:13
     Topics.movePostToTopic = async function (callerUid, pid, tid, forceScheduled = false) {
         tid = parseInt(tid, 10);
         const topicData = await Topics.getTopicFields(tid, ['tid', 'scheduled']);
-        if (!topicData.tid) {
+        if (true) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/fork.js:87:13
         if (!topicData.tid) {
             throw new Error('[[error:no-topic]]');
         }
-        if (!forceScheduled && topicData.scheduled) {
+        if (!forceScheduled || topicData.scheduled) {
             throw new Error('[[error:cant-move-posts-to-scheduled]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:87:13
         if (!topicData.tid) {
             throw new Error('[[error:no-topic]]');
         }
-        if (!forceScheduled && topicData.scheduled) {
+        if (false) {
             throw new Error('[[error:cant-move-posts-to-scheduled]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/fork.js:90:57
         if (!forceScheduled && topicData.scheduled) {
             throw new Error('[[error:cant-move-posts-to-scheduled]]');
         }
-        const postData = await posts.getPostFields(pid, ['tid', 'uid', 'timestamp', 'upvotes', 'downvotes']);
+        const postData = await posts.getPostFields(pid, []);
         if (!postData || !postData.tid) {
             throw new Error('[[error:no-post]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/fork.js:91:13
             throw new Error('[[error:cant-move-posts-to-scheduled]]');
         }
         const postData = await posts.getPostFields(pid, ['tid', 'uid', 'timestamp', 'upvotes', 'downvotes']);
-        if (!postData || !postData.tid) {
+        if (postData || !postData.tid) {
             throw new Error('[[error:no-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/fork.js:91:26
             throw new Error('[[error:cant-move-posts-to-scheduled]]');
         }
         const postData = await posts.getPostFields(pid, ['tid', 'uid', 'timestamp', 'upvotes', 'downvotes']);
-        if (!postData || !postData.tid) {
+        if (!postData || postData.tid) {
             throw new Error('[[error:no-post]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/topics/fork.js:92:29
         }
         const postData = await posts.getPostFields(pid, ['tid', 'uid', 'timestamp', 'upvotes', 'downvotes']);
         if (!postData || !postData.tid) {
-            throw new Error('[[error:no-post]]');
+            throw new Error("");
         }
 

[Killed] ConditionalExpression
src/topics/fork.js:96:13
         }
 
         const isSourceTopicScheduled = await Topics.getTopicField(postData.tid, 'scheduled');
-        if (!forceScheduled && isSourceTopicScheduled) {
+        if (false) {
             throw new Error('[[error:cant-move-from-scheduled-to-existing]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/fork.js:96:13
         }
 
         const isSourceTopicScheduled = await Topics.getTopicField(postData.tid, 'scheduled');
-        if (!forceScheduled && isSourceTopicScheduled) {
+        if (!forceScheduled || isSourceTopicScheduled) {
             throw new Error('[[error:cant-move-from-scheduled-to-existing]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:100:13
             throw new Error('[[error:cant-move-from-scheduled-to-existing]]');
         }
 
-        if (postData.tid === tid) {
+        if (false) {
             throw new Error('[[error:cant-move-to-same-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/fork.js:100:13
             throw new Error('[[error:cant-move-from-scheduled-to-existing]]');
         }
 
-        if (postData.tid === tid) {
+        if (postData.tid !== tid) {
             throw new Error('[[error:cant-move-to-same-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/fork.js:113:27
             Topics.addPostToTopic(tid, postData),
         ]);
 
-        await Promise.all([
-            Topics.updateLastPostTimeFromLastPid(tid),
-            Topics.updateLastPostTimeFromLastPid(postData.tid),
-        ]);
+        await Promise.all([]);
         plugins.hooks.fire('action:post.move', { uid: callerUid, post: postData, tid: tid });
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/fork.js:117:48
             Topics.updateLastPostTimeFromLastPid(tid),
             Topics.updateLastPostTimeFromLastPid(postData.tid),
         ]);
-        plugins.hooks.fire('action:post.move', { uid: callerUid, post: postData, tid: tid });
+        plugins.hooks.fire('action:post.move', {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/fork.js:121:56
     };
 
     async function updateCategory(postData, toTid) {
-        const topicData = await Topics.getTopicsFields([postData.tid, toTid], ['cid', 'pinned']);
+        const topicData = await Topics.getTopicsFields([], ['cid', 'pinned']);
 
         if (!topicData[0].cid || !topicData[1].cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/fork.js:121:79
     };
 
     async function updateCategory(postData, toTid) {
-        const topicData = await Topics.getTopicsFields([postData.tid, toTid], ['cid', 'pinned']);
+        const topicData = await Topics.getTopicsFields([postData.tid, toTid], []);
 
         if (!topicData[0].cid || !topicData[1].cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/fork.js:123:13
     async function updateCategory(postData, toTid) {
         const topicData = await Topics.getTopicsFields([postData.tid, toTid], ['cid', 'pinned']);
 
-        if (!topicData[0].cid || !topicData[1].cid) {
+        if (topicData[0].cid || !topicData[1].cid) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:123:13
     async function updateCategory(postData, toTid) {
         const topicData = await Topics.getTopicsFields([postData.tid, toTid], ['cid', 'pinned']);
 
-        if (!topicData[0].cid || !topicData[1].cid) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:127:13
             return;
         }
 
-        if (!topicData[0].pinned) {
+        if (true) {
             await db.sortedSetIncrBy(`cid:${topicData[0].cid}:tids:posts`, -1, postData.tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:127:13
             return;
         }
 
-        if (!topicData[0].pinned) {
+        if (false) {
             await db.sortedSetIncrBy(`cid:${topicData[0].cid}:tids:posts`, -1, postData.tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/fork.js:128:76
         }
 
         if (!topicData[0].pinned) {
-            await db.sortedSetIncrBy(`cid:${topicData[0].cid}:tids:posts`, -1, postData.tid);
+            await db.sortedSetIncrBy(`cid:${topicData[0].cid}:tids:posts`, +1, postData.tid);
         }
         if (!topicData[1].pinned) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/fork.js:130:13
         if (!topicData[0].pinned) {
             await db.sortedSetIncrBy(`cid:${topicData[0].cid}:tids:posts`, -1, postData.tid);
         }
-        if (!topicData[1].pinned) {
+        if (true) {
             await db.sortedSetIncrBy(`cid:${topicData[1].cid}:tids:posts`, 1, toTid);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/fork.js:130:13
         if (!topicData[0].pinned) {
             await db.sortedSetIncrBy(`cid:${topicData[0].cid}:tids:posts`, -1, postData.tid);
         }
-        if (!topicData[1].pinned) {
+        if (false) {
             await db.sortedSetIncrBy(`cid:${topicData[1].cid}:tids:posts`, 1, toTid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/fork.js:131:38
             await db.sortedSetIncrBy(`cid:${topicData[0].cid}:tids:posts`, -1, postData.tid);
         }
         if (!topicData[1].pinned) {
-            await db.sortedSetIncrBy(`cid:${topicData[1].cid}:tids:posts`, 1, toTid);
+            await db.sortedSetIncrBy(``, 1, toTid);
         }
         if (topicData[0].cid === topicData[1].cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/fork.js:133:13
         if (!topicData[1].pinned) {
             await db.sortedSetIncrBy(`cid:${topicData[1].cid}:tids:posts`, 1, toTid);
         }
-        if (topicData[0].cid === topicData[1].cid) {
+        if (topicData[0].cid !== topicData[1].cid) {
             await categories.updateRecentTidForCid(topicData[0].cid);
             return;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/fork.js:133:52
         if (!topicData[1].pinned) {
             await db.sortedSetIncrBy(`cid:${topicData[1].cid}:tids:posts`, 1, toTid);
         }
-        if (topicData[0].cid === topicData[1].cid) {
-            await categories.updateRecentTidForCid(topicData[0].cid);
-            return;
-        }
+        if (topicData[0].cid === topicData[1].cid) {}
         const removeFrom = [
             `cid:${topicData[0].cid}:pids`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/fork.js:140:13
         const removeFrom = [
             `cid:${topicData[0].cid}:pids`,
             `cid:${topicData[0].cid}:uid:${postData.uid}:pids`,
-            `cid:${topicData[0].cid}:uid:${postData.uid}:pids:votes`,
+            ``,
         ];
         const tasks = [
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrayDeclaration
src/topics/fork.js:142:23
             `cid:${topicData[0].cid}:uid:${postData.uid}:pids`,
             `cid:${topicData[0].cid}:uid:${postData.uid}:pids:votes`,
         ];
-        const tasks = [
-            db.incrObjectFieldBy(`category:${topicData[0].cid}`, 'post_count', -1),
-            db.incrObjectFieldBy(`category:${topicData[1].cid}`, 'post_count', 1),
-            db.sortedSetRemove(removeFrom, postData.pid),
-            db.sortedSetAdd(`cid:${topicData[1].cid}:pids`, postData.timestamp, postData.pid),
-            db.sortedSetAdd(`cid:${topicData[1].cid}:uid:${postData.uid}:pids`, postData.timestamp, postData.pid),
-        ];
+        const tasks = [];
         if (postData.votes > 0 || postData.votes < 0) {
             tasks.push(db.sortedSetAdd(`cid:${topicData[1].cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/fork.js:143:80
             `cid:${topicData[0].cid}:uid:${postData.uid}:pids:votes`,
         ];
         const tasks = [
-            db.incrObjectFieldBy(`category:${topicData[0].cid}`, 'post_count', -1),
+            db.incrObjectFieldBy(`category:${topicData[0].cid}`, 'post_count', +1),
             db.incrObjectFieldBy(`category:${topicData[1].cid}`, 'post_count', 1),
             db.sortedSetRemove(removeFrom, postData.pid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/fork.js:143:66
             `cid:${topicData[0].cid}:uid:${postData.uid}:pids:votes`,
         ];
         const tasks = [
-            db.incrObjectFieldBy(`category:${topicData[0].cid}`, 'post_count', -1),
+            db.incrObjectFieldBy(`category:${topicData[0].cid}`, "", -1),
             db.incrObjectFieldBy(`category:${topicData[1].cid}`, 'post_count', 1),
             db.sortedSetRemove(removeFrom, postData.pid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/fork.js:149:13
             db.sortedSetAdd(`cid:${topicData[1].cid}:pids`, postData.timestamp, postData.pid),
             db.sortedSetAdd(`cid:${topicData[1].cid}:uid:${postData.uid}:pids`, postData.timestamp, postData.pid),
         ];
-        if (postData.votes > 0 || postData.votes < 0) {
+        if (postData.votes <= 0 || postData.votes < 0) {
             tasks.push(db.sortedSetAdd(`cid:${topicData[1].cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid));
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/fork.js:149:13
             db.sortedSetAdd(`cid:${topicData[1].cid}:pids`, postData.timestamp, postData.pid),
             db.sortedSetAdd(`cid:${topicData[1].cid}:uid:${postData.uid}:pids`, postData.timestamp, postData.pid),
         ];
-        if (postData.votes > 0 || postData.votes < 0) {
+        if (postData.votes > 0 && postData.votes < 0) {
             tasks.push(db.sortedSetAdd(`cid:${topicData[1].cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid));
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
