[Killed] BlockStatement
src/topics/index.js:38:39
 require('./merge')(Topics);
 Topics.events = require('./events');
 
-Topics.exists = async function (tids) {
-    return await db.exists(
-        Array.isArray(tids) ? tids.map(tid => `topic:${tid}`) : `topic:${tids}`
-    );
-};
+Topics.exists = async function (tids) {};
 
 Topics.getTopicsFromSet = async function (set, uid, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/index.js:40:40
 
 Topics.exists = async function (tids) {
     return await db.exists(
-        Array.isArray(tids) ? tids.map(tid => `topic:${tid}`) : `topic:${tids}`
+        Array.isArray(tids) ? tids.map(() => undefined) : `topic:${tids}`
     );
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/index.js:44:66
     );
 };
 
-Topics.getTopicsFromSet = async function (set, uid, start, stop) {
-    const tids = await db.getSortedSetRevRange(set, start, stop);
-    const topics = await Topics.getTopics(tids, uid);
-    Topics.calculateTopicIndices(topics, start);
-    return { topics: topics, nextStart: stop + 1 };
-};
+Topics.getTopicsFromSet = async function (set, uid, start, stop) {};
 
 Topics.getTopics = async function (tids, options) {

[NoCoverage] ArithmeticOperator
src/topics/index.js:48:41
     const tids = await db.getSortedSetRevRange(set, start, stop);
     const topics = await Topics.getTopics(tids, uid);
     Topics.calculateTopicIndices(topics, start);
-    return { topics: topics, nextStart: stop + 1 };
+    return { topics: topics, nextStart: stop - 1 };
 };
 

[NoCoverage] ObjectLiteral
src/topics/index.js:48:12
     const tids = await db.getSortedSetRevRange(set, start, stop);
     const topics = await Topics.getTopics(tids, uid);
     Topics.calculateTopicIndices(topics, start);
-    return { topics: topics, nextStart: stop + 1 };
+    return {};
 };
 

[Killed] BlockStatement
src/topics/index.js:51:51
     return { topics: topics, nextStart: stop + 1 };
 };
 
-Topics.getTopics = async function (tids, options) {
-    let uid = options;
-    if (typeof options === 'object') {
-        uid = options.uid;
-    }
-
-    tids = await privileges.topics.filterTids('topics:read', tids, uid);
-    return await Topics.getTopicsByTids(tids, options);
-};
+Topics.getTopics = async function (tids, options) {};
 
 Topics.getTopicsByTids = async function (tids, options) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/index.js:53:9
 
 Topics.getTopics = async function (tids, options) {
     let uid = options;
-    if (typeof options === 'object') {
+    if (typeof options !== 'object') {
         uid = options.uid;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:53:9
 
 Topics.getTopics = async function (tids, options) {
     let uid = options;
-    if (typeof options === 'object') {
+    if (true) {
         uid = options.uid;
     }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/index.js:62:9
 };
 
 Topics.getTopicsByTids = async function (tids, options) {
-    if (!Array.isArray(tids) || !tids.length) {
+    if (true) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/index.js:62:9
 };
 
 Topics.getTopicsByTids = async function (tids, options) {
-    if (!Array.isArray(tids) || !tids.length) {
+    if (!Array.isArray(tids) && !tids.length) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:66:38
         return [];
     }
     let uid = options;
-    if (typeof options === 'object') {
-        uid = options.uid;
-    }
+    if (typeof options === 'object') {}
 
     async function loadTopics() {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:66:9
         return [];
     }
     let uid = options;
-    if (typeof options === 'object') {
+    if (false) {
         uid = options.uid;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:72:45
 
     async function loadTopics() {
         const topics = await Topics.getTopicsData(tids);
-        const uids = _.uniq(topics.map(t => t && t.uid && t.uid.toString()).filter(v => utils.isNumber(v)));
+        const uids = _.uniq(topics.map(t => true).filter(v => utils.isNumber(v)));
         const cids = _.uniq(topics.map(t => t && t.cid && t.cid.toString()).filter(v => utils.isNumber(v)));
         const guestTopics = topics.filter(t => t && t.uid === 0);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:72:45
 
     async function loadTopics() {
         const topics = await Topics.getTopicsData(tids);
-        const uids = _.uniq(topics.map(t => t && t.uid && t.uid.toString()).filter(v => utils.isNumber(v)));
+        const uids = _.uniq(topics.map(t => true && t.uid.toString()).filter(v => utils.isNumber(v)));
         const cids = _.uniq(topics.map(t => t && t.cid && t.cid.toString()).filter(v => utils.isNumber(v)));
         const guestTopics = topics.filter(t => t && t.uid === 0);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:73:45
     async function loadTopics() {
         const topics = await Topics.getTopicsData(tids);
         const uids = _.uniq(topics.map(t => t && t.uid && t.uid.toString()).filter(v => utils.isNumber(v)));
-        const cids = _.uniq(topics.map(t => t && t.cid && t.cid.toString()).filter(v => utils.isNumber(v)));
+        const cids = _.uniq(topics.map(t => true).filter(v => utils.isNumber(v)));
         const guestTopics = topics.filter(t => t && t.uid === 0);
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/index.js:73:45
     async function loadTopics() {
         const topics = await Topics.getTopicsData(tids);
         const uids = _.uniq(topics.map(t => t && t.uid && t.uid.toString()).filter(v => utils.isNumber(v)));
-        const cids = _.uniq(topics.map(t => t && t.cid && t.cid.toString()).filter(v => utils.isNumber(v)));
+        const cids = _.uniq(topics.map(t => true && t.cid.toString()).filter(v => utils.isNumber(v)));
         const guestTopics = topics.filter(t => t && t.uid === 0);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/index.js:74:53
         const topics = await Topics.getTopicsData(tids);
         const uids = _.uniq(topics.map(t => t && t.uid && t.uid.toString()).filter(v => utils.isNumber(v)));
         const cids = _.uniq(topics.map(t => t && t.cid && t.cid.toString()).filter(v => utils.isNumber(v)));
-        const guestTopics = topics.filter(t => t && t.uid === 0);
+        const guestTopics = topics.filter(t => t && t.uid !== 0);
 
         async function loadGuestHandles() {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:74:48
         const topics = await Topics.getTopicsData(tids);
         const uids = _.uniq(topics.map(t => t && t.uid && t.uid.toString()).filter(v => utils.isNumber(v)));
         const cids = _.uniq(topics.map(t => t && t.cid && t.cid.toString()).filter(v => utils.isNumber(v)));
-        const guestTopics = topics.filter(t => t && t.uid === 0);
+        const guestTopics = topics.filter(t => false);
 
         async function loadGuestHandles() {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:76:43
         const cids = _.uniq(topics.map(t => t && t.cid && t.cid.toString()).filter(v => utils.isNumber(v)));
         const guestTopics = topics.filter(t => t && t.uid === 0);
 
-        async function loadGuestHandles() {
-            const mainPids = guestTopics.map(t => t.mainPid);
-            const postData = await posts.getPostsFields(mainPids, ['handle']);
-            return postData.map(p => p.handle);
-        }
+        async function loadGuestHandles() {}
 
         async function loadShowfullnameSettings() {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/index.js:77:46
         const guestTopics = topics.filter(t => t && t.uid === 0);
 
         async function loadGuestHandles() {
-            const mainPids = guestTopics.map(t => t.mainPid);
+            const mainPids = guestTopics.map(() => undefined);
             const postData = await posts.getPostsFields(mainPids, ['handle']);
             return postData.map(p => p.handle);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/index.js:79:33
         async function loadGuestHandles() {
             const mainPids = guestTopics.map(t => t.mainPid);
             const postData = await posts.getPostsFields(mainPids, ['handle']);
-            return postData.map(p => p.handle);
+            return postData.map(() => undefined);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:82:51
             return postData.map(p => p.handle);
         }
 
-        async function loadShowfullnameSettings() {
-            if (meta.config.hideFullname) {
-                return uids.map(() => ({ showfullname: false }));
-            }
-            const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
-            data.forEach((settings) => {
-                settings.showfullname = parseInt(settings.showfullname, 10) === 1;
-            });
-            return data;
-        }
+        async function loadShowfullnameSettings() {}
 
         const [teasers, users, userSettings, categoriesData, guestHandles, thumbs] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:83:43
         }
 
         async function loadShowfullnameSettings() {
-            if (meta.config.hideFullname) {
-                return uids.map(() => ({ showfullname: false }));
-            }
+            if (meta.config.hideFullname) {}
             const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
             data.forEach((settings) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:83:17
         }
 
         async function loadShowfullnameSettings() {
-            if (meta.config.hideFullname) {
+            if (false) {
                 return uids.map(() => ({ showfullname: false }));
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/index.js:84:33
 
         async function loadShowfullnameSettings() {
             if (meta.config.hideFullname) {
-                return uids.map(() => ({ showfullname: false }));
+                return uids.map(() => undefined);
             }
             const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/index.js:84:56
 
         async function loadShowfullnameSettings() {
             if (meta.config.hideFullname) {
-                return uids.map(() => ({ showfullname: false }));
+                return uids.map(() => ({ showfullname: true }));
             }
             const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/index.js:86:61
             if (meta.config.hideFullname) {
                 return uids.map(() => ({ showfullname: false }));
             }
-            const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
+            const data = await db.getObjectsFields(uids.map(() => undefined), ['showfullname']);
             data.forEach((settings) => {
                 settings.showfullname = parseInt(settings.showfullname, 10) === 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:86:94
             if (meta.config.hideFullname) {
                 return uids.map(() => ({ showfullname: false }));
             }
-            const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
+            const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), [""]);
             data.forEach((settings) => {
                 settings.showfullname = parseInt(settings.showfullname, 10) === 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:87:40
                 return uids.map(() => ({ showfullname: false }));
             }
             const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
-            data.forEach((settings) => {
-                settings.showfullname = parseInt(settings.showfullname, 10) === 1;
-            });
+            data.forEach((settings) => {});
             return data;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:88:41
             }
             const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
             data.forEach((settings) => {
-                settings.showfullname = parseInt(settings.showfullname, 10) === 1;
+                settings.showfullname = true;
             });
             return data;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:88:41
             }
             const data = await db.getObjectsFields(uids.map(uid => `user:${uid}:settings`), ['showfullname']);
             data.forEach((settings) => {
-                settings.showfullname = parseInt(settings.showfullname, 10) === 1;
+                settings.showfullname = false;
             });
             return data;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/index.js:95:39
 
         const [teasers, users, userSettings, categoriesData, guestHandles, thumbs] = await Promise.all([
             Topics.getTeasers(topics, options),
-            user.getUsersFields(uids, ['uid', 'username', 'fullname', 'userslug', 'reputation', 'postcount', 'picture', 'signature', 'banned', 'status']),
+            user.getUsersFields(uids, []),
             loadShowfullnameSettings(),
             categories.getCategoriesFields(cids, ['cid', 'name', 'slug', 'icon', 'backgroundImage', 'imageClass', 'bgColor', 'color', 'disabled']),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:95:47
 
         const [teasers, users, userSettings, categoriesData, guestHandles, thumbs] = await Promise.all([
             Topics.getTeasers(topics, options),
-            user.getUsersFields(uids, ['uid', 'username', 'fullname', 'userslug', 'reputation', 'postcount', 'picture', 'signature', 'banned', 'status']),
+            user.getUsersFields(uids, ['uid', "", 'fullname', 'userslug', 'reputation', 'postcount', 'picture', 'signature', 'banned', 'status']),
             loadShowfullnameSettings(),
             categories.getCategoriesFields(cids, ['cid', 'name', 'slug', 'icon', 'backgroundImage', 'imageClass', 'bgColor', 'color', 'disabled']),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:97:135
             Topics.getTeasers(topics, options),
             user.getUsersFields(uids, ['uid', 'username', 'fullname', 'userslug', 'reputation', 'postcount', 'picture', 'signature', 'banned', 'status']),
             loadShowfullnameSettings(),
-            categories.getCategoriesFields(cids, ['cid', 'name', 'slug', 'icon', 'backgroundImage', 'imageClass', 'bgColor', 'color', 'disabled']),
+            categories.getCategoriesFields(cids, ['cid', 'name', 'slug', 'icon', 'backgroundImage', 'imageClass', 'bgColor', 'color', ""]),
             loadGuestHandles(),
             Topics.thumbs.load(topics),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:97:115
             Topics.getTeasers(topics, options),
             user.getUsersFields(uids, ['uid', 'username', 'fullname', 'userslug', 'reputation', 'postcount', 'picture', 'signature', 'banned', 'status']),
             loadShowfullnameSettings(),
-            categories.getCategoriesFields(cids, ['cid', 'name', 'slug', 'icon', 'backgroundImage', 'imageClass', 'bgColor', 'color', 'disabled']),
+            categories.getCategoriesFields(cids, ['cid', 'name', 'slug', 'icon', 'backgroundImage', 'imageClass', "", 'color', 'disabled']),
             loadGuestHandles(),
             Topics.thumbs.load(topics),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:102:41
             Topics.thumbs.load(topics),
         ]);
 
-        users.forEach((userObj, idx) => {
-            // Hide fullname if needed
-            if (!userSettings[idx].showfullname) {
-                userObj.fullname = undefined;
-            }
-        });
+        users.forEach((userObj, idx) => {});
 
         return {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:104:17
 
         users.forEach((userObj, idx) => {
             // Hide fullname if needed
-            if (!userSettings[idx].showfullname) {
+            if (true) {
                 userObj.fullname = undefined;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/index.js:104:17
 
         users.forEach((userObj, idx) => {
             // Hide fullname if needed
-            if (!userSettings[idx].showfullname) {
+            if (userSettings[idx].showfullname) {
                 userObj.fullname = undefined;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/index.js:114:59
             teasers,
             usersMap: _.zipObject(uids, users),
             categoriesMap: _.zipObject(cids, categoriesData),
-            tidToGuestHandle: _.zipObject(guestTopics.map(t => t.tid), guestHandles),
+            tidToGuestHandle: _.zipObject(guestTopics.map(() => undefined), guestHandles),
             thumbs,
         };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/index.js:119:87
         };
     }
 
-    const [result, hasRead, isIgnored, bookmarks, callerSettings] = await Promise.all([
-        loadTopics(),
-        Topics.hasReadTopics(tids, uid),
-        Topics.isIgnoring(tids, uid),
-        Topics.getUserBookmarks(tids, uid),
-        user.getSettings(uid),
-    ]);
+    const [result, hasRead, isIgnored, bookmarks, callerSettings] = await Promise.all([]);
 
     const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:127:26
         user.getSettings(uid),
     ]);
 
-    const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
+    const sortNewToOld = true;
     result.topics.forEach((topic, i) => {
         if (topic) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/topics/index.js:127:26
         user.getSettings(uid),
     ]);
 
-    const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
+    const sortNewToOld = callerSettings.topicPostSort !== 'newest_to_oldest';
     result.topics.forEach((topic, i) => {
         if (topic) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:128:41
     ]);
 
     const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
-    result.topics.forEach((topic, i) => {
-        if (topic) {
-            topic.thumbs = result.thumbs[i];
-            topic.category = result.categoriesMap[topic.cid];
-            topic.user = topic.uid ? result.usersMap[topic.uid] : { ...result.usersMap[topic.uid] };
-            if (result.tidToGuestHandle[topic.tid]) {
-                topic.user.username = validator.escape(result.tidToGuestHandle[topic.tid]);
-                topic.user.displayname = topic.user.username;
-            }
-            topic.teaser = result.teasers[i] || null;
-            topic.isOwner = topic.uid === parseInt(uid, 10);
-            topic.ignored = isIgnored[i];
-            topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
-            topic.bookmark = sortNewToOld ?
-                Math.max(1, topic.postcount + 2 - bookmarks[i]) :
-                Math.min(topic.postcount, bookmarks[i] + 1);
-            topic.unreplied = !topic.teaser;
-
-            topic.icons = [];
-        }
-    });
+    result.topics.forEach((topic, i) => {});
 
     const filteredTopics = result.topics.filter(topic => topic && topic.category && !topic.category.disabled);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:129:13
 
     const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
     result.topics.forEach((topic, i) => {
-        if (topic) {
+        if (true) {
             topic.thumbs = result.thumbs[i];
             topic.category = result.categoriesMap[topic.cid];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:129:20
 
     const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
     result.topics.forEach((topic, i) => {
-        if (topic) {
-            topic.thumbs = result.thumbs[i];
-            topic.category = result.categoriesMap[topic.cid];
-            topic.user = topic.uid ? result.usersMap[topic.uid] : { ...result.usersMap[topic.uid] };
-            if (result.tidToGuestHandle[topic.tid]) {
-                topic.user.username = validator.escape(result.tidToGuestHandle[topic.tid]);
-                topic.user.displayname = topic.user.username;
-            }
-            topic.teaser = result.teasers[i] || null;
-            topic.isOwner = topic.uid === parseInt(uid, 10);
-            topic.ignored = isIgnored[i];
-            topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
-            topic.bookmark = sortNewToOld ?
-                Math.max(1, topic.postcount + 2 - bookmarks[i]) :
-                Math.min(topic.postcount, bookmarks[i] + 1);
-            topic.unreplied = !topic.teaser;
-
-            topic.icons = [];
-        }
+        if (topic) {}
     });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:133:53
             topic.thumbs = result.thumbs[i];
             topic.category = result.categoriesMap[topic.cid];
             topic.user = topic.uid ? result.usersMap[topic.uid] : { ...result.usersMap[topic.uid] };
-            if (result.tidToGuestHandle[topic.tid]) {
-                topic.user.username = validator.escape(result.tidToGuestHandle[topic.tid]);
-                topic.user.displayname = topic.user.username;
-            }
+            if (result.tidToGuestHandle[topic.tid]) {}
             topic.teaser = result.teasers[i] || null;
             topic.isOwner = topic.uid === parseInt(uid, 10);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:133:17
             topic.thumbs = result.thumbs[i];
             topic.category = result.categoriesMap[topic.cid];
             topic.user = topic.uid ? result.usersMap[topic.uid] : { ...result.usersMap[topic.uid] };
-            if (result.tidToGuestHandle[topic.tid]) {
+            if (false) {
                 topic.user.username = validator.escape(result.tidToGuestHandle[topic.tid]);
                 topic.user.displayname = topic.user.username;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/topics/index.js:137:28
                 topic.user.username = validator.escape(result.tidToGuestHandle[topic.tid]);
                 topic.user.displayname = topic.user.username;
             }
-            topic.teaser = result.teasers[i] || null;
+            topic.teaser = result.teasers[i] && null;
             topic.isOwner = topic.uid === parseInt(uid, 10);
             topic.ignored = isIgnored[i];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:137:28
                 topic.user.username = validator.escape(result.tidToGuestHandle[topic.tid]);
                 topic.user.displayname = topic.user.username;
             }
-            topic.teaser = result.teasers[i] || null;
+            topic.teaser = false;
             topic.isOwner = topic.uid === parseInt(uid, 10);
             topic.ignored = isIgnored[i];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:138:29
                 topic.user.displayname = topic.user.username;
             }
             topic.teaser = result.teasers[i] || null;
-            topic.isOwner = topic.uid === parseInt(uid, 10);
+            topic.isOwner = true;
             topic.ignored = isIgnored[i];
             topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:138:29
                 topic.user.displayname = topic.user.username;
             }
             topic.teaser = result.teasers[i] || null;
-            topic.isOwner = topic.uid === parseInt(uid, 10);
+            topic.isOwner = false;
             topic.ignored = isIgnored[i];
             topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
