[NoCoverage] BlockStatement
src/topics/recent.js:16:77
         year: 31104000000,
     };
 
-    Topics.getRecentTopics = async function (cid, uid, start, stop, filter) {
-        return await Topics.getSortedTopics({
-            cids: cid,
-            uid: uid,
-            start: start,
-            stop: stop,
-            filter: filter,
-            sort: 'recent',
-        });
-    };
+    Topics.getRecentTopics = async function (cid, uid, start, stop, filter) {};
 
     /* not an orphan method, used in widget-essentials */

[Killed] BlockStatement
src/topics/recent.js:28:55
     };
 
     /* not an orphan method, used in widget-essentials */
-    Topics.getLatestTopics = async function (options) {
-        // uid, start, stop, term
-        const tids = await Topics.getLatestTidsFromSet('topics:recent', options.start, options.stop, options.term);
-        const topics = await Topics.getTopics(tids, options);
-        return { topics: topics, nextStart: options.stop + 1 };
-    };
+    Topics.getLatestTopics = async function (options) {};
 
     Topics.getLatestTidsFromSet = async function (set, start, stop, term) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/recent.js:32:45
         // uid, start, stop, term
         const tids = await Topics.getLatestTidsFromSet('topics:recent', options.start, options.stop, options.term);
         const topics = await Topics.getTopics(tids, options);
-        return { topics: topics, nextStart: options.stop + 1 };
+        return { topics: topics, nextStart: options.stop - 1 };
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/recent.js:35:75
         return { topics: topics, nextStart: options.stop + 1 };
     };
 
-    Topics.getLatestTidsFromSet = async function (set, start, stop, term) {
-        let since = terms.day;
-        if (terms[term]) {
-            since = terms[term];
-        }
-
-        const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
-        return await db.getSortedSetRevRangeByScore(set, start, count, '+inf', Date.now() - since);
-    };
+    Topics.getLatestTidsFromSet = async function (set, start, stop, term) {};
 
     Topics.updateLastPostTimeFromLastPid = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/recent.js:37:13
 
     Topics.getLatestTidsFromSet = async function (set, start, stop, term) {
         let since = terms.day;
-        if (terms[term]) {
+        if (false) {
             since = terms[term];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/recent.js:37:26
 
     Topics.getLatestTidsFromSet = async function (set, start, stop, term) {
         let since = terms.day;
-        if (terms[term]) {
-            since = terms[term];
-        }
+        if (terms[term]) {}
 
         const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/recent.js:41:46
             since = terms[term];
         }
 
-        const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
+        const count = parseInt(stop, 10) === +1 ? stop : stop - start + 1;
         return await db.getSortedSetRevRangeByScore(set, start, count, '+inf', Date.now() - since);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/recent.js:41:23
             since = terms[term];
         }
 
-        const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
+        const count = parseInt(stop, 10) !== -1 ? stop : stop - start + 1;
         return await db.getSortedSetRevRangeByScore(set, start, count, '+inf', Date.now() - since);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/recent.js:42:80
         }
 
         const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
-        return await db.getSortedSetRevRangeByScore(set, start, count, '+inf', Date.now() - since);
+        return await db.getSortedSetRevRangeByScore(set, start, count, '+inf', Date.now() + since);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/recent.js:42:72
         }
 
         const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
-        return await db.getSortedSetRevRangeByScore(set, start, count, '+inf', Date.now() - since);
+        return await db.getSortedSetRevRangeByScore(set, start, count, "", Date.now() - since);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/recent.js:45:65
         return await db.getSortedSetRevRangeByScore(set, start, count, '+inf', Date.now() - since);
     };
 
-    Topics.updateLastPostTimeFromLastPid = async function (tid) {
-        const pid = await Topics.getLatestUndeletedPid(tid);
-        if (!pid) {
-            return;
-        }
-        const timestamp = await posts.getPostField(pid, 'timestamp');
-        if (!timestamp) {
-            return;
-        }
-        await Topics.updateLastPostTime(tid, timestamp);
-    };
+    Topics.updateLastPostTimeFromLastPid = async function (tid) {};
 
     Topics.updateLastPostTime = async function (tid, lastposttime) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BooleanLiteral
src/topics/recent.js:47:13
 
     Topics.updateLastPostTimeFromLastPid = async function (tid) {
         const pid = await Topics.getLatestUndeletedPid(tid);
-        if (!pid) {
+        if (pid) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/recent.js:47:19
 
     Topics.updateLastPostTimeFromLastPid = async function (tid) {
         const pid = await Topics.getLatestUndeletedPid(tid);
-        if (!pid) {
-            return;
-        }
+        if (!pid) {}
         const timestamp = await posts.getPostField(pid, 'timestamp');
         if (!timestamp) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/recent.js:51:13
             return;
         }
         const timestamp = await posts.getPostField(pid, 'timestamp');
-        if (!timestamp) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/recent.js:51:13
             return;
         }
         const timestamp = await posts.getPostField(pid, 'timestamp');
-        if (!timestamp) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/recent.js:57:68
         await Topics.updateLastPostTime(tid, timestamp);
     };
 
-    Topics.updateLastPostTime = async function (tid, lastposttime) {
-        await Topics.setTopicField(tid, 'lastposttime', lastposttime);
-        const topicData = await Topics.getTopicFields(tid, ['cid', 'deleted', 'pinned']);
-
-        await db.sortedSetAdd(`cid:${topicData.cid}:tids:lastposttime`, lastposttime, tid);
-
-        await Topics.updateRecent(tid, lastposttime);
-
-        if (!topicData.pinned) {
-            await db.sortedSetAdd(`cid:${topicData.cid}:tids`, lastposttime, tid);
-        }
-    };
+    Topics.updateLastPostTime = async function (tid, lastposttime) {};
 
     Topics.updateRecent = async function (tid, timestamp) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/recent.js:61:31
         await Topics.setTopicField(tid, 'lastposttime', lastposttime);
         const topicData = await Topics.getTopicFields(tid, ['cid', 'deleted', 'pinned']);
 
-        await db.sortedSetAdd(`cid:${topicData.cid}:tids:lastposttime`, lastposttime, tid);
+        await db.sortedSetAdd(``, lastposttime, tid);
 
         await Topics.updateRecent(tid, lastposttime);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/recent.js:65:13
 
         await Topics.updateRecent(tid, lastposttime);
 
-        if (!topicData.pinned) {
+        if (topicData.pinned) {
             await db.sortedSetAdd(`cid:${topicData.cid}:tids`, lastposttime, tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/recent.js:65:13
 
         await Topics.updateRecent(tid, lastposttime);
 
-        if (!topicData.pinned) {
+        if (true) {
             await db.sortedSetAdd(`cid:${topicData.cid}:tids`, lastposttime, tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/recent.js:70:59
         }
     };
 
-    Topics.updateRecent = async function (tid, timestamp) {
-        let data = { tid: tid, timestamp: timestamp };
-        if (plugins.hooks.hasListeners('filter:topics.updateRecent')) {
-            data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
-        }
-        if (data && data.tid && data.timestamp) {
-            await db.sortedSetAdd('topics:recent', data.timestamp, data.tid);
-        }
-    };
+    Topics.updateRecent = async function (tid, timestamp) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/recent.js:72:13
 
     Topics.updateRecent = async function (tid, timestamp) {
         let data = { tid: tid, timestamp: timestamp };
-        if (plugins.hooks.hasListeners('filter:topics.updateRecent')) {
+        if (false) {
             data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/recent.js:72:13
 
     Topics.updateRecent = async function (tid, timestamp) {
         let data = { tid: tid, timestamp: timestamp };
-        if (plugins.hooks.hasListeners('filter:topics.updateRecent')) {
+        if (true) {
             data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/topics/recent.js:73:45
     Topics.updateRecent = async function (tid, timestamp) {
         let data = { tid: tid, timestamp: timestamp };
         if (plugins.hooks.hasListeners('filter:topics.updateRecent')) {
-            data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
+            data = await plugins.hooks.fire("", { tid: tid, timestamp: timestamp });
         }
         if (data && data.tid && data.timestamp) {

[Killed] BlockStatement
src/topics/recent.js:75:49
         if (plugins.hooks.hasListeners('filter:topics.updateRecent')) {
             data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
         }
-        if (data && data.tid && data.timestamp) {
-            await db.sortedSetAdd('topics:recent', data.timestamp, data.tid);
-        }
+        if (data && data.tid && data.timestamp) {}
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/recent.js:75:13
         if (plugins.hooks.hasListeners('filter:topics.updateRecent')) {
             data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
         }
-        if (data && data.tid && data.timestamp) {
+        if (data || data.tid && data.timestamp) {
             await db.sortedSetAdd('topics:recent', data.timestamp, data.tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
