[Killed] LogicalOperator
src/topics/index.js:140:28
             topic.teaser = result.teasers[i] || null;
             topic.isOwner = topic.uid === parseInt(uid, 10);
             topic.ignored = isIgnored[i];
-            topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
+            topic.unread = parseInt(uid, 10) <= 0 && !hasRead[i] && !isIgnored[i];
             topic.bookmark = sortNewToOld ?
                 Math.max(1, topic.postcount + 2 - bookmarks[i]) :
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:140:28
             topic.teaser = result.teasers[i] || null;
             topic.isOwner = topic.uid === parseInt(uid, 10);
             topic.ignored = isIgnored[i];
-            topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
+            topic.unread = true;
             topic.bookmark = sortNewToOld ?
                 Math.max(1, topic.postcount + 2 - bookmarks[i]) :
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArithmeticOperator
src/topics/index.js:142:29
             topic.ignored = isIgnored[i];
             topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
             topic.bookmark = sortNewToOld ?
-                Math.max(1, topic.postcount + 2 - bookmarks[i]) :
+                Math.max(1, topic.postcount - 2 - bookmarks[i]) :
                 Math.min(topic.postcount, bookmarks[i] + 1);
             topic.unreplied = !topic.teaser;

[NoCoverage] MethodExpression
src/topics/index.js:142:17
             topic.ignored = isIgnored[i];
             topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
             topic.bookmark = sortNewToOld ?
-                Math.max(1, topic.postcount + 2 - bookmarks[i]) :
+                Math.min(1, topic.postcount + 2 - bookmarks[i]) :
                 Math.min(topic.postcount, bookmarks[i] + 1);
             topic.unreplied = !topic.teaser;

[Killed] MethodExpression
src/topics/index.js:143:17
             topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
             topic.bookmark = sortNewToOld ?
                 Math.max(1, topic.postcount + 2 - bookmarks[i]) :
-                Math.min(topic.postcount, bookmarks[i] + 1);
+                Math.max(topic.postcount, bookmarks[i] + 1);
             topic.unreplied = !topic.teaser;
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/index.js:143:43
             topic.unread = parseInt(uid, 10) <= 0 || (!hasRead[i] && !isIgnored[i]);
             topic.bookmark = sortNewToOld ?
                 Math.max(1, topic.postcount + 2 - bookmarks[i]) :
-                Math.min(topic.postcount, bookmarks[i] + 1);
+                Math.min(topic.postcount, bookmarks[i] - 1);
             topic.unreplied = !topic.teaser;
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BooleanLiteral
src/topics/index.js:144:31
             topic.bookmark = sortNewToOld ?
                 Math.max(1, topic.postcount + 2 - bookmarks[i]) :
                 Math.min(topic.postcount, bookmarks[i] + 1);
-            topic.unreplied = !topic.teaser;
+            topic.unreplied = topic.teaser;
 
             topic.icons = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/index.js:150:28
         }
     });
 
-    const filteredTopics = result.topics.filter(topic => topic && topic.category && !topic.category.disabled);
+    const filteredTopics = result.topics;
 
     const hookResult = await plugins.hooks.fire('filter:topics.get', { topics: filteredTopics, uid: uid });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:150:58
         }
     });
 
-    const filteredTopics = result.topics.filter(topic => topic && topic.category && !topic.category.disabled);
+    const filteredTopics = result.topics.filter(topic => false);
 
     const hookResult = await plugins.hooks.fire('filter:topics.get', { topics: filteredTopics, uid: uid });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/index.js:152:70
 
     const filteredTopics = result.topics.filter(topic => topic && topic.category && !topic.category.disabled);
 
-    const hookResult = await plugins.hooks.fire('filter:topics.get', { topics: filteredTopics, uid: uid });
+    const hookResult = await plugins.hooks.fire('filter:topics.get', {});
     return hookResult.topics;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/index.js:170:27
         related,
         thumbs,
         events,
-    ] = await Promise.all([
-        Topics.getTopicPosts(topicData, set, start, stop, uid, reverse),
-        categories.getCategoryData(topicData.cid),
-        categories.getTagWhitelist([topicData.cid]),
-        plugins.hooks.fire('filter:topic.thread_tools', { topic: topicData, uid: uid, tools: [] }),
-        Topics.getFollowData([topicData.tid], uid),
-        Topics.getUserBookmark(topicData.tid, uid),
-        social.getActivePostSharing(),
-        getDeleter(topicData),
-        getMerger(topicData),
-        Topics.getRelatedTopics(topicData, uid),
-        Topics.thumbs.load([topicData]),
-        Topics.events.get(topicData.tid, uid, reverse),
-    ]);
+    ] = await Promise.all([]);
 
     topicData.thumbs = thumbs[0];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/index.js:174:57
         Topics.getTopicPosts(topicData, set, start, stop, uid, reverse),
         categories.getCategoryData(topicData.cid),
         categories.getTagWhitelist([topicData.cid]),
-        plugins.hooks.fire('filter:topic.thread_tools', { topic: topicData, uid: uid, tools: [] }),
+        plugins.hooks.fire('filter:topic.thread_tools', {}),
         Topics.getFollowData([topicData.tid], uid),
         Topics.getUserBookmark(topicData.tid, uid),
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrayDeclaration
src/topics/index.js:174:94
         Topics.getTopicPosts(topicData, set, start, stop, uid, reverse),
         categories.getCategoryData(topicData.cid),
         categories.getTagWhitelist([topicData.cid]),
-        plugins.hooks.fire('filter:topic.thread_tools', { topic: topicData, uid: uid, tools: [] }),
+        plugins.hooks.fire('filter:topic.thread_tools', { topic: topicData, uid: uid, tools: ["Stryker was here"] }),
         Topics.getFollowData([topicData.tid], uid),
         Topics.getUserBookmark(topicData.tid, uid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/index.js:175:30
         categories.getCategoryData(topicData.cid),
         categories.getTagWhitelist([topicData.cid]),
         plugins.hooks.fire('filter:topic.thread_tools', { topic: topicData, uid: uid, tools: [] }),
-        Topics.getFollowData([topicData.tid], uid),
+        Topics.getFollowData([], uid),
         Topics.getUserBookmark(topicData.tid, uid),
         social.getActivePostSharing(),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:188:36
     topicData.thumbs = thumbs[0];
     topicData.posts = posts;
     topicData.events = events;
-    topicData.posts.forEach((p) => {
-        p.events = events.filter(
-            event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
-        );
-    });
+    topicData.posts.forEach((p) => {});
 
     topicData.category = category;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/index.js:189:20
     topicData.posts = posts;
     topicData.events = events;
     topicData.posts.forEach((p) => {
-        p.events = events.filter(
-            event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
-        );
+        p.events = events;
     });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/index.js:190:13
     topicData.events = events;
     topicData.posts.forEach((p) => {
         p.events = events.filter(
-            event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+            () => undefined
         );
     });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ConditionalExpression
src/topics/index.js:190:22
     topicData.events = events;
     topicData.posts.forEach((p) => {
         p.events = events.filter(
-            event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+            event => false
         );
     });

[Killed] ConditionalExpression
src/topics/index.js:200:32
     topicData.maxTags = category.maxTags;
     topicData.thread_tools = threadTools.tools;
     topicData.isFollowing = followData[0].following;
-    topicData.isNotFollowing = !followData[0].following && !followData[0].ignoring;
+    topicData.isNotFollowing = false;
     topicData.isIgnoring = followData[0].ignoring;
     topicData.bookmark = bookmark;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/index.js:200:32
     topicData.maxTags = category.maxTags;
     topicData.thread_tools = threadTools.tools;
     topicData.isFollowing = followData[0].following;
-    topicData.isNotFollowing = !followData[0].following && !followData[0].ignoring;
+    topicData.isNotFollowing = !followData[0].following || !followData[0].ignoring;
     topicData.isIgnoring = followData[0].ignoring;
     topicData.bookmark = bookmark;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:205:9
     topicData.bookmark = bookmark;
     topicData.postSharing = postSharing;
     topicData.deleter = deleter;
-    if (deleter) {
+    if (false) {
         topicData.deletedTimestampISO = utils.toISOString(topicData.deletedTimestamp);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:205:9
     topicData.bookmark = bookmark;
     topicData.postSharing = postSharing;
     topicData.deleter = deleter;
-    if (deleter) {
+    if (true) {
         topicData.deletedTimestampISO = utils.toISOString(topicData.deletedTimestamp);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:209:9
         topicData.deletedTimestampISO = utils.toISOString(topicData.deletedTimestamp);
     }
     topicData.merger = merger;
-    if (merger) {
+    if (true) {
         topicData.mergedTimestampISO = utils.toISOString(topicData.mergedTimestamp);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:209:9
         topicData.deletedTimestampISO = utils.toISOString(topicData.deletedTimestamp);
     }
     topicData.merger = merger;
-    if (merger) {
+    if (false) {
         topicData.mergedTimestampISO = utils.toISOString(topicData.mergedTimestamp);
     }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/index.js:212:25
     if (merger) {
         topicData.mergedTimestampISO = utils.toISOString(topicData.mergedTimestamp);
     }
-    topicData.related = related || [];
+    topicData.related = true;
     topicData.unreplied = topicData.postcount === 1;
     topicData.icons = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/index.js:212:25
     if (merger) {
         topicData.mergedTimestampISO = utils.toISOString(topicData.mergedTimestamp);
     }
-    topicData.related = related || [];
+    topicData.related = related && [];
     topicData.unreplied = topicData.postcount === 1;
     topicData.icons = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:213:27
         topicData.mergedTimestampISO = utils.toISOString(topicData.mergedTimestamp);
     }
     topicData.related = related || [];
-    topicData.unreplied = topicData.postcount === 1;
+    topicData.unreplied = true;
     topicData.icons = [];
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/index.js:213:27
         topicData.mergedTimestampISO = utils.toISOString(topicData.mergedTimestamp);
     }
     topicData.related = related || [];
-    topicData.unreplied = topicData.postcount === 1;
+    topicData.unreplied = topicData.postcount !== 1;
     topicData.icons = [];
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/index.js:216:65
     topicData.unreplied = topicData.postcount === 1;
     topicData.icons = [];
 
-    const result = await plugins.hooks.fire('filter:topic.get', { topic: topicData, uid: uid });
+    const result = await plugins.hooks.fire('filter:topic.get', {});
     return result.topic;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:220:38
     return result.topic;
 };
 
-async function getDeleter(topicData) {
-    if (!parseInt(topicData.deleterUid, 10)) {
-        return null;
-    }
-    return await user.getUserFields(topicData.deleterUid, ['username', 'userslug', 'picture']);
-}
+async function getDeleter(topicData) {}
 
 async function getMerger(topicData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/index.js:221:9
 };
 
 async function getDeleter(topicData) {
-    if (!parseInt(topicData.deleterUid, 10)) {
+    if (parseInt(topicData.deleterUid, 10)) {
         return null;
     }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/index.js:221:46
 };
 
 async function getDeleter(topicData) {
-    if (!parseInt(topicData.deleterUid, 10)) {
-        return null;
-    }
+    if (!parseInt(topicData.deleterUid, 10)) {}
     return await user.getUserFields(topicData.deleterUid, ['username', 'userslug', 'picture']);
 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:224:84
     if (!parseInt(topicData.deleterUid, 10)) {
         return null;
     }
-    return await user.getUserFields(topicData.deleterUid, ['username', 'userslug', 'picture']);
+    return await user.getUserFields(topicData.deleterUid, ['username', 'userslug', ""]);
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:224:72
     if (!parseInt(topicData.deleterUid, 10)) {
         return null;
     }
-    return await user.getUserFields(topicData.deleterUid, ['username', 'userslug', 'picture']);
+    return await user.getUserFields(topicData.deleterUid, ['username', "", 'picture']);
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:227:37
     return await user.getUserFields(topicData.deleterUid, ['username', 'userslug', 'picture']);
 }
 
-async function getMerger(topicData) {
-    if (!parseInt(topicData.mergerUid, 10)) {
-        return null;
-    }
-    const [
-        merger,
-        mergedIntoTitle,
-    ] = await Promise.all([
-        user.getUserFields(topicData.mergerUid, ['username', 'userslug', 'picture']),
-        Topics.getTopicField(topicData.mergeIntoTid, 'title'),
-    ]);
-    merger.mergedIntoTitle = mergedIntoTitle;
-    return merger;
-}
+async function getMerger(topicData) {}
 
 Topics.getMainPost = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:228:9
 }
 
 async function getMerger(topicData) {
-    if (!parseInt(topicData.mergerUid, 10)) {
+    if (true) {
         return null;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:228:9
 }
 
 async function getMerger(topicData) {
-    if (!parseInt(topicData.mergerUid, 10)) {
+    if (false) {
         return null;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:242:48
     return merger;
 }
 
-Topics.getMainPost = async function (tid, uid) {
-    const mainPosts = await Topics.getMainPosts([tid], uid);
-    return Array.isArray(mainPosts) && mainPosts.length ? mainPosts[0] : null;
-};
+Topics.getMainPost = async function (tid, uid) {};
 
 Topics.getMainPids = async function (tids) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrayDeclaration
src/topics/index.js:243:49
 }
 
 Topics.getMainPost = async function (tid, uid) {
-    const mainPosts = await Topics.getMainPosts([tid], uid);
+    const mainPosts = await Topics.getMainPosts([], uid);
     return Array.isArray(mainPosts) && mainPosts.length ? mainPosts[0] : null;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/index.js:244:12
 
 Topics.getMainPost = async function (tid, uid) {
     const mainPosts = await Topics.getMainPosts([tid], uid);
-    return Array.isArray(mainPosts) && mainPosts.length ? mainPosts[0] : null;
+    return Array.isArray(mainPosts) || mainPosts.length ? mainPosts[0] : null;
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:244:12
 
 Topics.getMainPost = async function (tid, uid) {
     const mainPosts = await Topics.getMainPosts([tid], uid);
-    return Array.isArray(mainPosts) && mainPosts.length ? mainPosts[0] : null;
+    return false ? mainPosts[0] : null;
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:247:44
     return Array.isArray(mainPosts) && mainPosts.length ? mainPosts[0] : null;
 };
 
-Topics.getMainPids = async function (tids) {
-    if (!Array.isArray(tids) || !tids.length) {
-        return [];
-    }
-    const topicData = await Topics.getTopicsFields(tids, ['mainPid']);
-    return topicData.map(topic => topic && topic.mainPid);
-};
+Topics.getMainPids = async function (tids) {};
 
 Topics.getMainPosts = async function (tids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/index.js:248:33
 };
 
 Topics.getMainPids = async function (tids) {
-    if (!Array.isArray(tids) || !tids.length) {
+    if (!Array.isArray(tids) || tids.length) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/index.js:248:9
 };
 
 Topics.getMainPids = async function (tids) {
-    if (!Array.isArray(tids) || !tids.length) {
+    if (!Array.isArray(tids) && !tids.length) {
         return [];
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:251:59
     if (!Array.isArray(tids) || !tids.length) {
         return [];
     }
-    const topicData = await Topics.getTopicsFields(tids, ['mainPid']);
+    const topicData = await Topics.getTopicsFields(tids, [""]);
     return topicData.map(topic => topic && topic.mainPid);
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/index.js:252:35
         return [];
     }
     const topicData = await Topics.getTopicsFields(tids, ['mainPid']);
-    return topicData.map(topic => topic && topic.mainPid);
+    return topicData.map(topic => topic || topic.mainPid);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/index.js:252:26
         return [];
     }
     const topicData = await Topics.getTopicsFields(tids, ['mainPid']);
-    return topicData.map(topic => topic && topic.mainPid);
+    return topicData.map(() => undefined);
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:255:50
     return topicData.map(topic => topic && topic.mainPid);
 };
 
-Topics.getMainPosts = async function (tids, uid) {
-    const mainPids = await Topics.getMainPids(tids);
-    return await getMainPosts(mainPids, uid);
-};
+Topics.getMainPosts = async function (tids, uid) {};
 
 async function getMainPosts(mainPids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/index.js:260:44
     return await getMainPosts(mainPids, uid);
 };
 
-async function getMainPosts(mainPids, uid) {
-    let postData = await posts.getPostsByPids(mainPids, uid);
-    postData = await user.blocks.filter(uid, postData);
-    postData.forEach((post) => {
-        if (post) {
-            post.index = 0;
-        }
-    });
-    return await Topics.addPostData(postData, uid);
-}
+async function getMainPosts(mainPids, uid) {}
 
 Topics.isLocked = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/index.js:262:22
 
 async function getMainPosts(mainPids, uid) {
     let postData = await posts.getPostsByPids(mainPids, uid);
-    postData = await user.blocks.filter(uid, postData);
+    postData = await user.blocks;
     postData.forEach((post) => {
         if (post) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:263:32
 async function getMainPosts(mainPids, uid) {
     let postData = await posts.getPostsByPids(mainPids, uid);
     postData = await user.blocks.filter(uid, postData);
-    postData.forEach((post) => {
-        if (post) {
-            post.index = 0;
-        }
-    });
+    postData.forEach((post) => {});
     return await Topics.addPostData(postData, uid);
 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:264:13
     let postData = await posts.getPostsByPids(mainPids, uid);
     postData = await user.blocks.filter(uid, postData);
     postData.forEach((post) => {
-        if (post) {
+        if (true) {
             post.index = 0;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:264:13
     let postData = await posts.getPostsByPids(mainPids, uid);
     postData = await user.blocks.filter(uid, postData);
     postData.forEach((post) => {
-        if (post) {
+        if (false) {
             post.index = 0;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:271:40
     return await Topics.addPostData(postData, uid);
 }
 
-Topics.isLocked = async function (tid) {
-    const locked = await Topics.getTopicField(tid, 'locked');
-    return locked === 1;
-};
+Topics.isLocked = async function (tid) {};
 
 Topics.search = async function (tid, term) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:272:52
 }
 
 Topics.isLocked = async function (tid) {
-    const locked = await Topics.getTopicField(tid, 'locked');
+    const locked = await Topics.getTopicField(tid, "");
     return locked === 1;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:273:12
 
 Topics.isLocked = async function (tid) {
     const locked = await Topics.getTopicField(tid, 'locked');
-    return locked === 1;
+    return true;
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/index.js:273:12
 
 Topics.isLocked = async function (tid) {
     const locked = await Topics.getTopicField(tid, 'locked');
-    return locked === 1;
+    return false;
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/index.js:276:44
     return locked === 1;
 };
 
-Topics.search = async function (tid, term) {
-    if (!tid || !term) {
-        throw new Error('[[error:invalid-data]]');
-    }
-    const result = await plugins.hooks.fire('filter:topic.search', {
-        tid: tid,
-        term: term,
-        ids: [],
-    });
-    return Array.isArray(result) ? result : result.ids;
-};
+Topics.search = async function (tid, term) {};
 
 require('../promisify')(Topics);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/index.js:277:9
 };
 
 Topics.search = async function (tid, term) {
-    if (!tid || !term) {
+    if (!tid && !term) {
         throw new Error('[[error:invalid-data]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/index.js:277:9
 };
 
 Topics.search = async function (tid, term) {
-    if (!tid || !term) {
+    if (tid || !term) {
         throw new Error('[[error:invalid-data]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/index.js:278:25
 
 Topics.search = async function (tid, term) {
     if (!tid || !term) {
-        throw new Error('[[error:invalid-data]]');
+        throw new Error("");
     }
     const result = await plugins.hooks.fire('filter:topic.search', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/index.js:280:68
     if (!tid || !term) {
         throw new Error('[[error:invalid-data]]');
     }
-    const result = await plugins.hooks.fire('filter:topic.search', {
-        tid: tid,
-        term: term,
-        ids: [],
-    });
+    const result = await plugins.hooks.fire('filter:topic.search', {});
     return Array.isArray(result) ? result : result.ids;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
