[NoCoverage] BlockStatement
src/topics/scheduled.js:15:35
 
 const Scheduled = module.exports;
 
-Scheduled.startJobs = function () {
-    winston.verbose('[scheduled topics] Starting jobs.');
-    new CronJob('*/1 * * * *', Scheduled.handleExpired, null, true);
-};
+Scheduled.startJobs = function () {};
 
 Scheduled.handleExpired = async function () {

[NoCoverage] BooleanLiteral
src/topics/scheduled.js:17:63
 
 Scheduled.startJobs = function () {
     winston.verbose('[scheduled topics] Starting jobs.');
-    new CronJob('*/1 * * * *', Scheduled.handleExpired, null, true);
+    new CronJob('*/1 * * * *', Scheduled.handleExpired, null, false);
 };
 

[Killed] UnaryOperator
src/topics/scheduled.js:22:75
 
 Scheduled.handleExpired = async function () {
     const now = Date.now();
-    const tids = await db.getSortedSetRangeByScore('topics:scheduled', 0, -1, '-inf', now);
+    const tids = await db.getSortedSetRangeByScore('topics:scheduled', 0, +1, '-inf', now);
 
     if (!tids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/scheduled.js:22:79
 
 Scheduled.handleExpired = async function () {
     const now = Date.now();
-    const tids = await db.getSortedSetRangeByScore('topics:scheduled', 0, -1, '-inf', now);
+    const tids = await db.getSortedSetRangeByScore('topics:scheduled', 0, -1, "", now);
 
     if (!tids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/scheduled.js:24:9
     const now = Date.now();
     const tids = await db.getSortedSetRangeByScore('topics:scheduled', 0, -1, '-inf', now);
 
-    if (!tids.length) {
+    if (true) {
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/scheduled.js:24:9
     const now = Date.now();
     const tids = await db.getSortedSetRangeByScore('topics:scheduled', 0, -1, '-inf', now);
 
-    if (!tids.length) {
+    if (tids.length) {
         return;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:30:36
 
     let topicsData = await topics.getTopicsData(tids);
     // Filter deleted
-    topicsData = topicsData.filter(topicData => Boolean(topicData));
+    topicsData = topicsData.filter(() => undefined);
     const uids = _.uniq(topicsData.map(topicData => topicData.uid)).filter(uid => uid); // Filter guests topics
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/scheduled.js:30:18
 
     let topicsData = await topics.getTopicsData(tids);
     // Filter deleted
-    topicsData = topicsData.filter(topicData => Boolean(topicData));
+    topicsData = topicsData;
     const uids = _.uniq(topicsData.map(topicData => topicData.uid)).filter(uid => uid); // Filter guests topics
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:31:40
     let topicsData = await topics.getTopicsData(tids);
     // Filter deleted
     topicsData = topicsData.filter(topicData => Boolean(topicData));
-    const uids = _.uniq(topicsData.map(topicData => topicData.uid)).filter(uid => uid); // Filter guests topics
+    const uids = _.uniq(topicsData.map(() => undefined)).filter(uid => uid); // Filter guests topics
 
     // Restore first to be not filtered for being deleted
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:31:76
     let topicsData = await topics.getTopicsData(tids);
     // Filter deleted
     topicsData = topicsData.filter(topicData => Boolean(topicData));
-    const uids = _.uniq(topicsData.map(topicData => topicData.uid)).filter(uid => uid); // Filter guests topics
+    const uids = _.uniq(topicsData.map(topicData => topicData.uid)).filter(() => undefined); // Filter guests topics
 
     // Restore first to be not filtered for being deleted
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:36:24
     // Restore first to be not filtered for being deleted
     // Restoring handles "updateRecentTid"
     await Promise.all([].concat(
-        topicsData.map(topicData => topics.restore(topicData.tid)),
+        topicsData.map(() => undefined),
         topicsData.map(topicData => topics.updateLastPostTimeFromLastPid(topicData.tid))
     ));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:37:24
     // Restoring handles "updateRecentTid"
     await Promise.all([].concat(
         topicsData.map(topicData => topics.restore(topicData.tid)),
-        topicsData.map(topicData => topics.updateLastPostTimeFromLastPid(topicData.tid))
+        topicsData.map(() => undefined)
     ));
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/scheduled.js:40:23
         topicsData.map(topicData => topics.updateLastPostTimeFromLastPid(topicData.tid))
     ));
 
-    await Promise.all([].concat(
+    await Promise.all(["Stryker was here"].concat(
         sendNotifications(uids, topicsData),
         updateUserLastposttimes(uids, topicsData),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:43:27
     await Promise.all([].concat(
         sendNotifications(uids, topicsData),
         updateUserLastposttimes(uids, topicsData),
-        ...topicsData.map(topicData => unpin(topicData.tid, topicData)),
+        ...topicsData.map(() => undefined),
         db.sortedSetsRemoveRangeByScore([`topics:scheduled`], '-inf', now)
     ));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/scheduled.js:44:63
         sendNotifications(uids, topicsData),
         updateUserLastposttimes(uids, topicsData),
         ...topicsData.map(topicData => unpin(topicData.tid, topicData)),
-        db.sortedSetsRemoveRangeByScore([`topics:scheduled`], '-inf', now)
+        db.sortedSetsRemoveRangeByScore([`topics:scheduled`], "", now)
     ));
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/scheduled.js:44:42
         sendNotifications(uids, topicsData),
         updateUserLastposttimes(uids, topicsData),
         ...topicsData.map(topicData => unpin(topicData.tid, topicData)),
-        db.sortedSetsRemoveRangeByScore([`topics:scheduled`], '-inf', now)
+        db.sortedSetsRemoveRangeByScore([``], '-inf', now)
     ));
 };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/scheduled.js:49:49
 };
 
 // topics/tools.js#pin/unpin would block non-admins/mods, thus the local versions
-Scheduled.pin = async function (tid, topicData) {
-    return Promise.all([
-        topics.setTopicField(tid, 'pinned', 1),
-        db.sortedSetAdd(`cid:${topicData.cid}:tids:pinned`, Date.now(), tid),
-        db.sortedSetsRemove([
-            `cid:${topicData.cid}:tids`,
-            `cid:${topicData.cid}:tids:posts`,
-            `cid:${topicData.cid}:tids:votes`,
-            `cid:${topicData.cid}:tids:views`,
-        ], tid),
-    ]);
-};
+Scheduled.pin = async function (tid, topicData) {};
 
 Scheduled.reschedule = async function ({ cid, tid, timestamp, uid }) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/scheduled.js:51:35
 // topics/tools.js#pin/unpin would block non-admins/mods, thus the local versions
 Scheduled.pin = async function (tid, topicData) {
     return Promise.all([
-        topics.setTopicField(tid, 'pinned', 1),
+        topics.setTopicField(tid, "", 1),
         db.sortedSetAdd(`cid:${topicData.cid}:tids:pinned`, Date.now(), tid),
         db.sortedSetsRemove([
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/scheduled.js:55:13
         db.sortedSetAdd(`cid:${topicData.cid}:tids:pinned`, Date.now(), tid),
         db.sortedSetsRemove([
             `cid:${topicData.cid}:tids`,
-            `cid:${topicData.cid}:tids:posts`,
+            ``,
             `cid:${topicData.cid}:tids:votes`,
             `cid:${topicData.cid}:tids:views`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/scheduled.js:62:70
     ]);
 };
 
-Scheduled.reschedule = async function ({ cid, tid, timestamp, uid }) {
-    await Promise.all([
-        db.sortedSetsAdd([
-            'topics:scheduled',
-            `uid:${uid}:topics`,
-            'topics:tid',
-            `cid:${cid}:uid:${uid}:tids`,
-        ], timestamp, tid),
-        shiftPostTimes(tid, timestamp),
-    ]);
-    return topics.updateLastPostTimeFromLastPid(tid);
-};
+Scheduled.reschedule = async function ({ cid, tid, timestamp, uid }) {};
 
 function unpin(tid, topicData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/scheduled.js:63:23
 };
 
 Scheduled.reschedule = async function ({ cid, tid, timestamp, uid }) {
-    await Promise.all([
-        db.sortedSetsAdd([
-            'topics:scheduled',
-            `uid:${uid}:topics`,
-            'topics:tid',
-            `cid:${cid}:uid:${uid}:tids`,
-        ], timestamp, tid),
-        shiftPostTimes(tid, timestamp),
-    ]);
+    await Promise.all([]);
     return topics.updateLastPostTimeFromLastPid(tid);
 };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/scheduled.js:75:32
     return topics.updateLastPostTimeFromLastPid(tid);
 };
 
-function unpin(tid, topicData) {
-    return [
-        topics.setTopicField(tid, 'pinned', 0),
-        topics.deleteTopicField(tid, 'pinExpiry'),
-        db.sortedSetRemove(`cid:${topicData.cid}:tids:pinned`, tid),
-        db.sortedSetAddBulk([
-            [`cid:${topicData.cid}:tids`, topicData.lastposttime, tid],
-            [`cid:${topicData.cid}:tids:posts`, topicData.postcount, tid],
-            [`cid:${topicData.cid}:tids:votes`, parseInt(topicData.votes, 10) || 0, tid],
-            [`cid:${topicData.cid}:tids:views`, topicData.viewcount, tid],
-        ]),
-    ];
-}
+function unpin(tid, topicData) {}
 
 async function sendNotifications(uids, topicsData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/scheduled.js:78:38
 function unpin(tid, topicData) {
     return [
         topics.setTopicField(tid, 'pinned', 0),
-        topics.deleteTopicField(tid, 'pinExpiry'),
+        topics.deleteTopicField(tid, ""),
         db.sortedSetRemove(`cid:${topicData.cid}:tids:pinned`, tid),
         db.sortedSetAddBulk([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/scheduled.js:81:13
         topics.deleteTopicField(tid, 'pinExpiry'),
         db.sortedSetRemove(`cid:${topicData.cid}:tids:pinned`, tid),
         db.sortedSetAddBulk([
-            [`cid:${topicData.cid}:tids`, topicData.lastposttime, tid],
+            [],
             [`cid:${topicData.cid}:tids:posts`, topicData.postcount, tid],
             [`cid:${topicData.cid}:tids:votes`, parseInt(topicData.votes, 10) || 0, tid],
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/scheduled.js:83:49
         db.sortedSetAddBulk([
             [`cid:${topicData.cid}:tids`, topicData.lastposttime, tid],
             [`cid:${topicData.cid}:tids:posts`, topicData.postcount, tid],
-            [`cid:${topicData.cid}:tids:votes`, parseInt(topicData.votes, 10) || 0, tid],
+            [`cid:${topicData.cid}:tids:votes`, false, tid],
             [`cid:${topicData.cid}:tids:views`, topicData.viewcount, tid],
         ]),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/scheduled.js:83:49
         db.sortedSetAddBulk([
             [`cid:${topicData.cid}:tids`, topicData.lastposttime, tid],
             [`cid:${topicData.cid}:tids:posts`, topicData.postcount, tid],
-            [`cid:${topicData.cid}:tids:votes`, parseInt(topicData.votes, 10) || 0, tid],
+            [`cid:${topicData.cid}:tids:votes`, parseInt(topicData.votes, 10) && 0, tid],
             [`cid:${topicData.cid}:tids:views`, topicData.viewcount, tid],
         ]),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/scheduled.js:84:13
             [`cid:${topicData.cid}:tids`, topicData.lastposttime, tid],
             [`cid:${topicData.cid}:tids:posts`, topicData.postcount, tid],
             [`cid:${topicData.cid}:tids:votes`, parseInt(topicData.votes, 10) || 0, tid],
-            [`cid:${topicData.cid}:tids:views`, topicData.viewcount, tid],
+            [],
         ]),
     ];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/scheduled.js:89:52
     ];
 }
 
-async function sendNotifications(uids, topicsData) {
-    const usernames = await Promise.all(uids.map(uid => user.getUserField(uid, 'username')));
-    const uidToUsername = Object.fromEntries(uids.map((uid, idx) => [uid, usernames[idx]]));
-
-    const postsData = await posts.getPostsData(topicsData.map(({ mainPid }) => mainPid));
-    postsData.forEach((postData, idx) => {
-        postData.user = {};
-        postData.user.username = uidToUsername[postData.uid];
-        postData.topic = topicsData[idx];
-    });
-
-    return Promise.all(topicsData.map(
-        (t, idx) => user.notifications.sendTopicNotificationToFollowers(t.uid, t, postsData[idx])
-    ).concat(
-        topicsData.map(
-            (t, idx) => socketHelpers.notifyNew(t.uid, 'newTopic', { posts: [postsData[idx]], topic: t })
-        )
-    ));
-}
+async function sendNotifications(uids, topicsData) {}
 
 async function updateUserLastposttimes(uids, topicsData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:90:50
 }
 
 async function sendNotifications(uids, topicsData) {
-    const usernames = await Promise.all(uids.map(uid => user.getUserField(uid, 'username')));
+    const usernames = await Promise.all(uids.map(() => undefined));
     const uidToUsername = Object.fromEntries(uids.map((uid, idx) => [uid, usernames[idx]]));
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:91:55
 
 async function sendNotifications(uids, topicsData) {
     const usernames = await Promise.all(uids.map(uid => user.getUserField(uid, 'username')));
-    const uidToUsername = Object.fromEntries(uids.map((uid, idx) => [uid, usernames[idx]]));
+    const uidToUsername = Object.fromEntries(uids.map(() => undefined));
 
     const postsData = await posts.getPostsData(topicsData.map(({ mainPid }) => mainPid));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:93:63
     const usernames = await Promise.all(uids.map(uid => user.getUserField(uid, 'username')));
     const uidToUsername = Object.fromEntries(uids.map((uid, idx) => [uid, usernames[idx]]));
 
-    const postsData = await posts.getPostsData(topicsData.map(({ mainPid }) => mainPid));
+    const postsData = await posts.getPostsData(topicsData.map(() => undefined));
     postsData.forEach((postData, idx) => {
         postData.user = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/scheduled.js:94:42
     const uidToUsername = Object.fromEntries(uids.map((uid, idx) => [uid, usernames[idx]]));
 
     const postsData = await posts.getPostsData(topicsData.map(({ mainPid }) => mainPid));
-    postsData.forEach((postData, idx) => {
-        postData.user = {};
-        postData.user.username = uidToUsername[postData.uid];
-        postData.topic = topicsData[idx];
-    });
+    postsData.forEach((postData, idx) => {});
 
     return Promise.all(topicsData.map(
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:101:9
     });
 
     return Promise.all(topicsData.map(
-        (t, idx) => user.notifications.sendTopicNotificationToFollowers(t.uid, t, postsData[idx])
+        () => undefined
     ).concat(
         topicsData.map(
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:104:13
         (t, idx) => user.notifications.sendTopicNotificationToFollowers(t.uid, t, postsData[idx])
     ).concat(
         topicsData.map(
-            (t, idx) => socketHelpers.notifyNew(t.uid, 'newTopic', { posts: [postsData[idx]], topic: t })
+            () => undefined
         )
     ));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/scheduled.js:109:58
     ));
 }
 
-async function updateUserLastposttimes(uids, topicsData) {
-    const lastposttimes = (await user.getUsersFields(uids, ['lastposttime'])).map(u => u.lastposttime);
-
-    let tstampByUid = {};
-    topicsData.forEach((tD) => {
-        tstampByUid[tD.uid] = tstampByUid[tD.uid] ? tstampByUid[tD.uid].concat(tD.lastposttime) : [tD.lastposttime];
-    });
-    tstampByUid = Object.fromEntries(
-        Object.entries(tstampByUid).map(uidTimestamp => [uidTimestamp[0], Math.max(...uidTimestamp[1])])
-    );
-
-    const uidsToUpdate = uids.filter((uid, idx) => tstampByUid[uid] > lastposttimes[idx]);
-    return Promise.all(uidsToUpdate.map(uid => user.setUserField(uid, 'lastposttime', tstampByUid[uid])));
-}
+async function updateUserLastposttimes(uids, topicsData) {}
 
 async function shiftPostTimes(tid, timestamp) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:110:83
 }
 
 async function updateUserLastposttimes(uids, topicsData) {
-    const lastposttimes = (await user.getUsersFields(uids, ['lastposttime'])).map(u => u.lastposttime);
+    const lastposttimes = (await user.getUsersFields(uids, ['lastposttime'])).map(() => undefined);
 
     let tstampByUid = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/scheduled.js:110:60
 }
 
 async function updateUserLastposttimes(uids, topicsData) {
-    const lastposttimes = (await user.getUsersFields(uids, ['lastposttime'])).map(u => u.lastposttime);
+    const lastposttimes = (await user.getUsersFields(uids, [])).map(u => u.lastposttime);
 
     let tstampByUid = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/scheduled.js:113:32
     const lastposttimes = (await user.getUsersFields(uids, ['lastposttime'])).map(u => u.lastposttime);
 
     let tstampByUid = {};
-    topicsData.forEach((tD) => {
-        tstampByUid[tD.uid] = tstampByUid[tD.uid] ? tstampByUid[tD.uid].concat(tD.lastposttime) : [tD.lastposttime];
-    });
+    topicsData.forEach((tD) => {});
     tstampByUid = Object.fromEntries(
         Object.entries(tstampByUid).map(uidTimestamp => [uidTimestamp[0], Math.max(...uidTimestamp[1])])
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/scheduled.js:117:75
         tstampByUid[tD.uid] = tstampByUid[tD.uid] ? tstampByUid[tD.uid].concat(tD.lastposttime) : [tD.lastposttime];
     });
     tstampByUid = Object.fromEntries(
-        Object.entries(tstampByUid).map(uidTimestamp => [uidTimestamp[0], Math.max(...uidTimestamp[1])])
+        Object.entries(tstampByUid).map(uidTimestamp => [uidTimestamp[0], Math.min(...uidTimestamp[1])])
     );
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:117:41
         tstampByUid[tD.uid] = tstampByUid[tD.uid] ? tstampByUid[tD.uid].concat(tD.lastposttime) : [tD.lastposttime];
     });
     tstampByUid = Object.fromEntries(
-        Object.entries(tstampByUid).map(uidTimestamp => [uidTimestamp[0], Math.max(...uidTimestamp[1])])
+        Object.entries(tstampByUid).map(() => undefined)
     );
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/scheduled.js:120:52
         Object.entries(tstampByUid).map(uidTimestamp => [uidTimestamp[0], Math.max(...uidTimestamp[1])])
     );
 
-    const uidsToUpdate = uids.filter((uid, idx) => tstampByUid[uid] > lastposttimes[idx]);
+    const uidsToUpdate = uids.filter((uid, idx) => tstampByUid[uid] >= lastposttimes[idx]);
     return Promise.all(uidsToUpdate.map(uid => user.setUserField(uid, 'lastposttime', tstampByUid[uid])));
 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/scheduled.js:120:52
         Object.entries(tstampByUid).map(uidTimestamp => [uidTimestamp[0], Math.max(...uidTimestamp[1])])
     );
 
-    const uidsToUpdate = uids.filter((uid, idx) => tstampByUid[uid] > lastposttimes[idx]);
+    const uidsToUpdate = uids.filter((uid, idx) => tstampByUid[uid] <= lastposttimes[idx]);
     return Promise.all(uidsToUpdate.map(uid => user.setUserField(uid, 'lastposttime', tstampByUid[uid])));
 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:121:41
     );
 
     const uidsToUpdate = uids.filter((uid, idx) => tstampByUid[uid] > lastposttimes[idx]);
-    return Promise.all(uidsToUpdate.map(uid => user.setUserField(uid, 'lastposttime', tstampByUid[uid])));
+    return Promise.all(uidsToUpdate.map(() => undefined));
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/scheduled.js:124:47
     return Promise.all(uidsToUpdate.map(uid => user.setUserField(uid, 'lastposttime', tstampByUid[uid])));
 }
 
-async function shiftPostTimes(tid, timestamp) {
-    const pids = (await posts.getPidsFromSet(`tid:${tid}:posts`, 0, -1, false));
-    // Leaving other related score values intact, since they reflect post order correctly,
-    // and it seems that's good enough
-    return db.setObjectBulk(pids.map((pid, idx) => [`post:${pid}`, { timestamp: timestamp + idx + 1 }]));
-}
+async function shiftPostTimes(tid, timestamp) {}
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/scheduled.js:125:73
 }
 
 async function shiftPostTimes(tid, timestamp) {
-    const pids = (await posts.getPidsFromSet(`tid:${tid}:posts`, 0, -1, false));
+    const pids = (await posts.getPidsFromSet(`tid:${tid}:posts`, 0, -1, true));
     // Leaving other related score values intact, since they reflect post order correctly,
     // and it seems that's good enough
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/scheduled.js:125:69
 }
 
 async function shiftPostTimes(tid, timestamp) {
-    const pids = (await posts.getPidsFromSet(`tid:${tid}:posts`, 0, -1, false));
+    const pids = (await posts.getPidsFromSet(`tid:${tid}:posts`, 0, +1, false));
     // Leaving other related score values intact, since they reflect post order correctly,
     // and it seems that's good enough
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/scheduled.js:128:81
     const pids = (await posts.getPidsFromSet(`tid:${tid}:posts`, 0, -1, false));
     // Leaving other related score values intact, since they reflect post order correctly,
     // and it seems that's good enough
-    return db.setObjectBulk(pids.map((pid, idx) => [`post:${pid}`, { timestamp: timestamp + idx + 1 }]));
+    return db.setObjectBulk(pids.map((pid, idx) => [`post:${pid}`, { timestamp: timestamp + idx - 1 }]));
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/scheduled.js:128:38
     const pids = (await posts.getPidsFromSet(`tid:${tid}:posts`, 0, -1, false));
     // Leaving other related score values intact, since they reflect post order correctly,
     // and it seems that's good enough
-    return db.setObjectBulk(pids.map((pid, idx) => [`post:${pid}`, { timestamp: timestamp + idx + 1 }]));
+    return db.setObjectBulk(pids.map(() => undefined));
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
