[Killed] LogicalOperator
src/topics/teaser.js:15:13
 
 module.exports = function (Topics) {
     Topics.getTeasers = async function (topics, options) {
-        if (!Array.isArray(topics) || !topics.length) {
+        if (!Array.isArray(topics) && !topics.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:15:13
 
 module.exports = function (Topics) {
     Topics.getTeasers = async function (topics, options) {
-        if (!Array.isArray(topics) || !topics.length) {
+        if (Array.isArray(topics) || !topics.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:20:42
         }
         let uid = options;
         let { teaserPost } = meta.config;
-        if (typeof options === 'object') {
-            uid = options.uid;
-            teaserPost = options.teaserPost || meta.config.teaserPost;
-        }
+        if (typeof options === 'object') {}
 
         const counts = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/teaser.js:20:13
         }
         let uid = options;
         let { teaserPost } = meta.config;
-        if (typeof options === 'object') {
+        if (typeof options !== 'object') {
             uid = options.uid;
             teaserPost = options.teaserPost || meta.config.teaserPost;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:22:26
         let { teaserPost } = meta.config;
         if (typeof options === 'object') {
             uid = options.uid;
-            teaserPost = options.teaserPost || meta.config.teaserPost;
+            teaserPost = true;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:22:26
         let { teaserPost } = meta.config;
         if (typeof options === 'object') {
             uid = options.uid;
-            teaserPost = options.teaserPost || meta.config.teaserPost;
+            teaserPost = false;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/teaser.js:25:24
             teaserPost = options.teaserPost || meta.config.teaserPost;
         }
 
-        const counts = [];
+        const counts = ["Stryker was here"];
         const teaserPids = [];
         const tidToPost = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:29:35
         const teaserPids = [];
         const tidToPost = {};
 
-        topics.forEach((topic) => {
-            counts.push(topic && topic.postcount);
-            if (topic) {
-                if (topic.teaserPid === 'null') {
-                    delete topic.teaserPid;
-                }
-                if (teaserPost === 'first') {
-                    teaserPids.push(topic.mainPid);
-                } else if (teaserPost === 'last-post') {
-                    teaserPids.push(topic.teaserPid || topic.mainPid);
-                } else { // last-reply and everything else uses teaserPid like `last` that was used before
-                    teaserPids.push(topic.teaserPid);
-                }
-            }
-        });
+        topics.forEach((topic) => {});
 
         const [allPostData, callerSettings] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/teaser.js:30:25
         const tidToPost = {};
 
         topics.forEach((topic) => {
-            counts.push(topic && topic.postcount);
+            counts.push(topic || topic.postcount);
             if (topic) {
                 if (topic.teaserPid === 'null') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:30:25
         const tidToPost = {};
 
         topics.forEach((topic) => {
-            counts.push(topic && topic.postcount);
+            counts.push(true);
             if (topic) {
                 if (topic.teaserPid === 'null') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:31:24
 
         topics.forEach((topic) => {
             counts.push(topic && topic.postcount);
-            if (topic) {
-                if (topic.teaserPid === 'null') {
-                    delete topic.teaserPid;
-                }
-                if (teaserPost === 'first') {
-                    teaserPids.push(topic.mainPid);
-                } else if (teaserPost === 'last-post') {
-                    teaserPids.push(topic.teaserPid || topic.mainPid);
-                } else { // last-reply and everything else uses teaserPid like `last` that was used before
-                    teaserPids.push(topic.teaserPid);
-                }
-            }
+            if (topic) {}
         });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:31:17
 
         topics.forEach((topic) => {
             counts.push(topic && topic.postcount);
-            if (topic) {
+            if (true) {
                 if (topic.teaserPid === 'null') {
                     delete topic.teaserPid;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:32:21
         topics.forEach((topic) => {
             counts.push(topic && topic.postcount);
             if (topic) {
-                if (topic.teaserPid === 'null') {
+                if (false) {
                     delete topic.teaserPid;
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:32:21
         topics.forEach((topic) => {
             counts.push(topic && topic.postcount);
             if (topic) {
-                if (topic.teaserPid === 'null') {
+                if (true) {
                     delete topic.teaserPid;
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:35:45
                 if (topic.teaserPid === 'null') {
                     delete topic.teaserPid;
                 }
-                if (teaserPost === 'first') {
-                    teaserPids.push(topic.mainPid);
-                } else if (teaserPost === 'last-post') {
+                if (teaserPost === 'first') {} else if (teaserPost === 'last-post') {
                     teaserPids.push(topic.teaserPid || topic.mainPid);
                 } else { // last-reply and everything else uses teaserPid like `last` that was used before
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:35:21
                 if (topic.teaserPid === 'null') {
                     delete topic.teaserPid;
                 }
-                if (teaserPost === 'first') {
+                if (false) {
                     teaserPids.push(topic.mainPid);
                 } else if (teaserPost === 'last-post') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/teaser.js:37:28
                 }
                 if (teaserPost === 'first') {
                     teaserPids.push(topic.mainPid);
-                } else if (teaserPost === 'last-post') {
+                } else if (teaserPost !== 'last-post') {
                     teaserPids.push(topic.teaserPid || topic.mainPid);
                 } else { // last-reply and everything else uses teaserPid like `last` that was used before
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:37:28
                 }
                 if (teaserPost === 'first') {
                     teaserPids.push(topic.mainPid);
-                } else if (teaserPost === 'last-post') {
+                } else if (true) {
                     teaserPids.push(topic.teaserPid || topic.mainPid);
                 } else { // last-reply and everything else uses teaserPid like `last` that was used before
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/teaser.js:38:37
                 if (teaserPost === 'first') {
                     teaserPids.push(topic.mainPid);
                 } else if (teaserPost === 'last-post') {
-                    teaserPids.push(topic.teaserPid || topic.mainPid);
+                    teaserPids.push(true);
                 } else { // last-reply and everything else uses teaserPid like `last` that was used before
                     teaserPids.push(topic.teaserPid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:38:37
                 if (teaserPost === 'first') {
                     teaserPids.push(topic.mainPid);
                 } else if (teaserPost === 'last-post') {
-                    teaserPids.push(topic.teaserPid || topic.mainPid);
+                    teaserPids.push(false);
                 } else { // last-reply and everything else uses teaserPid like `last` that was used before
                     teaserPids.push(topic.teaserPid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:39:24
                     teaserPids.push(topic.mainPid);
                 } else if (teaserPost === 'last-post') {
                     teaserPids.push(topic.teaserPid || topic.mainPid);
-                } else { // last-reply and everything else uses teaserPid like `last` that was used before
-                    teaserPids.push(topic.teaserPid);
-                }
+                } else {}
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/teaser.js:45:65
             }
         });
 
-        const [allPostData, callerSettings] = await Promise.all([
-            posts.getPostsFields(teaserPids, ['pid', 'uid', 'timestamp', 'tid', 'content']),
-            user.getSettings(uid),
-        ]);
+        const [allPostData, callerSettings] = await Promise.all([]);
         let postData = allPostData.filter(post => post && post.pid);
         postData = await handleBlocks(uid, postData);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/teaser.js:46:46
         });
 
         const [allPostData, callerSettings] = await Promise.all([
-            posts.getPostsFields(teaserPids, ['pid', 'uid', 'timestamp', 'tid', 'content']),
+            posts.getPostsFields(teaserPids, []),
             user.getSettings(uid),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/teaser.js:46:54
         });
 
         const [allPostData, callerSettings] = await Promise.all([
-            posts.getPostsFields(teaserPids, ['pid', 'uid', 'timestamp', 'tid', 'content']),
+            posts.getPostsFields(teaserPids, ['pid', "", 'timestamp', 'tid', 'content']),
             user.getSettings(uid),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/teaser.js:49:24
             posts.getPostsFields(teaserPids, ['pid', 'uid', 'timestamp', 'tid', 'content']),
             user.getSettings(uid),
         ]);
-        let postData = allPostData.filter(post => post && post.pid);
+        let postData = allPostData;
         postData = await handleBlocks(uid, postData);
         postData = postData.filter(Boolean);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/teaser.js:49:51
             posts.getPostsFields(teaserPids, ['pid', 'uid', 'timestamp', 'tid', 'content']),
             user.getSettings(uid),
         ]);
-        let postData = allPostData.filter(post => post && post.pid);
+        let postData = allPostData.filter(post => post || post.pid);
         postData = await handleBlocks(uid, postData);
         postData = postData.filter(Boolean);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/teaser.js:51:20
         ]);
         let postData = allPostData.filter(post => post && post.pid);
         postData = await handleBlocks(uid, postData);
-        postData = postData.filter(Boolean);
+        postData = postData;
         const uids = _.uniq(postData.map(post => post.uid));
         const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/teaser.js:52:42
         let postData = allPostData.filter(post => post && post.pid);
         postData = await handleBlocks(uid, postData);
         postData = postData.filter(Boolean);
-        const uids = _.uniq(postData.map(post => post.uid));
+        const uids = _.uniq(postData.map(() => undefined));
         const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
         const usersData = await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/teaser.js:53:30
         postData = await handleBlocks(uid, postData);
         postData = postData.filter(Boolean);
         const uids = _.uniq(postData.map(post => post.uid));
-        const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
+        const sortNewToOld = callerSettings.topicPostSort !== 'newest_to_oldest';
         const usersData = await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture']);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:53:30
         postData = await handleBlocks(uid, postData);
         postData = postData.filter(Boolean);
         const uids = _.uniq(postData.map(post => post.uid));
-        const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
+        const sortNewToOld = true;
         const usersData = await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture']);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/teaser.js:54:59
         postData = postData.filter(Boolean);
         const uids = _.uniq(postData.map(post => post.uid));
         const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
-        const usersData = await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture']);
+        const usersData = await user.getUsersFields(uids, []);
 
         const users = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/teaser.js:54:79
         postData = postData.filter(Boolean);
         const uids = _.uniq(postData.map(post => post.uid));
         const sortNewToOld = callerSettings.topicPostSort === 'newest_to_oldest';
-        const usersData = await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture']);
+        const usersData = await user.getUsersFields(uids, ['uid', 'username', "", 'picture']);
 
         const users = {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:57:37
         const usersData = await user.getUsersFields(uids, ['uid', 'username', 'userslug', 'picture']);
 
         const users = {};
-        usersData.forEach((user) => {
-            users[user.uid] = user;
-        });
+        usersData.forEach((user) => {});
         postData.forEach((post) => {
             // If the post author isn't represented in the retrieved users' data,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:60:36
         usersData.forEach((user) => {
             users[user.uid] = user;
         });
-        postData.forEach((post) => {
-            // If the post author isn't represented in the retrieved users' data,
-            // then it means they were deleted, assume guest.
-            if (!users.hasOwnProperty(post.uid)) {
-                post.uid = 0;
-            }
-
-            post.user = users[post.uid];
-            post.timestampISO = utils.toISOString(post.timestamp);
-            tidToPost[post.tid] = post;
-        });
+        postData.forEach((post) => {});
         await Promise.all(postData.map(p => posts.parsePost(p)));
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:63:17
         postData.forEach((post) => {
             // If the post author isn't represented in the retrieved users' data,
             // then it means they were deleted, assume guest.
-            if (!users.hasOwnProperty(post.uid)) {
+            if (false) {
                 post.uid = 0;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:63:17
         postData.forEach((post) => {
             // If the post author isn't represented in the retrieved users' data,
             // then it means they were deleted, assume guest.
-            if (!users.hasOwnProperty(post.uid)) {
+            if (true) {
                 post.uid = 0;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/teaser.js:71:40
             post.timestampISO = utils.toISOString(post.timestamp);
             tidToPost[post.tid] = post;
         });
-        await Promise.all(postData.map(p => posts.parsePost(p)));
+        await Promise.all(postData.map(() => undefined));
 
         const { tags } = await plugins.hooks.fire('filter:teasers.configureStripTags', { tags: utils.stripTags.slice(0) });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/teaser.js:73:96
         });
         await Promise.all(postData.map(p => posts.parsePost(p)));
 
-        const { tags } = await plugins.hooks.fire('filter:teasers.configureStripTags', { tags: utils.stripTags.slice(0) });
+        const { tags } = await plugins.hooks.fire('filter:teasers.configureStripTags', { tags: utils.stripTags });
 
         const teasers = topics.map((topic, index) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:75:54
 
         const { tags } = await plugins.hooks.fire('filter:teasers.configureStripTags', { tags: utils.stripTags.slice(0) });
 
-        const teasers = topics.map((topic, index) => {
-            if (!topic) {
-                return null;
-            }
-
-            const topicPost = tidToPost[topic.tid];
-            if (topicPost) {
-                topicPost.index = calcTeaserIndex(teaserPost, counts[index], sortNewToOld);
-                if (topicPost.content) {
-                    topicPost.content = utils.stripHTMLTags(replaceImgWithAltText(topicPost.content), tags);
-                }
-            }
-            return topicPost;
-        });
+        const teasers = topics.map((topic, index) => {});
 
         const result = await plugins.hooks.fire('filter:teasers.get', { teasers: teasers, uid: uid });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:76:17
         const { tags } = await plugins.hooks.fire('filter:teasers.configureStripTags', { tags: utils.stripTags.slice(0) });
 
         const teasers = topics.map((topic, index) => {
-            if (!topic) {
+            if (topic) {
                 return null;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:76:17
         const { tags } = await plugins.hooks.fire('filter:teasers.configureStripTags', { tags: utils.stripTags.slice(0) });
 
         const teasers = topics.map((topic, index) => {
-            if (!topic) {
+            if (true) {
                 return null;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:81:17
             }
 
             const topicPost = tidToPost[topic.tid];
-            if (topicPost) {
+            if (false) {
                 topicPost.index = calcTeaserIndex(teaserPost, counts[index], sortNewToOld);
                 if (topicPost.content) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:81:28
             }
 
             const topicPost = tidToPost[topic.tid];
-            if (topicPost) {
-                topicPost.index = calcTeaserIndex(teaserPost, counts[index], sortNewToOld);
-                if (topicPost.content) {
-                    topicPost.content = utils.stripHTMLTags(replaceImgWithAltText(topicPost.content), tags);
-                }
-            }
+            if (topicPost) {}
             return topicPost;
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:83:40
             const topicPost = tidToPost[topic.tid];
             if (topicPost) {
                 topicPost.index = calcTeaserIndex(teaserPost, counts[index], sortNewToOld);
-                if (topicPost.content) {
-                    topicPost.content = utils.stripHTMLTags(replaceImgWithAltText(topicPost.content), tags);
-                }
+                if (topicPost.content) {}
             }
             return topicPost;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:83:21
             const topicPost = tidToPost[topic.tid];
             if (topicPost) {
                 topicPost.index = calcTeaserIndex(teaserPost, counts[index], sortNewToOld);
-                if (topicPost.content) {
+                if (true) {
                     topicPost.content = utils.stripHTMLTags(replaceImgWithAltText(topicPost.content), tags);
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:94:74
         return result.teasers;
     };
 
-    function calcTeaserIndex(teaserPost, postCountInTopic, sortNewToOld) {
-        if (teaserPost === 'first') {
-            return 1;
-        }
-
-        if (sortNewToOld) {
-            return Math.min(2, postCountInTopic);
-        }
-        return postCountInTopic;
-    }
+    function calcTeaserIndex(teaserPost, postCountInTopic, sortNewToOld) {}
 
     function replaceImgWithAltText(str) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:95:13
     };
 
     function calcTeaserIndex(teaserPost, postCountInTopic, sortNewToOld) {
-        if (teaserPost === 'first') {
+        if (true) {
             return 1;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:95:37
     };
 
     function calcTeaserIndex(teaserPost, postCountInTopic, sortNewToOld) {
-        if (teaserPost === 'first') {
-            return 1;
-        }
+        if (teaserPost === 'first') {}
 
         if (sortNewToOld) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:99:13
             return 1;
         }
 
-        if (sortNewToOld) {
+        if (false) {
             return Math.min(2, postCountInTopic);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:99:13
             return 1;
         }
 
-        if (sortNewToOld) {
+        if (true) {
             return Math.min(2, postCountInTopic);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] MethodExpression
src/topics/teaser.js:100:20
         }
 
         if (sortNewToOld) {
-            return Math.min(2, postCountInTopic);
+            return Math.max(2, postCountInTopic);
         }
         return postCountInTopic;

[Killed] BlockStatement
src/topics/teaser.js:105:41
         return postCountInTopic;
     }
 
-    function replaceImgWithAltText(str) {
-        return String(str).replace(/<img .*?alt="(.*?)"[^>]*>/gi, '$1');
-    }
+    function replaceImgWithAltText(str) {}
 
     async function handleBlocks(uid, teasers) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] Regex
src/topics/teaser.js:106:36
     }
 
     function replaceImgWithAltText(str) {
-        return String(str).replace(/<img .*?alt="(.*?)"[^>]*>/gi, '$1');
+        return String(str).replace(/<img .*?alt="(.*?)"[^>]>/gi, '$1');
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:109:47
         return String(str).replace(/<img .*?alt="(.*?)"[^>]*>/gi, '$1');
     }
 
-    async function handleBlocks(uid, teasers) {
-        const blockedUids = await user.blocks.list(uid);
-        if (!blockedUids.length) {
-            return teasers;
-        }
-
-        return await Promise.all(teasers.map(async (postData) => {
-            if (blockedUids.includes(parseInt(postData.uid, 10))) {
-                return await getPreviousNonBlockedPost(postData, blockedUids);
-            }
-            return postData;
-        }));
-    }
+    async function handleBlocks(uid, teasers) {}
 
     async function getPreviousNonBlockedPost(postData, blockedUids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:111:13
 
     async function handleBlocks(uid, teasers) {
         const blockedUids = await user.blocks.list(uid);
-        if (!blockedUids.length) {
+        if (true) {
             return teasers;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
