[Killed] StringLiteral
src/topics/posts.js:15:34
 const plugins = require('../plugins');
 const utils = require('../utils');
 
-const backlinkRegex = new RegExp(`(?:${nconf.get('url').replace('/', '\\/')}|\b|\\s)\\/topic\\/(\\d+)(?:\\/\\w+)?`, 'g');
+const backlinkRegex = new RegExp(``, 'g');
 
 module.exports = function (Topics) {
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/topics/posts.js:18:54
 const backlinkRegex = new RegExp(`(?:${nconf.get('url').replace('/', '\\/')}|\b|\\s)\\/topic\\/(\\d+)(?:\\/\\w+)?`, 'g');
 
 module.exports = function (Topics) {
-    Topics.onNewPostMade = async function (postData) {
-        await Topics.updateLastPostTime(postData.tid, postData.timestamp);
-        await Topics.addPostToTopic(postData.tid, postData);
-    };
+    Topics.onNewPostMade = async function (postData) {};
 
     Topics.getTopicPosts = async function (topicData, set, start, stop, uid, reverse) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/posts.js:24:25
     };
 
     Topics.getTopicPosts = async function (topicData, set, start, stop, uid, reverse) {
-        if (!topicData) {
-            return [];
-        }
+        if (!topicData) {}
 
         let repliesStart = start;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:24:13
     };
 
     Topics.getTopicPosts = async function (topicData, set, start, stop, uid, reverse) {
-        if (!topicData) {
+        if (true) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/posts.js:25:20
 
     Topics.getTopicPosts = async function (topicData, set, start, stop, uid, reverse) {
         if (!topicData) {
-            return [];
+            return ["Stryker was here"];
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:30:13
 
         let repliesStart = start;
         let repliesStop = stop;
-        if (stop > 0) {
+        if (false) {
             repliesStop -= 1;
             if (start > 0) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/posts.js:30:13
 
         let repliesStart = start;
         let repliesStop = stop;
-        if (stop > 0) {
+        if (stop <= 0) {
             repliesStop -= 1;
             if (start > 0) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] AssignmentOperator
src/topics/posts.js:31:13
         let repliesStart = start;
         let repliesStop = stop;
         if (stop > 0) {
-            repliesStop -= 1;
+            repliesStop += 1;
             if (start > 0) {
                 repliesStart -= 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:32:17
         let repliesStop = stop;
         if (stop > 0) {
             repliesStop -= 1;
-            if (start > 0) {
+            if (false) {
                 repliesStart -= 1;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/posts.js:32:17
         let repliesStop = stop;
         if (stop > 0) {
             repliesStop -= 1;
-            if (start > 0) {
+            if (true) {
                 repliesStart -= 1;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] AssignmentOperator
src/topics/posts.js:33:17
         if (stop > 0) {
             repliesStop -= 1;
             if (start > 0) {
-                repliesStart -= 1;
+                repliesStart += 1;
             }
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/posts.js:36:20
                 repliesStart -= 1;
             }
         }
-        let pids = [];
+        let pids = ["Stryker was here"];
         if (start !== 0 || stop !== 0) {
             pids = await posts.getPidsFromSet(set, repliesStart, repliesStop, reverse);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:37:13
             }
         }
         let pids = [];
-        if (start !== 0 || stop !== 0) {
+        if (true) {
             pids = await posts.getPidsFromSet(set, repliesStart, repliesStop, reverse);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:37:40
             }
         }
         let pids = [];
-        if (start !== 0 || stop !== 0) {
-            pids = await posts.getPidsFromSet(set, repliesStart, repliesStop, reverse);
-        }
+        if (start !== 0 || stop !== 0) {}
         if (!pids.length && !topicData.mainPid) {
             return [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:40:13
         if (start !== 0 || stop !== 0) {
             pids = await posts.getPidsFromSet(set, repliesStart, repliesStop, reverse);
         }
-        if (!pids.length && !topicData.mainPid) {
+        if (true) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:40:13
         if (start !== 0 || stop !== 0) {
             pids = await posts.getPidsFromSet(set, repliesStart, repliesStop, reverse);
         }
-        if (!pids.length && !topicData.mainPid) {
+        if (!pids.length || !topicData.mainPid) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:44:47
             return [];
         }
 
-        if (topicData.mainPid && start === 0) {
-            pids.unshift(topicData.mainPid);
-        }
+        if (topicData.mainPid && start === 0) {}
         let postData = await posts.getPostsByPids(pids, uid);
         if (!postData.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:44:13
             return [];
         }
 
-        if (topicData.mainPid && start === 0) {
+        if (false) {
             pids.unshift(topicData.mainPid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/posts.js:48:13
             pids.unshift(topicData.mainPid);
         }
         let postData = await posts.getPostsByPids(pids, uid);
-        if (!postData.length) {
+        if (postData.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:48:13
             pids.unshift(topicData.mainPid);
         }
         let postData = await posts.getPostsByPids(pids, uid);
-        if (!postData.length) {
+        if (false) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:52:13
             return [];
         }
         let replies = postData;
-        if (topicData.mainPid && start === 0) {
+        if (topicData.mainPid || start === 0) {
             postData[0].index = 0;
             replies = postData.slice(1);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:52:13
             return [];
         }
         let replies = postData;
-        if (topicData.mainPid && start === 0) {
+        if (true) {
             postData[0].index = 0;
             replies = postData.slice(1);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/posts.js:54:23
         let replies = postData;
         if (topicData.mainPid && start === 0) {
             postData[0].index = 0;
-            replies = postData.slice(1);
+            replies = postData;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/posts.js:59:26
 
         Topics.calculatePostIndices(replies, repliesStart);
         await addEventStartEnd(postData, set, reverse, topicData);
-        const allPosts = postData.slice();
+        const allPosts = postData;
         postData = await user.blocks.filter(uid, postData);
         if (allPosts.length !== postData.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/posts.js:60:26
         Topics.calculatePostIndices(replies, repliesStart);
         await addEventStartEnd(postData, set, reverse, topicData);
         const allPosts = postData.slice();
-        postData = await user.blocks.filter(uid, postData);
+        postData = await user.blocks;
         if (allPosts.length !== postData.length) {
             const includedPids = new Set(postData.map(p => p.pid));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:61:13
         await addEventStartEnd(postData, set, reverse, topicData);
         const allPosts = postData.slice();
         postData = await user.blocks.filter(uid, postData);
-        if (allPosts.length !== postData.length) {
+        if (true) {
             const includedPids = new Set(postData.map(p => p.pid));
             allPosts.reverse().forEach((p, index) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/posts.js:61:13
         await addEventStartEnd(postData, set, reverse, topicData);
         const allPosts = postData.slice();
         postData = await user.blocks.filter(uid, postData);
-        if (allPosts.length !== postData.length) {
+        if (allPosts.length === postData.length) {
             const includedPids = new Set(postData.map(p => p.pid));
             allPosts.reverse().forEach((p, index) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArrowFunction
src/topics/posts.js:62:55
         const allPosts = postData.slice();
         postData = await user.blocks.filter(uid, postData);
         if (allPosts.length !== postData.length) {
-            const includedPids = new Set(postData.map(p => p.pid));
+            const includedPids = new Set(postData.map(() => undefined));
             allPosts.reverse().forEach((p, index) => {
                 if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {

[NoCoverage] MethodExpression
src/topics/posts.js:63:13
         postData = await user.blocks.filter(uid, postData);
         if (allPosts.length !== postData.length) {
             const includedPids = new Set(postData.map(p => p.pid));
-            allPosts.reverse().forEach((p, index) => {
+            allPosts.forEach((p, index) => {
                 if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
                     allPosts[index + 1].eventEnd = p.eventEnd;

[NoCoverage] BlockStatement
src/topics/posts.js:63:54
         postData = await user.blocks.filter(uid, postData);
         if (allPosts.length !== postData.length) {
             const includedPids = new Set(postData.map(p => p.pid));
-            allPosts.reverse().forEach((p, index) => {
-                if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
-                    allPosts[index + 1].eventEnd = p.eventEnd;
-                }
-            });
+            allPosts.reverse().forEach((p, index) => {});
         }
 

[NoCoverage] BooleanLiteral
src/topics/posts.js:64:21
         if (allPosts.length !== postData.length) {
             const includedPids = new Set(postData.map(p => p.pid));
             allPosts.reverse().forEach((p, index) => {
-                if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                if (includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
                     allPosts[index + 1].eventEnd = p.eventEnd;
                 }

[NoCoverage] LogicalOperator
src/topics/posts.js:64:21
         if (allPosts.length !== postData.length) {
             const includedPids = new Set(postData.map(p => p.pid));
             allPosts.reverse().forEach((p, index) => {
-                if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                if (!includedPids.has(p.pid) || allPosts[index + 1] && !reverse) {
                     allPosts[index + 1].eventEnd = p.eventEnd;
                 }

[NoCoverage] ArithmeticOperator
src/topics/posts.js:65:30
             const includedPids = new Set(postData.map(p => p.pid));
             allPosts.reverse().forEach((p, index) => {
                 if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
-                    allPosts[index + 1].eventEnd = p.eventEnd;
+                    allPosts[index - 1].eventEnd = p.eventEnd;
                 }
             });

[Killed] ConditionalExpression
src/topics/posts.js:79:13
     };
 
     async function addEventStartEnd(postData, set, reverse, topicData) {
-        if (!postData.length) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:79:13
     };
 
     async function addEventStartEnd(postData, set, reverse, topicData) {
-        if (!postData.length) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:82:40
         if (!postData.length) {
             return;
         }
-        postData.forEach((p, index) => {
-            if (p && p.index === 0 && reverse) {
-                p.eventStart = topicData.lastposttime;
-                p.eventEnd = Date.now();
-            } else if (p && postData[index + 1]) {
-                p.eventStart = reverse ? postData[index + 1].timestamp : p.timestamp;
-                p.eventEnd = reverse ? p.timestamp : postData[index + 1].timestamp;
-            }
-        });
+        postData.forEach((p, index) => {});
         const lastPost = postData[postData.length - 1];
         if (lastPost) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:83:17
             return;
         }
         postData.forEach((p, index) => {
-            if (p && p.index === 0 && reverse) {
+            if (false) {
                 p.eventStart = topicData.lastposttime;
                 p.eventEnd = Date.now();
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:83:48
             return;
         }
         postData.forEach((p, index) => {
-            if (p && p.index === 0 && reverse) {
-                p.eventStart = topicData.lastposttime;
-                p.eventEnd = Date.now();
-            } else if (p && postData[index + 1]) {
+            if (p && p.index === 0 && reverse) {} else if (p && postData[index + 1]) {
                 p.eventStart = reverse ? postData[index + 1].timestamp : p.timestamp;
                 p.eventEnd = reverse ? p.timestamp : postData[index + 1].timestamp;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:86:24
             if (p && p.index === 0 && reverse) {
                 p.eventStart = topicData.lastposttime;
                 p.eventEnd = Date.now();
-            } else if (p && postData[index + 1]) {
+            } else if (true) {
                 p.eventStart = reverse ? postData[index + 1].timestamp : p.timestamp;
                 p.eventEnd = reverse ? p.timestamp : postData[index + 1].timestamp;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:86:24
             if (p && p.index === 0 && reverse) {
                 p.eventStart = topicData.lastposttime;
                 p.eventEnd = Date.now();
-            } else if (p && postData[index + 1]) {
+            } else if (false) {
                 p.eventStart = reverse ? postData[index + 1].timestamp : p.timestamp;
                 p.eventEnd = reverse ? p.timestamp : postData[index + 1].timestamp;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/posts.js:87:51
                 p.eventStart = topicData.lastposttime;
                 p.eventEnd = Date.now();
             } else if (p && postData[index + 1]) {
-                p.eventStart = reverse ? postData[index + 1].timestamp : p.timestamp;
+                p.eventStart = reverse ? postData[index - 1].timestamp : p.timestamp;
                 p.eventEnd = reverse ? p.timestamp : postData[index + 1].timestamp;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArithmeticOperator
src/topics/posts.js:88:63
                 p.eventEnd = Date.now();
             } else if (p && postData[index + 1]) {
                 p.eventStart = reverse ? postData[index + 1].timestamp : p.timestamp;
-                p.eventEnd = reverse ? p.timestamp : postData[index + 1].timestamp;
+                p.eventEnd = reverse ? p.timestamp : postData[index - 1].timestamp;
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/posts.js:91:35
                 p.eventEnd = reverse ? p.timestamp : postData[index + 1].timestamp;
             }
         });
-        const lastPost = postData[postData.length - 1];
+        const lastPost = postData[postData.length + 1];
         if (lastPost) {
             lastPost.eventStart = reverse ? topicData.timestamp : lastPost.timestamp;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:92:13
             }
         });
         const lastPost = postData[postData.length - 1];
-        if (lastPost) {
+        if (true) {
             lastPost.eventStart = reverse ? topicData.timestamp : lastPost.timestamp;
             lastPost.eventEnd = reverse ? lastPost.timestamp : Date.now();
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:92:23
             }
         });
         const lastPost = postData[postData.length - 1];
-        if (lastPost) {
-            lastPost.eventStart = reverse ? topicData.timestamp : lastPost.timestamp;
-            lastPost.eventEnd = reverse ? lastPost.timestamp : Date.now();
-            if (lastPost.index) {
-                const nextPost = await db[reverse ? 'getSortedSetRevRangeWithScores' : 'getSortedSetRangeWithScores'](set, lastPost.index, lastPost.index);
-                if (reverse) {
-                    lastPost.eventStart = nextPost.length ? nextPost[0].score : lastPost.eventStart;
-                } else {
-                    lastPost.eventEnd = nextPost.length ? nextPost[0].score : lastPost.eventEnd;
-                }
-            }
-        }
+        if (lastPost) {}
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:95:17
         if (lastPost) {
             lastPost.eventStart = reverse ? topicData.timestamp : lastPost.timestamp;
             lastPost.eventEnd = reverse ? lastPost.timestamp : Date.now();
-            if (lastPost.index) {
+            if (true) {
                 const nextPost = await db[reverse ? 'getSortedSetRevRangeWithScores' : 'getSortedSetRangeWithScores'](set, lastPost.index, lastPost.index);
                 if (reverse) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:95:33
         if (lastPost) {
             lastPost.eventStart = reverse ? topicData.timestamp : lastPost.timestamp;
             lastPost.eventEnd = reverse ? lastPost.timestamp : Date.now();
-            if (lastPost.index) {
-                const nextPost = await db[reverse ? 'getSortedSetRevRangeWithScores' : 'getSortedSetRangeWithScores'](set, lastPost.index, lastPost.index);
-                if (reverse) {
-                    lastPost.eventStart = nextPost.length ? nextPost[0].score : lastPost.eventStart;
-                } else {
-                    lastPost.eventEnd = nextPost.length ? nextPost[0].score : lastPost.eventEnd;
-                }
-            }
+            if (lastPost.index) {}
         }
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:97:21
             lastPost.eventEnd = reverse ? lastPost.timestamp : Date.now();
             if (lastPost.index) {
                 const nextPost = await db[reverse ? 'getSortedSetRevRangeWithScores' : 'getSortedSetRangeWithScores'](set, lastPost.index, lastPost.index);
-                if (reverse) {
+                if (true) {
                     lastPost.eventStart = nextPost.length ? nextPost[0].score : lastPost.eventStart;
                 } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:97:30
             lastPost.eventEnd = reverse ? lastPost.timestamp : Date.now();
             if (lastPost.index) {
                 const nextPost = await db[reverse ? 'getSortedSetRevRangeWithScores' : 'getSortedSetRangeWithScores'](set, lastPost.index, lastPost.index);
-                if (reverse) {
-                    lastPost.eventStart = nextPost.length ? nextPost[0].score : lastPost.eventStart;
-                } else {
+                if (reverse) {} else {
                     lastPost.eventEnd = nextPost.length ? nextPost[0].score : lastPost.eventEnd;
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:99:24
                 const nextPost = await db[reverse ? 'getSortedSetRevRangeWithScores' : 'getSortedSetRangeWithScores'](set, lastPost.index, lastPost.index);
                 if (reverse) {
                     lastPost.eventStart = nextPost.length ? nextPost[0].score : lastPost.eventStart;
-                } else {
-                    lastPost.eventEnd = nextPost.length ? nextPost[0].score : lastPost.eventEnd;
-                }
+                } else {}
             }
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BooleanLiteral
src/topics/posts.js:107:41
     }
 
     Topics.addPostData = async function (postData, uid) {
-        if (!Array.isArray(postData) || !postData.length) {
+        if (!Array.isArray(postData) || postData.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:107:13
     }
 
     Topics.addPostData = async function (postData, uid) {
-        if (!Array.isArray(postData) || !postData.length) {
+        if (!Array.isArray(postData) && !postData.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:110:43
         if (!Array.isArray(postData) || !postData.length) {
             return [];
         }
-        const pids = postData.map(post => post && post.pid);
+        const pids = postData.map(post => true);
 
         async function getPostUserData(field, method) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:110:43
         if (!Array.isArray(postData) || !postData.length) {
             return [];
         }
-        const pids = postData.map(post => post && post.pid);
+        const pids = postData.map(post => post || post.pid);
 
         async function getPostUserData(field, method) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:112:55
         }
         const pids = postData.map(post => post && post.pid);
 
-        async function getPostUserData(field, method) {
-            const uids = _.uniq(postData.filter(p => p && parseInt(p[field], 10) >= 0).map(p => p[field]));
-            const userData = await method(uids);
-            return _.zipObject(uids, userData);
-        }
+        async function getPostUserData(field, method) {}
         const [
             bookmarks,
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/posts.js:113:49
         const pids = postData.map(post => post && post.pid);
 
         async function getPostUserData(field, method) {
-            const uids = _.uniq(postData.filter(p => p && parseInt(p[field], 10) >= 0).map(p => p[field]));
+            const uids = _.uniq(postData.filter(() => undefined).map(p => p[field]));
             const userData = await method(uids);
             return _.zipObject(uids, userData);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:113:54
         const pids = postData.map(post => post && post.pid);
 
         async function getPostUserData(field, method) {
-            const uids = _.uniq(postData.filter(p => p && parseInt(p[field], 10) >= 0).map(p => p[field]));
+            const uids = _.uniq(postData.filter(p => p || parseInt(p[field], 10) >= 0).map(p => p[field]));
             const userData = await method(uids);
             return _.zipObject(uids, userData);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/posts.js:126:36
         ] = await Promise.all([
             posts.hasBookmarked(pids, uid),
             posts.getVoteStatusByPostIDs(pids, uid),
-            getPostUserData('uid', async uids => await posts.getUserInfoForPosts(uids, uid)),
+            getPostUserData('uid', () => undefined),
             getPostUserData('editor', async uids => await user.getUsersFields(uids, ['uid', 'username', 'userslug'])),
             getPostReplies(pids, uid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
