[Killed] ArrowFunction
src/topics/posts.js:127:39
             posts.hasBookmarked(pids, uid),
             posts.getVoteStatusByPostIDs(pids, uid),
             getPostUserData('uid', async uids => await posts.getUserInfoForPosts(uids, uid)),
-            getPostUserData('editor', async uids => await user.getUsersFields(uids, ['uid', 'username', 'userslug'])),
+            getPostUserData('editor', () => undefined),
             getPostReplies(pids, uid),
             Topics.addParentPosts(postData),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:127:86
             posts.hasBookmarked(pids, uid),
             posts.getVoteStatusByPostIDs(pids, uid),
             getPostUserData('uid', async uids => await posts.getUserInfoForPosts(uids, uid)),
-            getPostUserData('editor', async uids => await user.getUsersFields(uids, ['uid', 'username', 'userslug'])),
+            getPostUserData('editor', async uids => await user.getUsersFields(uids, ["", 'username', 'userslug'])),
             getPostReplies(pids, uid),
             Topics.addParentPosts(postData),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:132:42
             Topics.addParentPosts(postData),
         ]);
 
-        postData.forEach((postObj, i) => {
-            if (postObj) {
-                postObj.user = postObj.uid ? userData[postObj.uid] : { ...userData[postObj.uid] };
-                postObj.editor = postObj.editor ? editors[postObj.editor] : null;
-                postObj.bookmarked = bookmarks[i];
-                postObj.upvoted = voteData.upvotes[i];
-                postObj.downvoted = voteData.downvotes[i];
-                postObj.votes = postObj.votes || 0;
-                postObj.replies = replies[i];
-                postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) === postObj.uid;
-
-                // Username override for guests, if enabled
-                if (meta.config.allowGuestHandles && postObj.uid === 0 && postObj.handle) {
-                    postObj.user.username = validator.escape(String(postObj.handle));
-                    postObj.user.displayname = postObj.user.username;
-                }
-            }
-        });
+        postData.forEach((postObj, i) => {});
 
         const result = await plugins.hooks.fire('filter:topics.addPostData', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:133:17
         ]);
 
         postData.forEach((postObj, i) => {
-            if (postObj) {
+            if (false) {
                 postObj.user = postObj.uid ? userData[postObj.uid] : { ...userData[postObj.uid] };
                 postObj.editor = postObj.editor ? editors[postObj.editor] : null;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:133:26
         ]);
 
         postData.forEach((postObj, i) => {
-            if (postObj) {
-                postObj.user = postObj.uid ? userData[postObj.uid] : { ...userData[postObj.uid] };
-                postObj.editor = postObj.editor ? editors[postObj.editor] : null;
-                postObj.bookmarked = bookmarks[i];
-                postObj.upvoted = voteData.upvotes[i];
-                postObj.downvoted = voteData.downvotes[i];
-                postObj.votes = postObj.votes || 0;
-                postObj.replies = replies[i];
-                postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) === postObj.uid;
-
-                // Username override for guests, if enabled
-                if (meta.config.allowGuestHandles && postObj.uid === 0 && postObj.handle) {
-                    postObj.user.username = validator.escape(String(postObj.handle));
-                    postObj.user.displayname = postObj.user.username;
-                }
-            }
+            if (postObj) {}
         });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/posts.js:134:70
 
         postData.forEach((postObj, i) => {
             if (postObj) {
-                postObj.user = postObj.uid ? userData[postObj.uid] : { ...userData[postObj.uid] };
+                postObj.user = postObj.uid ? userData[postObj.uid] : {};
                 postObj.editor = postObj.editor ? editors[postObj.editor] : null;
                 postObj.bookmarked = bookmarks[i];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:139:33
                 postObj.bookmarked = bookmarks[i];
                 postObj.upvoted = voteData.upvotes[i];
                 postObj.downvoted = voteData.downvotes[i];
-                postObj.votes = postObj.votes || 0;
+                postObj.votes = postObj.votes && 0;
                 postObj.replies = replies[i];
                 postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) === postObj.uid;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:139:33
                 postObj.bookmarked = bookmarks[i];
                 postObj.upvoted = voteData.upvotes[i];
                 postObj.downvoted = voteData.downvotes[i];
-                postObj.votes = postObj.votes || 0;
+                postObj.votes = true;
                 postObj.replies = replies[i];
                 postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) === postObj.uid;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:141:36
                 postObj.downvoted = voteData.downvotes[i];
                 postObj.votes = postObj.votes || 0;
                 postObj.replies = replies[i];
-                postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) === postObj.uid;
+                postObj.selfPost = parseInt(uid, 10) > 0 || parseInt(uid, 10) === postObj.uid;
 
                 // Username override for guests, if enabled
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/posts.js:141:61
                 postObj.downvoted = voteData.downvotes[i];
                 postObj.votes = postObj.votes || 0;
                 postObj.replies = replies[i];
-                postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) === postObj.uid;
+                postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) !== postObj.uid;
 
                 // Username override for guests, if enabled
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:144:21
                 postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) === postObj.uid;
 
                 // Username override for guests, if enabled
-                if (meta.config.allowGuestHandles && postObj.uid === 0 && postObj.handle) {
+                if (meta.config.allowGuestHandles && postObj.uid === 0 || postObj.handle) {
                     postObj.user.username = validator.escape(String(postObj.handle));
                     postObj.user.displayname = postObj.user.username;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:144:21
                 postObj.selfPost = parseInt(uid, 10) > 0 && parseInt(uid, 10) === postObj.uid;
 
                 // Username override for guests, if enabled
-                if (meta.config.allowGuestHandles && postObj.uid === 0 && postObj.handle) {
+                if (true) {
                     postObj.user.username = validator.escape(String(postObj.handle));
                     postObj.user.displayname = postObj.user.username;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:151:49
             }
         });
 
-        const result = await plugins.hooks.fire('filter:topics.addPostData', {
+        const result = await plugins.hooks.fire("", {
             posts: postData,
             uid: uid,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/posts.js:151:78
             }
         });
 
-        const result = await plugins.hooks.fire('filter:topics.addPostData', {
-            posts: postData,
-            uid: uid,
-        });
+        const result = await plugins.hooks.fire('filter:topics.addPostData', {});
         return result.posts;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:158:75
         return result.posts;
     };
 
-    Topics.modifyPostsByPrivilege = function (topicData, topicPrivileges) {
-        const loggedIn = parseInt(topicPrivileges.uid, 10) > 0;
-        topicData.posts.forEach((post) => {
-            if (post) {
-                post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
-                post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
-                post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
-                post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
-                post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
-                post.display_post_menu = topicPrivileges.isAdminOrMod ||
-                    (post.selfPost &&
-                        ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
-                    ((loggedIn || topicData.postSharing.length) && !post.deleted);
-                post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
-
-                posts.modifyPostByPrivilege(post, topicPrivileges);
-            }
-        });
-    };
+    Topics.modifyPostsByPrivilege = function (topicData, topicPrivileges) {};
 
     Topics.addParentPosts = async function (postData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/posts.js:159:26
     };
 
     Topics.modifyPostsByPrivilege = function (topicData, topicPrivileges) {
-        const loggedIn = parseInt(topicPrivileges.uid, 10) > 0;
+        const loggedIn = parseInt(topicPrivileges.uid, 10) <= 0;
         topicData.posts.forEach((post) => {
             if (post) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/topics/posts.js:159:26
     };
 
     Topics.modifyPostsByPrivilege = function (topicData, topicPrivileges) {
-        const loggedIn = parseInt(topicPrivileges.uid, 10) > 0;
+        const loggedIn = parseInt(topicPrivileges.uid, 10) >= 0;
         topicData.posts.forEach((post) => {
             if (post) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:160:43
 
     Topics.modifyPostsByPrivilege = function (topicData, topicPrivileges) {
         const loggedIn = parseInt(topicPrivileges.uid, 10) > 0;
-        topicData.posts.forEach((post) => {
-            if (post) {
-                post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
-                post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
-                post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
-                post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
-                post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
-                post.display_post_menu = topicPrivileges.isAdminOrMod ||
-                    (post.selfPost &&
-                        ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
-                    ((loggedIn || topicData.postSharing.length) && !post.deleted);
-                post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
-
-                posts.modifyPostByPrivilege(post, topicPrivileges);
-            }
-        });
+        topicData.posts.forEach((post) => {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:161:17
     Topics.modifyPostsByPrivilege = function (topicData, topicPrivileges) {
         const loggedIn = parseInt(topicPrivileges.uid, 10) > 0;
         topicData.posts.forEach((post) => {
-            if (post) {
+            if (false) {
                 post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:161:17
     Topics.modifyPostsByPrivilege = function (topicData, topicPrivileges) {
         const loggedIn = parseInt(topicPrivileges.uid, 10) > 0;
         topicData.posts.forEach((post) => {
-            if (post) {
+            if (true) {
                 post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/posts.js:162:39
         const loggedIn = parseInt(topicPrivileges.uid, 10) > 0;
         topicData.posts.forEach((post) => {
             if (post) {
-                post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
+                post.topicOwnerPost = parseInt(topicData.uid, 10) !== parseInt(post.uid, 10);
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/posts.js:162:39
         const loggedIn = parseInt(topicPrivileges.uid, 10) > 0;
         topicData.posts.forEach((post) => {
             if (post) {
-                post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
+                post.topicOwnerPost = false;
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:163:43
         topicData.posts.forEach((post) => {
             if (post) {
                 post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
-                post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
+                post.display_edit_tools = topicPrivileges.isAdminOrMod && post.selfPost && topicPrivileges['posts:edit'];
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:163:76
         topicData.posts.forEach((post) => {
             if (post) {
                 post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
-                post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
+                post.display_edit_tools = topicPrivileges.isAdminOrMod || (false);
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:164:45
             if (post) {
                 post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
-                post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
+                post.display_delete_tools = topicPrivileges.isAdminOrMod && post.selfPost && topicPrivileges['posts:delete'];
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:164:45
             if (post) {
                 post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
-                post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
+                post.display_delete_tools = true;
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:165:48
                 post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
-                post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
+                post.display_moderator_tools = true;
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:165:48
                 post.topicOwnerPost = parseInt(topicData.uid, 10) === parseInt(post.uid, 10);
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
-                post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
+                post.display_moderator_tools = false;
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/posts.js:166:75
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
-                post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
+                post.display_move_tools = topicPrivileges.isAdminOrMod && post.index === 0;
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
                     (post.selfPost &&
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/posts.js:166:43
                 post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
-                post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
+                post.display_move_tools = false;
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
                     (post.selfPost &&
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:167:42
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
-                post.display_post_menu = topicPrivileges.isAdminOrMod ||
-                    (post.selfPost &&
-                        ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
-                    ((loggedIn || topicData.postSharing.length) && !post.deleted);
+                post.display_post_menu = false;
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:167:42
                 post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
-                post.display_post_menu = topicPrivileges.isAdminOrMod ||
-                    (post.selfPost &&
-                        ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                post.display_post_menu = false ||
                     ((loggedIn || topicData.postSharing.length) && !post.deleted);
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:168:22
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
-                    (post.selfPost &&
-                        ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                    (false) ||
                     ((loggedIn || topicData.postSharing.length) && !post.deleted);
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:168:22
                 post.display_moderator_tools = post.display_edit_tools || post.display_delete_tools;
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
-                    (post.selfPost &&
-                        ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                    (post.selfPost || !topicData.locked && !post.deleted || post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)) ||
                     ((loggedIn || topicData.postSharing.length) && !post.deleted);
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BooleanLiteral
src/topics/posts.js:169:27
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
                     (post.selfPost &&
-                        ((!topicData.locked && !post.deleted) ||
+                        ((topicData.locked && !post.deleted) ||
                         (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
                     ((loggedIn || topicData.postSharing.length) && !post.deleted);

[NoCoverage] ConditionalExpression
src/topics/posts.js:169:26
                 post.display_move_tools = topicPrivileges.isAdminOrMod && post.index !== 0;
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
                     (post.selfPost &&
-                        ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                        (true)) ||
                     ((loggedIn || topicData.postSharing.length) && !post.deleted);
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;

[NoCoverage] ConditionalExpression
src/topics/posts.js:170:42
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
                     (post.selfPost &&
                         ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                        (post.deleted && true))) ||
                     ((loggedIn || topicData.postSharing.length) && !post.deleted);
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;

[NoCoverage] ConditionalExpression
src/topics/posts.js:170:26
                 post.display_post_menu = topicPrivileges.isAdminOrMod ||
                     (post.selfPost &&
                         ((!topicData.locked && !post.deleted) ||
-                        (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                        (false))) ||
                     ((loggedIn || topicData.postSharing.length) && !post.deleted);
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
