[Killed] BooleanLiteral
src/topics/teaser.js:111:13
 
     async function handleBlocks(uid, teasers) {
         const blockedUids = await user.blocks.list(uid);
-        if (!blockedUids.length) {
+        if (blockedUids.length) {
             return teasers;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:115:66
             return teasers;
         }
 
-        return await Promise.all(teasers.map(async (postData) => {
-            if (blockedUids.includes(parseInt(postData.uid, 10))) {
-                return await getPreviousNonBlockedPost(postData, blockedUids);
-            }
-            return postData;
-        }));
+        return await Promise.all(teasers.map(async (postData) => {}));
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:116:17
         }
 
         return await Promise.all(teasers.map(async (postData) => {
-            if (blockedUids.includes(parseInt(postData.uid, 10))) {
+            if (true) {
                 return await getPreviousNonBlockedPost(postData, blockedUids);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:116:67
         }
 
         return await Promise.all(teasers.map(async (postData) => {
-            if (blockedUids.includes(parseInt(postData.uid, 10))) {
-                return await getPreviousNonBlockedPost(postData, blockedUids);
-            }
+            if (blockedUids.includes(parseInt(postData.uid, 10))) {}
             return postData;
         }));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:124:25
     }
 
     async function getPreviousNonBlockedPost(postData, blockedUids) {
-        let isBlocked = false;
+        let isBlocked = true;
         let prevPost = postData;
         const postsPerIteration = 5;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/teaser.js:128:20
         let prevPost = postData;
         const postsPerIteration = 5;
         let start = 0;
-        let stop = start + postsPerIteration - 1;
+        let stop = start + postsPerIteration + 1;
         let checkedAllReplies = false;
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/teaser.js:128:20
         let prevPost = postData;
         const postsPerIteration = 5;
         let start = 0;
-        let stop = start + postsPerIteration - 1;
+        let stop = start - postsPerIteration - 1;
         let checkedAllReplies = false;
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:129:33
         const postsPerIteration = 5;
         let start = 0;
         let stop = start + postsPerIteration - 1;
-        let checkedAllReplies = false;
+        let checkedAllReplies = true;
 
         function checkBlocked(post) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:131:37
         let stop = start + postsPerIteration - 1;
         let checkedAllReplies = false;
 
-        function checkBlocked(post) {
-            const isPostBlocked = blockedUids.includes(parseInt(post.uid, 10));
-            prevPost = !isPostBlocked ? post : prevPost;
-            return isPostBlocked;
-        }
+        function checkBlocked(post) {}
 
         do {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:133:24
 
         function checkBlocked(post) {
             const isPostBlocked = blockedUids.includes(parseInt(post.uid, 10));
-            prevPost = !isPostBlocked ? post : prevPost;
+            prevPost = isPostBlocked ? post : prevPost;
             return isPostBlocked;
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/teaser.js:137:12
             return isPostBlocked;
         }
 
-        do {
-            /* eslint-disable no-await-in-loop */
-            let pids = await db.getSortedSetRevRange(`tid:${postData.tid}:posts`, start, stop);
-            if (!pids.length) {
-                checkedAllReplies = true;
-                const mainPid = await Topics.getTopicField(postData.tid, 'mainPid');
-                pids = [mainPid];
-            }
-            const prevPosts = await posts.getPostsFields(pids, ['pid', 'uid', 'timestamp', 'tid', 'content']);
-            isBlocked = prevPosts.every(checkBlocked);
-            start += postsPerIteration;
-            stop = start + postsPerIteration - 1;
-        } while (isBlocked && prevPost && prevPost.pid && !checkedAllReplies);
+        do {} while (isBlocked && prevPost && prevPost.pid && !checkedAllReplies);
 
         return prevPost;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:140:17
         do {
             /* eslint-disable no-await-in-loop */
             let pids = await db.getSortedSetRevRange(`tid:${postData.tid}:posts`, start, stop);
-            if (!pids.length) {
+            if (false) {
                 checkedAllReplies = true;
                 const mainPid = await Topics.getTopicField(postData.tid, 'mainPid');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:140:17
         do {
             /* eslint-disable no-await-in-loop */
             let pids = await db.getSortedSetRevRange(`tid:${postData.tid}:posts`, start, stop);
-            if (!pids.length) {
+            if (pids.length) {
                 checkedAllReplies = true;
                 const mainPid = await Topics.getTopicField(postData.tid, 'mainPid');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:141:37
             /* eslint-disable no-await-in-loop */
             let pids = await db.getSortedSetRevRange(`tid:${postData.tid}:posts`, start, stop);
             if (!pids.length) {
-                checkedAllReplies = true;
+                checkedAllReplies = false;
                 const mainPid = await Topics.getTopicField(postData.tid, 'mainPid');
                 pids = [mainPid];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/teaser.js:145:72
                 const mainPid = await Topics.getTopicField(postData.tid, 'mainPid');
                 pids = [mainPid];
             }
-            const prevPosts = await posts.getPostsFields(pids, ['pid', 'uid', 'timestamp', 'tid', 'content']);
+            const prevPosts = await posts.getPostsFields(pids, ['pid', "", 'timestamp', 'tid', 'content']);
             isBlocked = prevPosts.every(checkBlocked);
             start += postsPerIteration;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/teaser.js:146:25
                 pids = [mainPid];
             }
             const prevPosts = await posts.getPostsFields(pids, ['pid', 'uid', 'timestamp', 'tid', 'content']);
-            isBlocked = prevPosts.every(checkBlocked);
+            isBlocked = prevPosts.some(checkBlocked);
             start += postsPerIteration;
             stop = start + postsPerIteration - 1;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] AssignmentOperator
src/topics/teaser.js:147:13
             }
             const prevPosts = await posts.getPostsFields(pids, ['pid', 'uid', 'timestamp', 'tid', 'content']);
             isBlocked = prevPosts.every(checkBlocked);
-            start += postsPerIteration;
+            start -= postsPerIteration;
             stop = start + postsPerIteration - 1;
         } while (isBlocked && prevPost && prevPost.pid && !checkedAllReplies);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/teaser.js:148:20
             const prevPosts = await posts.getPostsFields(pids, ['pid', 'uid', 'timestamp', 'tid', 'content']);
             isBlocked = prevPosts.every(checkBlocked);
             start += postsPerIteration;
-            stop = start + postsPerIteration - 1;
+            stop = start - postsPerIteration - 1;
         } while (isBlocked && prevPost && prevPost.pid && !checkedAllReplies);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/teaser.js:148:20
             const prevPosts = await posts.getPostsFields(pids, ['pid', 'uid', 'timestamp', 'tid', 'content']);
             isBlocked = prevPosts.every(checkBlocked);
             start += postsPerIteration;
-            stop = start + postsPerIteration - 1;
+            stop = start + postsPerIteration + 1;
         } while (isBlocked && prevPost && prevPost.pid && !checkedAllReplies);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/teaser.js:149:18
             isBlocked = prevPosts.every(checkBlocked);
             start += postsPerIteration;
             stop = start + postsPerIteration - 1;
-        } while (isBlocked && prevPost && prevPost.pid && !checkedAllReplies);
+        } while (isBlocked && prevPost || prevPost.pid && !checkedAllReplies);
 
         return prevPost;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/teaser.js:149:18
             isBlocked = prevPosts.every(checkBlocked);
             start += postsPerIteration;
             stop = start + postsPerIteration - 1;
-        } while (isBlocked && prevPost && prevPost.pid && !checkedAllReplies);
+        } while (isBlocked || prevPost && prevPost.pid && !checkedAllReplies);
 
         return prevPost;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:154:58
         return prevPost;
     }
 
-    Topics.getTeasersByTids = async function (tids, uid) {
-        if (!Array.isArray(tids) || !tids.length) {
-            return [];
-        }
-        const topics = await Topics.getTopicsFields(tids, ['tid', 'postcount', 'teaserPid', 'mainPid']);
-        return await Topics.getTeasers(topics, uid);
-    };
+    Topics.getTeasersByTids = async function (tids, uid) {};
 
     Topics.getTeaser = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:155:37
     }
 
     Topics.getTeasersByTids = async function (tids, uid) {
-        if (!Array.isArray(tids) || !tids.length) {
+        if (!Array.isArray(tids) || tids.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/teaser.js:155:13
     }
 
     Topics.getTeasersByTids = async function (tids, uid) {
-        if (!Array.isArray(tids) || !tids.length) {
+        if (Array.isArray(tids) || !tids.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:162:50
         return await Topics.getTeasers(topics, uid);
     };
 
-    Topics.getTeaser = async function (tid, uid) {
-        const teasers = await Topics.getTeasersByTids([tid], uid);
-        return Array.isArray(teasers) && teasers.length ? teasers[0] : null;
-    };
+    Topics.getTeaser = async function (tid, uid) {};
 
     Topics.updateTeaser = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:164:16
 
     Topics.getTeaser = async function (tid, uid) {
         const teasers = await Topics.getTeasersByTids([tid], uid);
-        return Array.isArray(teasers) && teasers.length ? teasers[0] : null;
+        return true ? teasers[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/teaser.js:164:16
 
     Topics.getTeaser = async function (tid, uid) {
         const teasers = await Topics.getTeasersByTids([tid], uid);
-        return Array.isArray(teasers) && teasers.length ? teasers[0] : null;
+        return Array.isArray(teasers) || teasers.length ? teasers[0] : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:167:48
         return Array.isArray(teasers) && teasers.length ? teasers[0] : null;
     };
 
-    Topics.updateTeaser = async function (tid) {
-        let pid = await Topics.getLatestUndeletedReply(tid);
-        pid = pid || null;
-        if (pid) {
-            await Topics.setTopicField(tid, 'teaserPid', pid);
-        } else {
-            await Topics.deleteTopicField(tid, 'teaserPid');
-        }
-    };
+    Topics.updateTeaser = async function (tid) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:169:15
 
     Topics.updateTeaser = async function (tid) {
         let pid = await Topics.getLatestUndeletedReply(tid);
-        pid = pid || null;
+        pid = true;
         if (pid) {
             await Topics.setTopicField(tid, 'teaserPid', pid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/teaser.js:169:15
 
     Topics.updateTeaser = async function (tid) {
         let pid = await Topics.getLatestUndeletedReply(tid);
-        pid = pid || null;
+        pid = false;
         if (pid) {
             await Topics.setTopicField(tid, 'teaserPid', pid);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/teaser.js:170:13
     Topics.updateTeaser = async function (tid) {
         let pid = await Topics.getLatestUndeletedReply(tid);
         pid = pid || null;
-        if (pid) {
+        if (true) {
             await Topics.setTopicField(tid, 'teaserPid', pid);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:170:18
     Topics.updateTeaser = async function (tid) {
         let pid = await Topics.getLatestUndeletedReply(tid);
         pid = pid || null;
-        if (pid) {
-            await Topics.setTopicField(tid, 'teaserPid', pid);
-        } else {
+        if (pid) {} else {
             await Topics.deleteTopicField(tid, 'teaserPid');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/teaser.js:171:45
         let pid = await Topics.getLatestUndeletedReply(tid);
         pid = pid || null;
         if (pid) {
-            await Topics.setTopicField(tid, 'teaserPid', pid);
+            await Topics.setTopicField(tid, "", pid);
         } else {
             await Topics.deleteTopicField(tid, 'teaserPid');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/teaser.js:172:16
         pid = pid || null;
         if (pid) {
             await Topics.setTopicField(tid, 'teaserPid', pid);
-        } else {
-            await Topics.deleteTopicField(tid, 'teaserPid');
-        }
+        } else {}
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/teaser.js:173:48
         if (pid) {
             await Topics.setTopicField(tid, 'teaserPid', pid);
         } else {
-            await Topics.deleteTopicField(tid, 'teaserPid');
+            await Topics.deleteTopicField(tid, "");
         }
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
