[Killed] BlockStatement
src/topics/thumbs.js:18:43
 
 const Thumbs = module.exports;
 
-Thumbs.exists = async function (id, path) {
-    const isDraft = validator.isUUID(String(id));
-    const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
-
-    return db.isSortedSetMember(set, path);
-};
+Thumbs.exists = async function (id, path) {};
 
 Thumbs.load = async function (topicData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/thumbs.js:20:40
 
 Thumbs.exists = async function (id, path) {
     const isDraft = validator.isUUID(String(id));
-    const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
+    const set = `${isDraft ? 'draft' : ""}:${id}:thumbs`;
 
     return db.isSortedSetMember(set, path);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:25:42
     return db.isSortedSetMember(set, path);
 };
 
-Thumbs.load = async function (topicData) {
-    const topicsWithThumbs = topicData.filter(t => t && parseInt(t.numThumbs, 10) > 0);
-    const tidsWithThumbs = topicsWithThumbs.map(t => t.tid);
-    const thumbs = await Thumbs.get(tidsWithThumbs);
-    const tidToThumbs = _.zipObject(tidsWithThumbs, thumbs);
-    return topicData.map(t => (t && t.tid ? (tidToThumbs[t.tid] || []) : []));
-};
+Thumbs.load = async function (topicData) {};
 
 Thumbs.get = async function (tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/thumbs.js:26:52
 };
 
 Thumbs.load = async function (topicData) {
-    const topicsWithThumbs = topicData.filter(t => t && parseInt(t.numThumbs, 10) > 0);
+    const topicsWithThumbs = topicData.filter(t => t || parseInt(t.numThumbs, 10) > 0);
     const tidsWithThumbs = topicsWithThumbs.map(t => t.tid);
     const thumbs = await Thumbs.get(tidsWithThumbs);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/thumbs.js:26:57
 };
 
 Thumbs.load = async function (topicData) {
-    const topicsWithThumbs = topicData.filter(t => t && parseInt(t.numThumbs, 10) > 0);
+    const topicsWithThumbs = topicData.filter(t => t && parseInt(t.numThumbs, 10) >= 0);
     const tidsWithThumbs = topicsWithThumbs.map(t => t.tid);
     const thumbs = await Thumbs.get(tidsWithThumbs);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/thumbs.js:27:49
 
 Thumbs.load = async function (topicData) {
     const topicsWithThumbs = topicData.filter(t => t && parseInt(t.numThumbs, 10) > 0);
-    const tidsWithThumbs = topicsWithThumbs.map(t => t.tid);
+    const tidsWithThumbs = topicsWithThumbs.map(() => undefined);
     const thumbs = await Thumbs.get(tidsWithThumbs);
     const tidToThumbs = _.zipObject(tidsWithThumbs, thumbs);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:30:32
     const tidsWithThumbs = topicsWithThumbs.map(t => t.tid);
     const thumbs = await Thumbs.get(tidsWithThumbs);
     const tidToThumbs = _.zipObject(tidsWithThumbs, thumbs);
-    return topicData.map(t => (t && t.tid ? (tidToThumbs[t.tid] || []) : []));
+    return topicData.map(t => (false ? (tidToThumbs[t.tid] || []) : []));
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:30:46
     const tidsWithThumbs = topicsWithThumbs.map(t => t.tid);
     const thumbs = await Thumbs.get(tidsWithThumbs);
     const tidToThumbs = _.zipObject(tidsWithThumbs, thumbs);
-    return topicData.map(t => (t && t.tid ? (tidToThumbs[t.tid] || []) : []));
+    return topicData.map(t => (t && t.tid ? (true) : []));
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/thumbs.js:35:20
 
 Thumbs.get = async function (tids) {
     // Allow singular or plural usage
-    let singular = false;
+    let singular = true;
     if (!Array.isArray(tids)) {
         tids = [tids];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/thumbs.js:36:9
 Thumbs.get = async function (tids) {
     // Allow singular or plural usage
     let singular = false;
-    if (!Array.isArray(tids)) {
+    if (Array.isArray(tids)) {
         tids = [tids];
         singular = true;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:36:9
 Thumbs.get = async function (tids) {
     // Allow singular or plural usage
     let singular = false;
-    if (!Array.isArray(tids)) {
+    if (true) {
         tids = [tids];
         singular = true;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/thumbs.js:37:16
     // Allow singular or plural usage
     let singular = false;
     if (!Array.isArray(tids)) {
-        tids = [tids];
+        tids = [];
         singular = true;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/thumbs.js:38:20
     let singular = false;
     if (!Array.isArray(tids)) {
         tids = [tids];
-        singular = true;
+        singular = false;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/thumbs.js:41:60
         singular = true;
     }
 
-    if (!meta.config.allowTopicsThumbnail || !tids.length) {
-        return singular ? [] : tids.map(() => []);
-    }
+    if (!meta.config.allowTopicsThumbnail || !tids.length) {}
 
     const hasTimestampPrefix = /^\d+-/;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:41:9
         singular = true;
     }
 
-    if (!meta.config.allowTopicsThumbnail || !tids.length) {
+    if (false) {
         return singular ? [] : tids.map(() => []);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/thumbs.js:42:41
     }
 
     if (!meta.config.allowTopicsThumbnail || !tids.length) {
-        return singular ? [] : tids.map(() => []);
+        return singular ? [] : tids.map(() => undefined);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] Regex
src/topics/thumbs.js:45:32
         return singular ? [] : tids.map(() => []);
     }
 
-    const hasTimestampPrefix = /^\d+-/;
+    const hasTimestampPrefix = /\d+-/;
     const upload_url = nconf.get('relative_path') + nconf.get('upload_url');
     const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? 'draft' : 'topic'}:${tid}:thumbs`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] Regex
src/topics/thumbs.js:45:32
         return singular ? [] : tids.map(() => []);
     }
 
-    const hasTimestampPrefix = /^\d+-/;
+    const hasTimestampPrefix = /^\d-/;
     const upload_url = nconf.get('relative_path') + nconf.get('upload_url');
     const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? 'draft' : 'topic'}:${tid}:thumbs`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/thumbs.js:46:24
     }
 
     const hasTimestampPrefix = /^\d+-/;
-    const upload_url = nconf.get('relative_path') + nconf.get('upload_url');
+    const upload_url = nconf.get('relative_path') - nconf.get('upload_url');
     const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? 'draft' : 'topic'}:${tid}:thumbs`);
     const thumbs = await Promise.all(sets.map(getThumbs));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/thumbs.js:46:63
     }
 
     const hasTimestampPrefix = /^\d+-/;
-    const upload_url = nconf.get('relative_path') + nconf.get('upload_url');
+    const upload_url = nconf.get('relative_path') + nconf.get("");
     const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? 'draft' : 'topic'}:${tid}:thumbs`);
     const thumbs = await Promise.all(sets.map(getThumbs));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/thumbs.js:47:27
 
     const hasTimestampPrefix = /^\d+-/;
     const upload_url = nconf.get('relative_path') + nconf.get('upload_url');
-    const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? 'draft' : 'topic'}:${tid}:thumbs`);
+    const sets = tids.map(() => undefined);
     const thumbs = await Promise.all(sets.map(getThumbs));
     let response = thumbs.map((thumbSet, idx) => thumbSet.map(thumb => ({
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/thumbs.js:49:63
     const upload_url = nconf.get('relative_path') + nconf.get('upload_url');
     const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? 'draft' : 'topic'}:${tid}:thumbs`);
     const thumbs = await Promise.all(sets.map(getThumbs));
-    let response = thumbs.map((thumbSet, idx) => thumbSet.map(thumb => ({
-        id: tids[idx],
-        name: (() => {
-            const name = path.basename(thumb);
-            return hasTimestampPrefix.test(name) ? name.slice(14) : name;
-        })(),
-        url: thumb.startsWith('http') ? thumb : path.posix.join(upload_url, thumb),
-    })));
+    let response = thumbs.map((thumbSet, idx) => thumbSet.map(() => undefined));
 
     ({ thumbs: response } = await plugins.hooks.fire('filter:topics.getThumbs', { tids, thumbs: response }));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/thumbs.js:49:31
     const upload_url = nconf.get('relative_path') + nconf.get('upload_url');
     const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? 'draft' : 'topic'}:${tid}:thumbs`);
     const thumbs = await Promise.all(sets.map(getThumbs));
-    let response = thumbs.map((thumbSet, idx) => thumbSet.map(thumb => ({
-        id: tids[idx],
-        name: (() => {
-            const name = path.basename(thumb);
-            return hasTimestampPrefix.test(name) ? name.slice(14) : name;
-        })(),
-        url: thumb.startsWith('http') ? thumb : path.posix.join(upload_url, thumb),
-    })));
+    let response = thumbs.map(() => undefined);
 
     ({ thumbs: response } = await plugins.hooks.fire('filter:topics.getThumbs', { tids, thumbs: response }));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:51:22
     const thumbs = await Promise.all(sets.map(getThumbs));
     let response = thumbs.map((thumbSet, idx) => thumbSet.map(thumb => ({
         id: tids[idx],
-        name: (() => {
-            const name = path.basename(thumb);
-            return hasTimestampPrefix.test(name) ? name.slice(14) : name;
-        })(),
+        name: (() => {})(),
         url: thumb.startsWith('http') ? thumb : path.posix.join(upload_url, thumb),
     })));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/thumbs.js:53:52
         id: tids[idx],
         name: (() => {
             const name = path.basename(thumb);
-            return hasTimestampPrefix.test(name) ? name.slice(14) : name;
+            return hasTimestampPrefix.test(name) ? name : name;
         })(),
         url: thumb.startsWith('http') ? thumb : path.posix.join(upload_url, thumb),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/thumbs.js:55:14
             const name = path.basename(thumb);
             return hasTimestampPrefix.test(name) ? name.slice(14) : name;
         })(),
-        url: thumb.startsWith('http') ? thumb : path.posix.join(upload_url, thumb),
+        url: thumb.endsWith('http') ? thumb : path.posix.join(upload_url, thumb),
     })));
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/thumbs.js:58:81
         url: thumb.startsWith('http') ? thumb : path.posix.join(upload_url, thumb),
     })));
 
-    ({ thumbs: response } = await plugins.hooks.fire('filter:topics.getThumbs', { tids, thumbs: response }));
+    ({ thumbs: response } = await plugins.hooks.fire('filter:topics.getThumbs', {}));
     return singular ? response.pop() : response;
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:62:31
     return singular ? response.pop() : response;
 };
 
-async function getThumbs(set) {
-    const cached = cache.get(set);
-    if (cached !== undefined) {
-        return cached.slice();
-    }
-    const thumbs = await db.getSortedSetRange(set, 0, -1);
-    cache.set(set, thumbs);
-    return thumbs.slice();
-}
+async function getThumbs(set) {}
 
 Thumbs.associate = async function ({ id, path, score }) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:64:9
 
 async function getThumbs(set) {
     const cached = cache.get(set);
-    if (cached !== undefined) {
+    if (false) {
         return cached.slice();
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/thumbs.js:64:9
 
 async function getThumbs(set) {
     const cached = cache.get(set);
-    if (cached !== undefined) {
+    if (cached === undefined) {
         return cached.slice();
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/thumbs.js:65:16
 async function getThumbs(set) {
     const cached = cache.get(set);
     if (cached !== undefined) {
-        return cached.slice();
+        return cached;
     }
     const thumbs = await db.getSortedSetRange(set, 0, -1);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/thumbs.js:67:55
     if (cached !== undefined) {
         return cached.slice();
     }
-    const thumbs = await db.getSortedSetRange(set, 0, -1);
+    const thumbs = await db.getSortedSetRange(set, 0, +1);
     cache.set(set, thumbs);
     return thumbs.slice();
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/thumbs.js:69:12
     }
     const thumbs = await db.getSortedSetRange(set, 0, -1);
     cache.set(set, thumbs);
-    return thumbs.slice();
+    return thumbs;
 }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:72:57
     return thumbs.slice();
 }
 
-Thumbs.associate = async function ({ id, path, score }) {
-    // Associates a newly uploaded file as a thumb to the passed-in draft or topic
-    const isDraft = validator.isUUID(String(id));
-    const isLocal = !path.startsWith('http');
-    const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
-    const numThumbs = await db.sortedSetCard(set);
-
-    // Normalize the path to allow for changes in upload_path (and so upload_url can be appended if needed)
-    if (isLocal) {
-        path = path.replace(nconf.get('upload_path'), '');
-    }
-    const topics = require('.');
-    await db.sortedSetAdd(set, isFinite(score) ? score : numThumbs, path);
-    if (!isDraft) {
-        const numThumbs = await db.sortedSetCard(set);
-        await topics.setTopicField(id, 'numThumbs', numThumbs);
-    }
-    cache.del(set);
-
-    // Associate thumbnails with the main pid (only on local upload)
-    if (!isDraft && isLocal) {
-        const mainPid = (await topics.getMainPids([id]))[0];
-        await posts.uploads.associate(mainPid, path.slice(1));
-    }
-};
+Thumbs.associate = async function ({ id, path, score }) {};
 
 Thumbs.migrate = async function (uuid, id) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/thumbs.js:75:22
 Thumbs.associate = async function ({ id, path, score }) {
     // Associates a newly uploaded file as a thumb to the passed-in draft or topic
     const isDraft = validator.isUUID(String(id));
-    const isLocal = !path.startsWith('http');
+    const isLocal = !path.endsWith('http');
     const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
     const numThumbs = await db.sortedSetCard(set);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/thumbs.js:75:21
 Thumbs.associate = async function ({ id, path, score }) {
     // Associates a newly uploaded file as a thumb to the passed-in draft or topic
     const isDraft = validator.isUUID(String(id));
-    const isLocal = !path.startsWith('http');
+    const isLocal = path.startsWith('http');
     const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
     const numThumbs = await db.sortedSetCard(set);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:80:9
     const numThumbs = await db.sortedSetCard(set);
 
     // Normalize the path to allow for changes in upload_path (and so upload_url can be appended if needed)
-    if (isLocal) {
+    if (false) {
         path = path.replace(nconf.get('upload_path'), '');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:80:18
     const numThumbs = await db.sortedSetCard(set);
 
     // Normalize the path to allow for changes in upload_path (and so upload_url can be appended if needed)
-    if (isLocal) {
-        path = path.replace(nconf.get('upload_path'), '');
-    }
+    if (isLocal) {}
     const topics = require('.');
     await db.sortedSetAdd(set, isFinite(score) ? score : numThumbs, path);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:85:19
     }
     const topics = require('.');
     await db.sortedSetAdd(set, isFinite(score) ? score : numThumbs, path);
-    if (!isDraft) {
-        const numThumbs = await db.sortedSetCard(set);
-        await topics.setTopicField(id, 'numThumbs', numThumbs);
-    }
+    if (!isDraft) {}
     cache.del(set);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/thumbs.js:85:9
     }
     const topics = require('.');
     await db.sortedSetAdd(set, isFinite(score) ? score : numThumbs, path);
-    if (!isDraft) {
+    if (isDraft) {
         const numThumbs = await db.sortedSetCard(set);
         await topics.setTopicField(id, 'numThumbs', numThumbs);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/thumbs.js:87:40
     await db.sortedSetAdd(set, isFinite(score) ? score : numThumbs, path);
     if (!isDraft) {
         const numThumbs = await db.sortedSetCard(set);
-        await topics.setTopicField(id, 'numThumbs', numThumbs);
+        await topics.setTopicField(id, "", numThumbs);
     }
     cache.del(set);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/thumbs.js:92:9
     cache.del(set);
 
     // Associate thumbnails with the main pid (only on local upload)
-    if (!isDraft && isLocal) {
+    if (isDraft && isLocal) {
         const mainPid = (await topics.getMainPids([id]))[0];
         await posts.uploads.associate(mainPid, path.slice(1));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:92:9
     cache.del(set);
 
     // Associate thumbnails with the main pid (only on local upload)
-    if (!isDraft && isLocal) {
+    if (false) {
         const mainPid = (await topics.getMainPids([id]))[0];
         await posts.uploads.associate(mainPid, path.slice(1));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/thumbs.js:94:48
     // Associate thumbnails with the main pid (only on local upload)
     if (!isDraft && isLocal) {
         const mainPid = (await topics.getMainPids([id]))[0];
-        await posts.uploads.associate(mainPid, path.slice(1));
+        await posts.uploads.associate(mainPid, path);
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:98:44
     }
 };
 
-Thumbs.migrate = async function (uuid, id) {
-    // Converts the draft thumb zset to the topic zset (combines thumbs if applicable)
-    const set = `draft:${uuid}:thumbs`;
-    const thumbs = await db.getSortedSetRangeWithScores(set, 0, -1);
-    await Promise.all(thumbs.map(async thumb => await Thumbs.associate({
-        id,
-        path: thumb.value,
-        score: thumb.score,
-    })));
-    await db.delete(set);
-    cache.del(set);
-};
+Thumbs.migrate = async function (uuid, id) {};
 
 Thumbs.delete = async function (id, relativePaths) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/thumbs.js:101:65
 Thumbs.migrate = async function (uuid, id) {
     // Converts the draft thumb zset to the topic zset (combines thumbs if applicable)
     const set = `draft:${uuid}:thumbs`;
-    const thumbs = await db.getSortedSetRangeWithScores(set, 0, -1);
+    const thumbs = await db.getSortedSetRangeWithScores(set, 0, +1);
     await Promise.all(thumbs.map(async thumb => await Thumbs.associate({
         id,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/thumbs.js:102:34
     // Converts the draft thumb zset to the topic zset (combines thumbs if applicable)
     const set = `draft:${uuid}:thumbs`;
     const thumbs = await db.getSortedSetRangeWithScores(set, 0, -1);
-    await Promise.all(thumbs.map(async thumb => await Thumbs.associate({
-        id,
-        path: thumb.value,
-        score: thumb.score,
-    })));
+    await Promise.all(thumbs.map(() => undefined));
     await db.delete(set);
     cache.del(set);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/thumbs.js:102:72
     // Converts the draft thumb zset to the topic zset (combines thumbs if applicable)
     const set = `draft:${uuid}:thumbs`;
     const thumbs = await db.getSortedSetRangeWithScores(set, 0, -1);
-    await Promise.all(thumbs.map(async thumb => await Thumbs.associate({
-        id,
-        path: thumb.value,
-        score: thumb.score,
-    })));
+    await Promise.all(thumbs.map(async thumb => await Thumbs.associate({})));
     await db.delete(set);
     cache.del(set);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/thumbs.js:113:17
 
 Thumbs.delete = async function (id, relativePaths) {
     const isDraft = validator.isUUID(String(id));
-    const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
+    const set = ``;
 
     if (typeof relativePaths === 'string') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/thumbs.js:115:9
     const isDraft = validator.isUUID(String(id));
     const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
 
-    if (typeof relativePaths === 'string') {
+    if (typeof relativePaths !== 'string') {
         relativePaths = [relativePaths];
     } else if (!Array.isArray(relativePaths)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:115:9
     const isDraft = validator.isUUID(String(id));
     const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
 
-    if (typeof relativePaths === 'string') {
+    if (true) {
         relativePaths = [relativePaths];
     } else if (!Array.isArray(relativePaths)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:117:16
 
     if (typeof relativePaths === 'string') {
         relativePaths = [relativePaths];
-    } else if (!Array.isArray(relativePaths)) {
+    } else if (true) {
         throw new Error('[[error:invalid-data]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:117:16
 
     if (typeof relativePaths === 'string') {
         relativePaths = [relativePaths];
-    } else if (!Array.isArray(relativePaths)) {
+    } else if (false) {
         throw new Error('[[error:invalid-data]]');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/thumbs.js:121:45
         throw new Error('[[error:invalid-data]]');
     }
 
-    const absolutePaths = relativePaths.map(relativePath => path.join(nconf.get('upload_path'), relativePath));
+    const absolutePaths = relativePaths.map(() => undefined);
     const [associated, existsOnDisk] = await Promise.all([
         db.isSortedSetMembers(set, relativePaths),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/thumbs.js:121:81
         throw new Error('[[error:invalid-data]]');
     }
 
-    const absolutePaths = relativePaths.map(relativePath => path.join(nconf.get('upload_path'), relativePath));
+    const absolutePaths = relativePaths.map(relativePath => path.join(nconf.get(""), relativePath));
     const [associated, existsOnDisk] = await Promise.all([
         db.isSortedSetMembers(set, relativePaths),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/thumbs.js:122:58
     }
 
     const absolutePaths = relativePaths.map(relativePath => path.join(nconf.get('upload_path'), relativePath));
-    const [associated, existsOnDisk] = await Promise.all([
-        db.isSortedSetMembers(set, relativePaths),
-        Promise.all(absolutePaths.map(async absolutePath => file.exists(absolutePath))),
-    ]);
+    const [associated, existsOnDisk] = await Promise.all([]);
 
     const toRemove = [];
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing
