[Killed] BooleanLiteral
src/topics/posts.js:171:68
                     (post.selfPost &&
                         ((!topicData.locked && !post.deleted) ||
                         (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
-                    ((loggedIn || topicData.postSharing.length) && !post.deleted);
+                    ((loggedIn || topicData.postSharing.length) && post.deleted);
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/posts.js:171:22
                     (post.selfPost &&
                         ((!topicData.locked && !post.deleted) ||
                         (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
-                    ((loggedIn || topicData.postSharing.length) && !post.deleted);
+                    (false);
                 post.ip = topicPrivileges.isAdminOrMod ? post.ip : undefined;
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:179:55
         });
     };
 
-    Topics.addParentPosts = async function (postData) {
-        let parentPids = postData.map(postObj => (postObj && postObj.hasOwnProperty('toPid') ? parseInt(postObj.toPid, 10) : null)).filter(Boolean);
-
-        if (!parentPids.length) {
-            return;
-        }
-        parentPids = _.uniq(parentPids);
-        const parentPosts = await posts.getPostsFields(parentPids, ['uid']);
-        const parentUids = _.uniq(parentPosts.map(postObj => postObj && postObj.uid));
-        const userData = await user.getUsersFields(parentUids, ['username']);
-
-        const usersMap = {};
-        userData.forEach((user) => {
-            usersMap[user.uid] = user.username;
-        });
-        const parents = {};
-        parentPosts.forEach((post, i) => {
-            parents[parentPids[i]] = { username: usersMap[post.uid] };
-        });
-
-        postData.forEach((post) => {
-            post.parent = parents[post.toPid];
-        });
-    };
+    Topics.addParentPosts = async function (postData) {};
 
     Topics.calculatePostIndices = function (posts, start) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:180:51
     };
 
     Topics.addParentPosts = async function (postData) {
-        let parentPids = postData.map(postObj => (postObj && postObj.hasOwnProperty('toPid') ? parseInt(postObj.toPid, 10) : null)).filter(Boolean);
+        let parentPids = postData.map(postObj => (postObj || postObj.hasOwnProperty('toPid') ? parseInt(postObj.toPid, 10) : null)).filter(Boolean);
 
         if (!parentPids.length) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/posts.js:180:51
     };
 
     Topics.addParentPosts = async function (postData) {
-        let parentPids = postData.map(postObj => (postObj && postObj.hasOwnProperty('toPid') ? parseInt(postObj.toPid, 10) : null)).filter(Boolean);
+        let parentPids = postData.map(postObj => (true ? parseInt(postObj.toPid, 10) : null)).filter(Boolean);
 
         if (!parentPids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/posts.js:182:13
     Topics.addParentPosts = async function (postData) {
         let parentPids = postData.map(postObj => (postObj && postObj.hasOwnProperty('toPid') ? parseInt(postObj.toPid, 10) : null)).filter(Boolean);
 
-        if (!parentPids.length) {
+        if (parentPids.length) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:182:13
     Topics.addParentPosts = async function (postData) {
         let parentPids = postData.map(postObj => (postObj && postObj.hasOwnProperty('toPid') ? parseInt(postObj.toPid, 10) : null)).filter(Boolean);
 
-        if (!parentPids.length) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/posts.js:186:68
             return;
         }
         parentPids = _.uniq(parentPids);
-        const parentPosts = await posts.getPostsFields(parentPids, ['uid']);
+        const parentPosts = await posts.getPostsFields(parentPids, []);
         const parentUids = _.uniq(parentPosts.map(postObj => postObj && postObj.uid));
         const userData = await user.getUsersFields(parentUids, ['username']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:187:62
         }
         parentPids = _.uniq(parentPids);
         const parentPosts = await posts.getPostsFields(parentPids, ['uid']);
-        const parentUids = _.uniq(parentPosts.map(postObj => postObj && postObj.uid));
+        const parentUids = _.uniq(parentPosts.map(postObj => true));
         const userData = await user.getUsersFields(parentUids, ['username']);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:187:62
         }
         parentPids = _.uniq(parentPids);
         const parentPosts = await posts.getPostsFields(parentPids, ['uid']);
-        const parentUids = _.uniq(parentPosts.map(postObj => postObj && postObj.uid));
+        const parentUids = _.uniq(parentPosts.map(postObj => false));
         const userData = await user.getUsersFields(parentUids, ['username']);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:191:36
         const userData = await user.getUsersFields(parentUids, ['username']);
 
         const usersMap = {};
-        userData.forEach((user) => {
-            usersMap[user.uid] = user.username;
-        });
+        userData.forEach((user) => {});
         const parents = {};
         parentPosts.forEach((post, i) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:195:42
             usersMap[user.uid] = user.username;
         });
         const parents = {};
-        parentPosts.forEach((post, i) => {
-            parents[parentPids[i]] = { username: usersMap[post.uid] };
-        });
+        parentPosts.forEach((post, i) => {});
 
         postData.forEach((post) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/posts.js:196:38
         });
         const parents = {};
         parentPosts.forEach((post, i) => {
-            parents[parentPids[i]] = { username: usersMap[post.uid] };
+            parents[parentPids[i]] = {};
         });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:199:36
             parents[parentPids[i]] = { username: usersMap[post.uid] };
         });
 
-        postData.forEach((post) => {
-            post.parent = parents[post.toPid];
-        });
+        postData.forEach((post) => {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:204:59
         });
     };
 
-    Topics.calculatePostIndices = function (posts, start) {
-        posts.forEach((post, index) => {
-            if (post) {
-                post.index = start + index + 1;
-            }
-        });
-    };
+    Topics.calculatePostIndices = function (posts, start) {};
 
     Topics.getLatestUndeletedPid = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:205:40
     };
 
     Topics.calculatePostIndices = function (posts, start) {
-        posts.forEach((post, index) => {
-            if (post) {
-                post.index = start + index + 1;
-            }
-        });
+        posts.forEach((post, index) => {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:206:23
 
     Topics.calculatePostIndices = function (posts, start) {
         posts.forEach((post, index) => {
-            if (post) {
-                post.index = start + index + 1;
-            }
+            if (post) {}
         });
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:206:17
 
     Topics.calculatePostIndices = function (posts, start) {
         posts.forEach((post, index) => {
-            if (post) {
+            if (true) {
                 post.index = start + index + 1;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/posts.js:207:30
     Topics.calculatePostIndices = function (posts, start) {
         posts.forEach((post, index) => {
             if (post) {
-                post.index = start + index + 1;
+                post.index = start + index - 1;
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/posts.js:207:30
     Topics.calculatePostIndices = function (posts, start) {
         posts.forEach((post, index) => {
             if (post) {
-                post.index = start + index + 1;
+                post.index = start - index + 1;
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:212:57
         });
     };
 
-    Topics.getLatestUndeletedPid = async function (tid) {
-        const pid = await Topics.getLatestUndeletedReply(tid);
-        if (pid) {
-            return pid;
-        }
-        const mainPid = await Topics.getTopicField(tid, 'mainPid');
-        const mainPost = await posts.getPostFields(mainPid, ['pid', 'deleted']);
-        return mainPost.pid && !mainPost.deleted ? mainPost.pid : null;
-    };
+    Topics.getLatestUndeletedPid = async function (tid) {};
 
     Topics.getLatestUndeletedReply = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:214:18
 
     Topics.getLatestUndeletedPid = async function (tid) {
         const pid = await Topics.getLatestUndeletedReply(tid);
-        if (pid) {
-            return pid;
-        }
+        if (pid) {}
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
         const mainPost = await posts.getPostFields(mainPid, ['pid', 'deleted']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:214:13
 
     Topics.getLatestUndeletedPid = async function (tid) {
         const pid = await Topics.getLatestUndeletedReply(tid);
-        if (pid) {
+        if (true) {
             return pid;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:218:69
             return pid;
         }
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
-        const mainPost = await posts.getPostFields(mainPid, ['pid', 'deleted']);
+        const mainPost = await posts.getPostFields(mainPid, ['pid', ""]);
         return mainPost.pid && !mainPost.deleted ? mainPost.pid : null;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/posts.js:219:32
         }
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
         const mainPost = await posts.getPostFields(mainPid, ['pid', 'deleted']);
-        return mainPost.pid && !mainPost.deleted ? mainPost.pid : null;
+        return mainPost.pid && mainPost.deleted ? mainPost.pid : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:219:16
         }
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
         const mainPost = await posts.getPostFields(mainPid, ['pid', 'deleted']);
-        return mainPost.pid && !mainPost.deleted ? mainPost.pid : null;
+        return mainPost.pid || !mainPost.deleted ? mainPost.pid : null;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:222:59
         return mainPost.pid && !mainPost.deleted ? mainPost.pid : null;
     };
 
-    Topics.getLatestUndeletedReply = async function (tid) {
-        let isDeleted = false;
-        let index = 0;
-        do {
-            /* eslint-disable no-await-in-loop */
-            const pids = await db.getSortedSetRevRange(`tid:${tid}:posts`, index, index);
-            if (!pids.length) {
-                return null;
-            }
-            isDeleted = await posts.getPostField(pids[0], 'deleted');
-            if (!isDeleted) {
-                return parseInt(pids[0], 10);
-            }
-            index += 1;
-        } while (isDeleted);
-    };
+    Topics.getLatestUndeletedReply = async function (tid) {};
 
     Topics.addPostToTopic = async function (tid, postData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/posts.js:223:25
     };
 
     Topics.getLatestUndeletedReply = async function (tid) {
-        let isDeleted = false;
+        let isDeleted = true;
         let index = 0;
         do {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:225:12
     Topics.getLatestUndeletedReply = async function (tid) {
         let isDeleted = false;
         let index = 0;
-        do {
-            /* eslint-disable no-await-in-loop */
-            const pids = await db.getSortedSetRevRange(`tid:${tid}:posts`, index, index);
-            if (!pids.length) {
-                return null;
-            }
-            isDeleted = await posts.getPostField(pids[0], 'deleted');
-            if (!isDeleted) {
-                return parseInt(pids[0], 10);
-            }
-            index += 1;
-        } while (isDeleted);
+        do {} while (isDeleted);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/posts.js:228:17
         do {
             /* eslint-disable no-await-in-loop */
             const pids = await db.getSortedSetRevRange(`tid:${tid}:posts`, index, index);
-            if (!pids.length) {
+            if (pids.length) {
                 return null;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:228:31
         do {
             /* eslint-disable no-await-in-loop */
             const pids = await db.getSortedSetRevRange(`tid:${tid}:posts`, index, index);
-            if (!pids.length) {
-                return null;
-            }
+            if (!pids.length) {}
             isDeleted = await posts.getPostField(pids[0], 'deleted');
             if (!isDeleted) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:231:59
             if (!pids.length) {
                 return null;
             }
-            isDeleted = await posts.getPostField(pids[0], 'deleted');
+            isDeleted = await posts.getPostField(pids[0], "");
             if (!isDeleted) {
                 return parseInt(pids[0], 10);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/posts.js:232:17
                 return null;
             }
             isDeleted = await posts.getPostField(pids[0], 'deleted');
-            if (!isDeleted) {
+            if (isDeleted) {
                 return parseInt(pids[0], 10);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:232:17
                 return null;
             }
             isDeleted = await posts.getPostField(pids[0], 'deleted');
-            if (!isDeleted) {
+            if (false) {
                 return parseInt(pids[0], 10);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:236:18
                 return parseInt(pids[0], 10);
             }
             index += 1;
-        } while (isDeleted);
+        } while (false);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:239:60
         } while (isDeleted);
     };
 
-    Topics.addPostToTopic = async function (tid, postData) {
-        const mainPid = await Topics.getTopicField(tid, 'mainPid');
-        if (!parseInt(mainPid, 10)) {
-            await Topics.setTopicField(tid, 'mainPid', postData.pid);
-        } else {
-            const upvotes = parseInt(postData.upvotes, 10) || 0;
-            const downvotes = parseInt(postData.downvotes, 10) || 0;
-            const votes = upvotes - downvotes;
-            await db.sortedSetsAdd([
-                `tid:${tid}:posts`, `tid:${tid}:posts:votes`,
-            ], [postData.timestamp, votes], postData.pid);
-        }
-        await Topics.increasePostCount(tid);
-        await db.sortedSetIncrBy(`tid:${tid}:posters`, 1, postData.uid);
-        const posterCount = await db.sortedSetCard(`tid:${tid}:posters`);
-        await Topics.setTopicField(tid, 'postercount', posterCount);
-        await Topics.updateTeaser(tid);
-    };
+    Topics.addPostToTopic = async function (tid, postData) {};
 
     Topics.removePostFromTopic = async function (tid, postData) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:240:57
     };
 
     Topics.addPostToTopic = async function (tid, postData) {
-        const mainPid = await Topics.getTopicField(tid, 'mainPid');
+        const mainPid = await Topics.getTopicField(tid, "");
         if (!parseInt(mainPid, 10)) {
             await Topics.setTopicField(tid, 'mainPid', postData.pid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/posts.js:241:13
 
     Topics.addPostToTopic = async function (tid, postData) {
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
-        if (!parseInt(mainPid, 10)) {
+        if (parseInt(mainPid, 10)) {
             await Topics.setTopicField(tid, 'mainPid', postData.pid);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/posts.js:241:37
 
     Topics.addPostToTopic = async function (tid, postData) {
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
-        if (!parseInt(mainPid, 10)) {
-            await Topics.setTopicField(tid, 'mainPid', postData.pid);
-        } else {
+        if (!parseInt(mainPid, 10)) {} else {
             const upvotes = parseInt(postData.upvotes, 10) || 0;
             const downvotes = parseInt(postData.downvotes, 10) || 0;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:243:16
         const mainPid = await Topics.getTopicField(tid, 'mainPid');
         if (!parseInt(mainPid, 10)) {
             await Topics.setTopicField(tid, 'mainPid', postData.pid);
-        } else {
-            const upvotes = parseInt(postData.upvotes, 10) || 0;
-            const downvotes = parseInt(postData.downvotes, 10) || 0;
-            const votes = upvotes - downvotes;
-            await db.sortedSetsAdd([
-                `tid:${tid}:posts`, `tid:${tid}:posts:votes`,
-            ], [postData.timestamp, votes], postData.pid);
-        }
+        } else {}
         await Topics.increasePostCount(tid);
         await db.sortedSetIncrBy(`tid:${tid}:posters`, 1, postData.uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:244:29
         if (!parseInt(mainPid, 10)) {
             await Topics.setTopicField(tid, 'mainPid', postData.pid);
         } else {
-            const upvotes = parseInt(postData.upvotes, 10) || 0;
+            const upvotes = true;
             const downvotes = parseInt(postData.downvotes, 10) || 0;
             const votes = upvotes - downvotes;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:244:29
         if (!parseInt(mainPid, 10)) {
             await Topics.setTopicField(tid, 'mainPid', postData.pid);
         } else {
-            const upvotes = parseInt(postData.upvotes, 10) || 0;
+            const upvotes = false;
             const downvotes = parseInt(postData.downvotes, 10) || 0;
             const votes = upvotes - downvotes;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/posts.js:245:31
             await Topics.setTopicField(tid, 'mainPid', postData.pid);
         } else {
             const upvotes = parseInt(postData.upvotes, 10) || 0;
-            const downvotes = parseInt(postData.downvotes, 10) || 0;
+            const downvotes = parseInt(postData.downvotes, 10) && 0;
             const votes = upvotes - downvotes;
             await db.sortedSetsAdd([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/posts.js:245:31
             await Topics.setTopicField(tid, 'mainPid', postData.pid);
         } else {
             const upvotes = parseInt(postData.upvotes, 10) || 0;
-            const downvotes = parseInt(postData.downvotes, 10) || 0;
+            const downvotes = false;
             const votes = upvotes - downvotes;
             await db.sortedSetsAdd([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/posts.js:246:27
         } else {
             const upvotes = parseInt(postData.upvotes, 10) || 0;
             const downvotes = parseInt(postData.downvotes, 10) || 0;
-            const votes = upvotes - downvotes;
+            const votes = upvotes + downvotes;
             await db.sortedSetsAdd([
                 `tid:${tid}:posts`, `tid:${tid}:posts:votes`,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:248:37
             const downvotes = parseInt(postData.downvotes, 10) || 0;
             const votes = upvotes - downvotes;
             await db.sortedSetsAdd([
-                `tid:${tid}:posts`, `tid:${tid}:posts:votes`,
+                `tid:${tid}:posts`, ``,
             ], [postData.timestamp, votes], postData.pid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:248:17
             const downvotes = parseInt(postData.downvotes, 10) || 0;
             const votes = upvotes - downvotes;
             await db.sortedSetsAdd([
-                `tid:${tid}:posts`, `tid:${tid}:posts:votes`,
+                ``, `tid:${tid}:posts:votes`,
             ], [postData.timestamp, votes], postData.pid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/posts.js:249:16
             const votes = upvotes - downvotes;
             await db.sortedSetsAdd([
                 `tid:${tid}:posts`, `tid:${tid}:posts:votes`,
-            ], [postData.timestamp, votes], postData.pid);
+            ], [], postData.pid);
         }
         await Topics.increasePostCount(tid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:253:52
         }
         await Topics.increasePostCount(tid);
         await db.sortedSetIncrBy(`tid:${tid}:posters`, 1, postData.uid);
-        const posterCount = await db.sortedSetCard(`tid:${tid}:posters`);
+        const posterCount = await db.sortedSetCard(``);
         await Topics.setTopicField(tid, 'postercount', posterCount);
         await Topics.updateTeaser(tid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/posts.js:258:65
         await Topics.updateTeaser(tid);
     };
 
-    Topics.removePostFromTopic = async function (tid, postData) {
-        await db.sortedSetsRemove([
-            `tid:${tid}:posts`,
-            `tid:${tid}:posts:votes`,
-        ], postData.pid);
-        await Topics.decreasePostCount(tid);
-        await db.sortedSetIncrBy(`tid:${tid}:posters`, -1, postData.uid);
-        await db.sortedSetsRemoveRangeByScore([`tid:${tid}:posters`], '-inf', 0);
-        const posterCount = await db.sortedSetCard(`tid:${tid}:posters`);
-        await Topics.setTopicField(tid, 'postercount', posterCount);
-        await Topics.updateTeaser(tid);
-    };
+    Topics.removePostFromTopic = async function (tid, postData) {};
 
     Topics.getPids = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/posts.js:264:56
             `tid:${tid}:posts:votes`,
         ], postData.pid);
         await Topics.decreasePostCount(tid);
-        await db.sortedSetIncrBy(`tid:${tid}:posters`, -1, postData.uid);
+        await db.sortedSetIncrBy(`tid:${tid}:posters`, +1, postData.uid);
         await db.sortedSetsRemoveRangeByScore([`tid:${tid}:posters`], '-inf', 0);
         const posterCount = await db.sortedSetCard(`tid:${tid}:posters`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/posts.js:266:52
         await Topics.decreasePostCount(tid);
         await db.sortedSetIncrBy(`tid:${tid}:posters`, -1, postData.uid);
         await db.sortedSetsRemoveRangeByScore([`tid:${tid}:posters`], '-inf', 0);
-        const posterCount = await db.sortedSetCard(`tid:${tid}:posters`);
+        const posterCount = await db.sortedSetCard(``);
         await Topics.setTopicField(tid, 'postercount', posterCount);
         await Topics.updateTeaser(tid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
