[Killed] ArrowFunction
src/topics/thumbs.js:124:39
     const absolutePaths = relativePaths.map(relativePath => path.join(nconf.get('upload_path'), relativePath));
     const [associated, existsOnDisk] = await Promise.all([
         db.isSortedSetMembers(set, relativePaths),
-        Promise.all(absolutePaths.map(async absolutePath => file.exists(absolutePath))),
+        Promise.all(absolutePaths.map(() => undefined)),
     ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/thumbs.js:128:22
     ]);
 
     const toRemove = [];
-    const toDelete = [];
+    const toDelete = ["Stryker was here"];
     relativePaths.forEach((relativePath, idx) => {
         if (associated[idx]) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:129:50
 
     const toRemove = [];
     const toDelete = [];
-    relativePaths.forEach((relativePath, idx) => {
-        if (associated[idx]) {
-            toRemove.push(relativePath);
-        }
-
-        if (existsOnDisk[idx]) {
-            toDelete.push(absolutePaths[idx]);
-        }
-    });
+    relativePaths.forEach((relativePath, idx) => {});
 
     await db.sortedSetRemove(set, toRemove);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:130:13
     const toRemove = [];
     const toDelete = [];
     relativePaths.forEach((relativePath, idx) => {
-        if (associated[idx]) {
+        if (true) {
             toRemove.push(relativePath);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/thumbs.js:130:13
     const toRemove = [];
     const toDelete = [];
     relativePaths.forEach((relativePath, idx) => {
-        if (associated[idx]) {
+        if (false) {
             toRemove.push(relativePath);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:134:13
             toRemove.push(relativePath);
         }
 
-        if (existsOnDisk[idx]) {
+        if (false) {
             toDelete.push(absolutePaths[idx]);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:134:32
             toRemove.push(relativePath);
         }
 
-        if (existsOnDisk[idx]) {
-            toDelete.push(absolutePaths[idx]);
-        }
+        if (existsOnDisk[idx]) {}
     });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/thumbs.js:141:9
 
     await db.sortedSetRemove(set, toRemove);
 
-    if (isDraft && toDelete.length) { // drafts only; post upload dissociation handles disk deletion for topics
+    if (true) { // drafts only; post upload dissociation handles disk deletion for topics
         await Promise.all(toDelete.map(async absolutePath => file.delete(absolutePath)));
     }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/thumbs.js:141:9
 
     await db.sortedSetRemove(set, toRemove);
 
-    if (isDraft && toDelete.length) { // drafts only; post upload dissociation handles disk deletion for topics
+    if (false) { // drafts only; post upload dissociation handles disk deletion for topics
         await Promise.all(toDelete.map(async absolutePath => file.delete(absolutePath)));
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Survived] ArrowFunction
src/topics/thumbs.js:142:40
     await db.sortedSetRemove(set, toRemove);
 
     if (isDraft && toDelete.length) { // drafts only; post upload dissociation handles disk deletion for topics
-        await Promise.all(toDelete.map(async absolutePath => file.delete(absolutePath)));
+        await Promise.all(toDelete.map(() => undefined));
     }
 

[Killed] BlockStatement
src/topics/thumbs.js:145:38
         await Promise.all(toDelete.map(async absolutePath => file.delete(absolutePath)));
     }
 
-    if (toRemove.length && !isDraft) {
-        const topics = require('.');
-        const mainPid = (await topics.getMainPids([id]))[0];
-
-        await Promise.all([
-            db.incrObjectFieldBy(`topic:${id}`, 'numThumbs', -toRemove.length),
-            Promise.all(toRemove.map(async relativePath => posts.uploads.dissociate(mainPid, relativePath.slice(1)))),
-        ]);
-    }
+    if (toRemove.length && !isDraft) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/thumbs.js:145:9
         await Promise.all(toDelete.map(async absolutePath => file.delete(absolutePath)));
     }
 
-    if (toRemove.length && !isDraft) {
+    if (toRemove.length || !isDraft) {
         const topics = require('.');
         const mainPid = (await topics.getMainPids([id]))[0];
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrayDeclaration
src/topics/thumbs.js:147:51
 
     if (toRemove.length && !isDraft) {
         const topics = require('.');
-        const mainPid = (await topics.getMainPids([id]))[0];
+        const mainPid = (await topics.getMainPids([]))[0];
 
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/thumbs.js:150:62
         const mainPid = (await topics.getMainPids([id]))[0];
 
         await Promise.all([
-            db.incrObjectFieldBy(`topic:${id}`, 'numThumbs', -toRemove.length),
+            db.incrObjectFieldBy(`topic:${id}`, 'numThumbs', +toRemove.length),
             Promise.all(toRemove.map(async relativePath => posts.uploads.dissociate(mainPid, relativePath.slice(1)))),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/thumbs.js:150:49
         const mainPid = (await topics.getMainPids([id]))[0];
 
         await Promise.all([
-            db.incrObjectFieldBy(`topic:${id}`, 'numThumbs', -toRemove.length),
+            db.incrObjectFieldBy(`topic:${id}`, "", -toRemove.length),
             Promise.all(toRemove.map(async relativePath => posts.uploads.dissociate(mainPid, relativePath.slice(1)))),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/thumbs.js:151:94
 
         await Promise.all([
             db.incrObjectFieldBy(`topic:${id}`, 'numThumbs', -toRemove.length),
-            Promise.all(toRemove.map(async relativePath => posts.uploads.dissociate(mainPid, relativePath.slice(1)))),
+            Promise.all(toRemove.map(async relativePath => posts.uploads.dissociate(mainPid, relativePath))),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/thumbs.js:151:38
 
         await Promise.all([
             db.incrObjectFieldBy(`topic:${id}`, 'numThumbs', -toRemove.length),
-            Promise.all(toRemove.map(async relativePath => posts.uploads.dissociate(mainPid, relativePath.slice(1)))),
+            Promise.all(toRemove.map(() => undefined)),
         ]);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/thumbs.js:156:34
     }
 };
 
-Thumbs.deleteAll = async (id) => {
-    const isDraft = validator.isUUID(String(id));
-    const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
-
-    const thumbs = await db.getSortedSetRange(set, 0, -1);
-    await Thumbs.delete(id, thumbs);
-};
+Thumbs.deleteAll = async (id) => {};
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/thumbs.js:160:55
     const isDraft = validator.isUUID(String(id));
     const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
 
-    const thumbs = await db.getSortedSetRange(set, 0, -1);
+    const thumbs = await db.getSortedSetRange(set, 0, +1);
     await Thumbs.delete(id, thumbs);
 };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing
