[Killed] BlockStatement
src/topics/posts.js:397:50
 
         // Add new backlinks
         await db.sortedSetAdd(`pid:${pid}:backlinks`, add.map(() => now), add);
-        await Promise.all(add.map(async (tid) => {
-            await Topics.events.log(tid, {
-                uid,
-                type: 'backlink',
-                href: `/post/${pid}`,
-            });
-        }));
+        await Promise.all(add.map(async (tid) => {}));
 
         return add.length + (current - remove);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/posts.js:398:42
         // Add new backlinks
         await db.sortedSetAdd(`pid:${pid}:backlinks`, add.map(() => now), add);
         await Promise.all(add.map(async (tid) => {
-            await Topics.events.log(tid, {
-                uid,
-                type: 'backlink',
-                href: `/post/${pid}`,
-            });
+            await Topics.events.log(tid, {});
         }));
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/posts.js:405:30
             });
         }));
 
-        return add.length + (current - remove);
+        return add.length + (current + remove);
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/posts.js:405:16
             });
         }));
 
-        return add.length + (current - remove);
+        return add.length - (current - remove);
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
