[Killed] BlockStatement
src/topics/sorted.js:14:54
 const plugins = require('../plugins');
 
 module.exports = function (Topics) {
-    Topics.getSortedTopics = async function (params) {
-        const data = {
-            nextStart: 0,
-            topicCount: 0,
-            topics: [],
-        };
-
-        params.term = params.term || 'alltime';
-        params.sort = params.sort || 'recent';
-        params.query = params.query || {};
-        if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
-            params.cids = [params.cids];
-        }
-        params.tags = params.tags || [];
-        if (params.tags && !Array.isArray(params.tags)) {
-            params.tags = [params.tags];
-        }
-        data.tids = await getTids(params);
-        data.tids = await sortTids(data.tids, params);
-        data.tids = await filterTids(data.tids.slice(0, meta.config.recentMaxTopics), params);
-        data.topicCount = data.tids.length;
-        data.topics = await getTopics(data.tids, params);
-        data.nextStart = params.stop + 1;
-        return data;
-    };
+    Topics.getSortedTopics = async function (params) {};
 
     async function getTids(params) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/sorted.js:15:22
 
 module.exports = function (Topics) {
     Topics.getSortedTopics = async function (params) {
-        const data = {
-            nextStart: 0,
-            topicCount: 0,
-            topics: [],
-        };
+        const data = {};
 
         params.term = params.term || 'alltime';
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/sorted.js:18:21
         const data = {
             nextStart: 0,
             topicCount: 0,
-            topics: [],
+            topics: ["Stryker was here"],
         };
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/sorted.js:21:23
             topics: [],
         };
 
-        params.term = params.term || 'alltime';
+        params.term = true;
         params.sort = params.sort || 'recent';
         params.query = params.query || {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:21:23
             topics: [],
         };
 
-        params.term = params.term || 'alltime';
+        params.term = params.term && 'alltime';
         params.sort = params.sort || 'recent';
         params.query = params.query || {};
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:22:23
         };
 
         params.term = params.term || 'alltime';
-        params.sort = params.sort || 'recent';
+        params.sort = false;
         params.query = params.query || {};
         if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:22:23
         };
 
         params.term = params.term || 'alltime';
-        params.sort = params.sort || 'recent';
+        params.sort = true;
         params.query = params.query || {};
         if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/sorted.js:23:24
 
         params.term = params.term || 'alltime';
         params.sort = params.sort || 'recent';
-        params.query = params.query || {};
+        params.query = false;
         if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
             params.cids = [params.cids];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:23:24
 
         params.term = params.term || 'alltime';
         params.sort = params.sort || 'recent';
-        params.query = params.query || {};
+        params.query = params.query && {};
         if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
             params.cids = [params.cids];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:24:13
         params.term = params.term || 'alltime';
         params.sort = params.sort || 'recent';
         params.query = params.query || {};
-        if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
+        if (params.hasOwnProperty('cids') && params.cids || !Array.isArray(params.cids)) {
             params.cids = [params.cids];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:24:13
         params.term = params.term || 'alltime';
         params.sort = params.sort || 'recent';
         params.query = params.query || {};
-        if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
+        if (true) {
             params.cids = [params.cids];
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/topics/sorted.js:27:23
         if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
             params.cids = [params.cids];
         }
-        params.tags = params.tags || [];
+        params.tags = params.tags && [];
         if (params.tags && !Array.isArray(params.tags)) {
             params.tags = [params.tags];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:27:23
         if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
             params.cids = [params.cids];
         }
-        params.tags = params.tags || [];
+        params.tags = false;
         if (params.tags && !Array.isArray(params.tags)) {
             params.tags = [params.tags];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:28:13
             params.cids = [params.cids];
         }
         params.tags = params.tags || [];
-        if (params.tags && !Array.isArray(params.tags)) {
+        if (params.tags || !Array.isArray(params.tags)) {
             params.tags = [params.tags];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:28:13
             params.cids = [params.cids];
         }
         params.tags = params.tags || [];
-        if (params.tags && !Array.isArray(params.tags)) {
+        if (true) {
             params.tags = [params.tags];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArrayDeclaration
src/topics/sorted.js:29:27
         }
         params.tags = params.tags || [];
         if (params.tags && !Array.isArray(params.tags)) {
-            params.tags = [params.tags];
+            params.tags = [];
         }
         data.tids = await getTids(params);

[Killed] MethodExpression
src/topics/sorted.js:33:38
         }
         data.tids = await getTids(params);
         data.tids = await sortTids(data.tids, params);
-        data.tids = await filterTids(data.tids.slice(0, meta.config.recentMaxTopics), params);
+        data.tids = await filterTids(data.tids, params);
         data.topicCount = data.tids.length;
         data.topics = await getTopics(data.tids, params);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/sorted.js:36:26
         data.tids = await filterTids(data.tids.slice(0, meta.config.recentMaxTopics), params);
         data.topicCount = data.tids.length;
         data.topics = await getTopics(data.tids, params);
-        data.nextStart = params.stop + 1;
+        data.nextStart = params.stop - 1;
         return data;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:40:36
         return data;
     };
 
-    async function getTids(params) {
-        if (plugins.hooks.hasListeners('filter:topics.getSortedTids')) {
-            const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
-            return result.tids;
-        }
-        let tids = [];
-        if (params.term !== 'alltime') {
-            tids = await Topics.getLatestTidsFromSet('topics:tid', 0, -1, params.term);
-            if (params.filter === 'watched') {
-                tids = await Topics.filterWatchedTids(tids, params.uid);
-            }
-        } else if (params.filter === 'watched') {
-            tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
-        } else if (params.cids) {
-            tids = await getCidTids(params);
-        } else if (params.tags.length) {
-            tids = await getTagTids(params);
-        } else if (params.sort === 'old') {
-            tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
-        } else {
-            tids = await db.getSortedSetRevRange(`topics:${params.sort}`, 0, meta.config.recentMaxTopics - 1);
-        }
-
-        return tids;
-    }
+    async function getTids(params) {}
 
     async function getTagTids(params) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:41:13
     };
 
     async function getTids(params) {
-        if (plugins.hooks.hasListeners('filter:topics.getSortedTids')) {
+        if (false) {
             const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
             return result.tids;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:41:13
     };
 
     async function getTids(params) {
-        if (plugins.hooks.hasListeners('filter:topics.getSortedTids')) {
+        if (true) {
             const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
             return result.tids;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArrayDeclaration
src/topics/sorted.js:42:108
 
     async function getTids(params) {
         if (plugins.hooks.hasListeners('filter:topics.getSortedTids')) {
-            const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
+            const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: ["Stryker was here"] });
             return result.tids;
         }

[NoCoverage] StringLiteral
src/topics/sorted.js:42:53
 
     async function getTids(params) {
         if (plugins.hooks.hasListeners('filter:topics.getSortedTids')) {
-            const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
+            const result = await plugins.hooks.fire("", { params: params, tids: [] });
             return result.tids;
         }

[Killed] ArrayDeclaration
src/topics/sorted.js:45:20
             const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
             return result.tids;
         }
-        let tids = [];
+        let tids = ["Stryker was here"];
         if (params.term !== 'alltime') {
             tids = await Topics.getLatestTidsFromSet('topics:tid', 0, -1, params.term);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:46:40
             return result.tids;
         }
         let tids = [];
-        if (params.term !== 'alltime') {
-            tids = await Topics.getLatestTidsFromSet('topics:tid', 0, -1, params.term);
-            if (params.filter === 'watched') {
-                tids = await Topics.filterWatchedTids(tids, params.uid);
-            }
-        } else if (params.filter === 'watched') {
+        if (params.term !== 'alltime') {} else if (params.filter === 'watched') {
             tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
         } else if (params.cids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/sorted.js:46:13
             return result.tids;
         }
         let tids = [];
-        if (params.term !== 'alltime') {
+        if (params.term === 'alltime') {
             tids = await Topics.getLatestTidsFromSet('topics:tid', 0, -1, params.term);
             if (params.filter === 'watched') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/sorted.js:47:71
         }
         let tids = [];
         if (params.term !== 'alltime') {
-            tids = await Topics.getLatestTidsFromSet('topics:tid', 0, -1, params.term);
+            tids = await Topics.getLatestTidsFromSet('topics:tid', 0, +1, params.term);
             if (params.filter === 'watched') {
                 tids = await Topics.filterWatchedTids(tids, params.uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:48:17
         let tids = [];
         if (params.term !== 'alltime') {
             tids = await Topics.getLatestTidsFromSet('topics:tid', 0, -1, params.term);
-            if (params.filter === 'watched') {
+            if (true) {
                 tids = await Topics.filterWatchedTids(tids, params.uid);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/sorted.js:48:17
         let tids = [];
         if (params.term !== 'alltime') {
             tids = await Topics.getLatestTidsFromSet('topics:tid', 0, -1, params.term);
-            if (params.filter === 'watched') {
+            if (params.filter !== 'watched') {
                 tids = await Topics.filterWatchedTids(tids, params.uid);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:51:20
             if (params.filter === 'watched') {
                 tids = await Topics.filterWatchedTids(tids, params.uid);
             }
-        } else if (params.filter === 'watched') {
+        } else if (false) {
             tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
         } else if (params.cids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/sorted.js:51:20
             if (params.filter === 'watched') {
                 tids = await Topics.filterWatchedTids(tids, params.uid);
             }
-        } else if (params.filter === 'watched') {
+        } else if (params.filter !== 'watched') {
             tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
         } else if (params.cids) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] UnaryOperator
src/topics/sorted.js:52:88
                 tids = await Topics.filterWatchedTids(tids, params.uid);
             }
         } else if (params.filter === 'watched') {
-            tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
+            tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, +1);
         } else if (params.cids) {
             tids = await getCidTids(params);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/sorted.js:52:50
                 tids = await Topics.filterWatchedTids(tids, params.uid);
             }
         } else if (params.filter === 'watched') {
-            tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
+            tids = await db.getSortedSetRevRange(``, 0, -1);
         } else if (params.cids) {
             tids = await getCidTids(params);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:53:20
             }
         } else if (params.filter === 'watched') {
             tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
-        } else if (params.cids) {
+        } else if (true) {
             tids = await getCidTids(params);
         } else if (params.tags.length) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/sorted.js:53:20
             }
         } else if (params.filter === 'watched') {
             tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
-        } else if (params.cids) {
+        } else if (false) {
             tids = await getCidTids(params);
         } else if (params.tags.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:55:20
             tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
         } else if (params.cids) {
             tids = await getCidTids(params);
-        } else if (params.tags.length) {
+        } else if (false) {
             tids = await getTagTids(params);
         } else if (params.sort === 'old') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:55:20
             tids = await db.getSortedSetRevRange(`uid:${params.uid}:followed_tids`, 0, -1);
         } else if (params.cids) {
             tids = await getCidTids(params);
-        } else if (params.tags.length) {
+        } else if (true) {
             tids = await getTagTids(params);
         } else if (params.sort === 'old') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/sorted.js:57:20
             tids = await getCidTids(params);
         } else if (params.tags.length) {
             tids = await getTagTids(params);
-        } else if (params.sort === 'old') {
+        } else if (params.sort !== 'old') {
             tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:57:20
             tids = await getCidTids(params);
         } else if (params.tags.length) {
             tids = await getTagTids(params);
-        } else if (params.sort === 'old') {
+        } else if (false) {
             tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:58:67
         } else if (params.tags.length) {
             tids = await getTagTids(params);
         } else if (params.sort === 'old') {
-            tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
+            tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics + 1);
         } else {
             tids = await db.getSortedSetRevRange(`topics:${params.sort}`, 0, meta.config.recentMaxTopics - 1);

[Killed] BlockStatement
src/topics/sorted.js:59:16
             tids = await getTagTids(params);
         } else if (params.sort === 'old') {
             tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
-        } else {
-            tids = await db.getSortedSetRevRange(`topics:${params.sort}`, 0, meta.config.recentMaxTopics - 1);
-        }
+        } else {}
 
         return tids;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/sorted.js:60:78
         } else if (params.sort === 'old') {
             tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
         } else {
-            tids = await db.getSortedSetRevRange(`topics:${params.sort}`, 0, meta.config.recentMaxTopics - 1);
+            tids = await db.getSortedSetRevRange(`topics:${params.sort}`, 0, meta.config.recentMaxTopics + 1);
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/sorted.js:66:39
         return tids;
     }
 
-    async function getTagTids(params) {
-        const sets = [
-            params.sort === 'old' ?
-                'topics:recent' :
-                `topics:${params.sort}`,
-            ...params.tags.map(tag => `tag:${tag}:topics`),
-        ];
-        const method = params.sort === 'old' ?
-            'getSortedSetIntersect' :
-            'getSortedSetRevIntersect';
-        return await db[method]({
-            sets: sets,
-            start: 0,
-            stop: meta.config.recentMaxTopics - 1,
-            weights: sets.map((s, index) => (index ? 0 : 1)),
-        });
-    }
+    async function getTagTids(params) {}
 
     async function getCidTids(params) {

[NoCoverage] EqualityOperator
src/topics/sorted.js:68:13
 
     async function getTagTids(params) {
         const sets = [
-            params.sort === 'old' ?
+            params.sort !== 'old' ?
                 'topics:recent' :
                 `topics:${params.sort}`,

[NoCoverage] ConditionalExpression
src/topics/sorted.js:68:13
 
     async function getTagTids(params) {
         const sets = [
-            params.sort === 'old' ?
+            true ?
                 'topics:recent' :
                 `topics:${params.sort}`,

[NoCoverage] ArrowFunction
src/topics/sorted.js:71:32
             params.sort === 'old' ?
                 'topics:recent' :
                 `topics:${params.sort}`,
-            ...params.tags.map(tag => `tag:${tag}:topics`),
+            ...params.tags.map(() => undefined),
         ];
         const method = params.sort === 'old' ?

[NoCoverage] EqualityOperator
src/topics/sorted.js:73:24
                 `topics:${params.sort}`,
             ...params.tags.map(tag => `tag:${tag}:topics`),
         ];
-        const method = params.sort === 'old' ?
+        const method = params.sort !== 'old' ?
             'getSortedSetIntersect' :
             'getSortedSetRevIntersect';

[NoCoverage] ConditionalExpression
src/topics/sorted.js:73:24
                 `topics:${params.sort}`,
             ...params.tags.map(tag => `tag:${tag}:topics`),
         ];
-        const method = params.sort === 'old' ?
+        const method = false ?
             'getSortedSetIntersect' :
             'getSortedSetRevIntersect';

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:79:19
         return await db[method]({
             sets: sets,
             start: 0,
-            stop: meta.config.recentMaxTopics - 1,
+            stop: meta.config.recentMaxTopics + 1,
             weights: sets.map((s, index) => (index ? 0 : 1)),
         });

[NoCoverage] ArrowFunction
src/topics/sorted.js:80:31
             sets: sets,
             start: 0,
             stop: meta.config.recentMaxTopics - 1,
-            weights: sets.map((s, index) => (index ? 0 : 1)),
+            weights: sets.map(() => undefined),
         });
     }

[Killed] ConditionalExpression
src/topics/sorted.js:85:13
     }
 
     async function getCidTids(params) {
-        if (params.tags.length) {
+        if (false) {
             return _.intersection(...await Promise.all(params.tags.map(async (tag) => {
                 const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:85:13
     }
 
     async function getCidTids(params) {
-        if (params.tags.length) {
+        if (true) {
             return _.intersection(...await Promise.all(params.tags.map(async (tag) => {
                 const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[NoCoverage] BlockStatement
src/topics/sorted.js:86:87
 
     async function getCidTids(params) {
         if (params.tags.length) {
-            return _.intersection(...await Promise.all(params.tags.map(async (tag) => {
-                const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
-                return await db.getSortedSetRevRange(sets, 0, -1);
-            })));
+            return _.intersection(...await Promise.all(params.tags.map(async (tag) => {})));
         }
 

[NoCoverage] ArrowFunction
src/topics/sorted.js:87:46
     async function getCidTids(params) {
         if (params.tags.length) {
             return _.intersection(...await Promise.all(params.tags.map(async (tag) => {
-                const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
+                const sets = params.cids.map(() => undefined);
                 return await db.getSortedSetRevRange(sets, 0, -1);
             })));

[NoCoverage] UnaryOperator
src/topics/sorted.js:88:63
         if (params.tags.length) {
             return _.intersection(...await Promise.all(params.tags.map(async (tag) => {
                 const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
-                return await db.getSortedSetRevRange(sets, 0, -1);
+                return await db.getSortedSetRevRange(sets, 0, +1);
             })));
         }

[Killed] BlockStatement
src/topics/sorted.js:94:38
 
         const sets = [];
         const pinnedSets = [];
-        params.cids.forEach((cid) => {
-            if (params.sort === 'recent' || params.sort === 'old') {
-                sets.push(`cid:${cid}:tids`);
-            } else {
-                sets.push(`cid:${cid}:tids${params.sort ? `:${params.sort}` : ''}`);
-            }
-            pinnedSets.push(`cid:${cid}:tids:pinned`);
-        });
+        params.cids.forEach((cid) => {});
         let pinnedTids = await db.getSortedSetRevRange(pinnedSets, 0, -1);
         pinnedTids = await Topics.tools.checkPinExpiry(pinnedTids);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/sorted.js:95:17
         const sets = [];
         const pinnedSets = [];
         params.cids.forEach((cid) => {
-            if (params.sort === 'recent' || params.sort === 'old') {
+            if (params.sort !== 'recent' || params.sort === 'old') {
                 sets.push(`cid:${cid}:tids`);
             } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:95:68
         const sets = [];
         const pinnedSets = [];
         params.cids.forEach((cid) => {
-            if (params.sort === 'recent' || params.sort === 'old') {
-                sets.push(`cid:${cid}:tids`);
-            } else {
+            if (params.sort === 'recent' || params.sort === 'old') {} else {
                 sets.push(`cid:${cid}:tids${params.sort ? `:${params.sort}` : ''}`);
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing
