[Killed] BlockStatement
src/topics/user.js:5:36
 
 const db = require('../database');
 
-module.exports = function (Topics) {
-    Topics.isOwner = async function (tid, uid) {
-        uid = parseInt(uid, 10);
-        if (uid <= 0) {
-            return false;
-        }
-        const author = await Topics.getTopicField(tid, 'uid');
-        return author === uid;
-    };
-
-    Topics.getUids = async function (tid) {
-        return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, '+inf', 1);
-    };
-};
+module.exports = function (Topics) {};
 
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567

[Killed] BlockStatement
src/topics/user.js:6:48
 const db = require('../database');
 
 module.exports = function (Topics) {
-    Topics.isOwner = async function (tid, uid) {
-        uid = parseInt(uid, 10);
-        if (uid <= 0) {
-            return false;
-        }
-        const author = await Topics.getTopicField(tid, 'uid');
-        return author === uid;
-    };
+    Topics.isOwner = async function (tid, uid) {};
 
     Topics.getUids = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/user.js:8:13
 module.exports = function (Topics) {
     Topics.isOwner = async function (tid, uid) {
         uid = parseInt(uid, 10);
-        if (uid <= 0) {
+        if (uid > 0) {
             return false;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/user.js:8:13
 module.exports = function (Topics) {
     Topics.isOwner = async function (tid, uid) {
         uid = parseInt(uid, 10);
-        if (uid <= 0) {
+        if (false) {
             return false;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/user.js:9:20
     Topics.isOwner = async function (tid, uid) {
         uid = parseInt(uid, 10);
         if (uid <= 0) {
-            return false;
+            return true;
         }
         const author = await Topics.getTopicField(tid, 'uid');
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/user.js:11:56
         if (uid <= 0) {
             return false;
         }
-        const author = await Topics.getTopicField(tid, 'uid');
+        const author = await Topics.getTopicField(tid, "");
         return author === uid;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/user.js:12:16
             return false;
         }
         const author = await Topics.getTopicField(tid, 'uid');
-        return author === uid;
+        return true;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/user.js:12:16
             return false;
         }
         const author = await Topics.getTopicField(tid, 'uid');
-        return author === uid;
+        return author !== uid;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/user.js:15:43
         return author === uid;
     };
 
-    Topics.getUids = async function (tid) {
-        return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, '+inf', 1);
-    };
+    Topics.getUids = async function (tid) {};
 };
 

[NoCoverage] UnaryOperator
src/topics/user.js:16:78
     };
 
     Topics.getUids = async function (tid) {
-        return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, '+inf', 1);
+        return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, +1, '+inf', 1);
     };
 };

[NoCoverage] StringLiteral
src/topics/user.js:16:82
     };
 
     Topics.getUids = async function (tid) {
-        return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, '+inf', 1);
+        return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, "", 1);
     };
 };
