[Killed] EqualityOperator
src/topics/bookmarks.js:11:13
 
 module.exports = function (Topics) {
     Topics.getUserBookmark = async function (tid, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (parseInt(uid, 10) < 0) {
             return null;
         }
killedBy: should correctly compare a password and a hash
statusReason: listen EADDRINUSE: address already in use 0.0.0.0:4567
