[Killed] StringLiteral
src/topics/sorted.js:96:27
         const pinnedSets = [];
         params.cids.forEach((cid) => {
             if (params.sort === 'recent' || params.sort === 'old') {
-                sets.push(`cid:${cid}:tids`);
+                sets.push(``);
             } else {
                 sets.push(`cid:${cid}:tids${params.sort ? `:${params.sort}` : ''}`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:97:20
         params.cids.forEach((cid) => {
             if (params.sort === 'recent' || params.sort === 'old') {
                 sets.push(`cid:${cid}:tids`);
-            } else {
-                sets.push(`cid:${cid}:tids${params.sort ? `:${params.sort}` : ''}`);
-            }
+            } else {}
             pinnedSets.push(`cid:${cid}:tids:pinned`);
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/sorted.js:98:59
             if (params.sort === 'recent' || params.sort === 'old') {
                 sets.push(`cid:${cid}:tids`);
             } else {
-                sets.push(`cid:${cid}:tids${params.sort ? `:${params.sort}` : ''}`);
+                sets.push(`cid:${cid}:tids${params.sort ? `` : ''}`);
             }
             pinnedSets.push(`cid:${cid}:tids:pinned`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/sorted.js:102:71
             }
             pinnedSets.push(`cid:${cid}:tids:pinned`);
         });
-        let pinnedTids = await db.getSortedSetRevRange(pinnedSets, 0, -1);
+        let pinnedTids = await db.getSortedSetRevRange(pinnedSets, 0, +1);
         pinnedTids = await Topics.tools.checkPinExpiry(pinnedTids);
         const method = params.sort === 'old' ?
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:104:24
         });
         let pinnedTids = await db.getSortedSetRevRange(pinnedSets, 0, -1);
         pinnedTids = await Topics.tools.checkPinExpiry(pinnedTids);
-        const method = params.sort === 'old' ?
+        const method = false ?
             'getSortedSetRange' :
             'getSortedSetRevRange';
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:104:24
         });
         let pinnedTids = await db.getSortedSetRevRange(pinnedSets, 0, -1);
         pinnedTids = await Topics.tools.checkPinExpiry(pinnedTids);
-        const method = params.sort === 'old' ?
+        const method = true ?
             'getSortedSetRange' :
             'getSortedSetRevRange';
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/sorted.js:107:48
         const method = params.sort === 'old' ?
             'getSortedSetRange' :
             'getSortedSetRevRange';
-        const tids = await db[method](sets, 0, meta.config.recentMaxTopics - 1);
+        const tids = await db[method](sets, 0, meta.config.recentMaxTopics + 1);
         return pinnedTids.concat(tids);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:111:43
         return pinnedTids.concat(tids);
     }
 
-    async function sortTids(tids, params) {
-        if (params.term === 'alltime' && !params.cids && !params.tags.length && params.filter !== 'watched' && !params.floatPinned) {
-            return tids;
-        }
-        const topicData = await Topics.getTopicsFields(tids, ['tid', 'lastposttime', 'upvotes', 'downvotes', 'postcount', 'pinned']);
-        const sortMap = {
-            recent: sortRecent,
-            old: sortOld,
-            posts: sortPopular,
-            votes: sortVotes,
-            views: sortViews,
-        };
-        const sortFn = sortMap[params.sort] || sortRecent;
-
-        if (params.floatPinned) {
-            floatPinned(topicData, sortFn);
-        } else {
-            topicData.sort(sortFn);
-        }
-
-        return topicData.map(topic => topic && topic.tid);
-    }
+    async function sortTids(tids, params) {}
 
     function floatPinned(topicData, sortFn) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/sorted.js:112:42
     }
 
     async function sortTids(tids, params) {
-        if (params.term === 'alltime' && !params.cids && !params.tags.length && params.filter !== 'watched' && !params.floatPinned) {
+        if (params.term === 'alltime' && params.cids && !params.tags.length && params.filter !== 'watched' && !params.floatPinned) {
             return tids;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:112:13
     }
 
     async function sortTids(tids, params) {
-        if (params.term === 'alltime' && !params.cids && !params.tags.length && params.filter !== 'watched' && !params.floatPinned) {
+        if (params.term === 'alltime' || !params.cids && !params.tags.length && params.filter !== 'watched' && !params.floatPinned) {
             return tids;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/sorted.js:115:70
         if (params.term === 'alltime' && !params.cids && !params.tags.length && params.filter !== 'watched' && !params.floatPinned) {
             return tids;
         }
-        const topicData = await Topics.getTopicsFields(tids, ['tid', 'lastposttime', 'upvotes', 'downvotes', 'postcount', 'pinned']);
+        const topicData = await Topics.getTopicsFields(tids, ['tid', "", 'upvotes', 'downvotes', 'postcount', 'pinned']);
         const sortMap = {
             recent: sortRecent,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/sorted.js:115:123
         if (params.term === 'alltime' && !params.cids && !params.tags.length && params.filter !== 'watched' && !params.floatPinned) {
             return tids;
         }
-        const topicData = await Topics.getTopicsFields(tids, ['tid', 'lastposttime', 'upvotes', 'downvotes', 'postcount', 'pinned']);
+        const topicData = await Topics.getTopicsFields(tids, ['tid', 'lastposttime', 'upvotes', 'downvotes', 'postcount', ""]);
         const sortMap = {
             recent: sortRecent,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:123:24
             votes: sortVotes,
             views: sortViews,
         };
-        const sortFn = sortMap[params.sort] || sortRecent;
+        const sortFn = false;
 
         if (params.floatPinned) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:123:24
             votes: sortVotes,
             views: sortViews,
         };
-        const sortFn = sortMap[params.sort] || sortRecent;
+        const sortFn = sortMap[params.sort] && sortRecent;
 
         if (params.floatPinned) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/sorted.js:125:13
         };
         const sortFn = sortMap[params.sort] || sortRecent;
 
-        if (params.floatPinned) {
+        if (true) {
             floatPinned(topicData, sortFn);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:125:13
         };
         const sortFn = sortMap[params.sort] || sortRecent;
 
-        if (params.floatPinned) {
+        if (false) {
             floatPinned(topicData, sortFn);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:127:16
 
         if (params.floatPinned) {
             floatPinned(topicData, sortFn);
-        } else {
-            topicData.sort(sortFn);
-        }
+        } else {}
 
         return topicData.map(topic => topic && topic.tid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/sorted.js:128:13
         if (params.floatPinned) {
             floatPinned(topicData, sortFn);
         } else {
-            topicData.sort(sortFn);
+            topicData;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:131:39
             topicData.sort(sortFn);
         }
 
-        return topicData.map(topic => topic && topic.tid);
+        return topicData.map(topic => true);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:131:39
             topicData.sort(sortFn);
         }
 
-        return topicData.map(topic => topic && topic.tid);
+        return topicData.map(topic => topic || topic.tid);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/sorted.js:134:45
         return topicData.map(topic => topic && topic.tid);
     }
 
-    function floatPinned(topicData, sortFn) {
-        topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
-    }
+    function floatPinned(topicData, sortFn) {}
 
     function sortRecent(a, b) {

[NoCoverage] EqualityOperator
src/topics/sorted.js:135:35
     }
 
     function floatPinned(topicData, sortFn) {
-        topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
+        topicData.sort((a, b) => (a.pinned === b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
     }
 

[NoCoverage] MethodExpression
src/topics/sorted.js:135:9
     }
 
     function floatPinned(topicData, sortFn) {
-        topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
+        topicData;
     }
 

[Killed] BlockStatement
src/topics/sorted.js:138:31
         topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
     }
 
-    function sortRecent(a, b) {
-        return b.lastposttime - a.lastposttime;
-    }
+    function sortRecent(a, b) {}
 
     function sortOld(a, b) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArithmeticOperator
src/topics/sorted.js:139:16
     }
 
     function sortRecent(a, b) {
-        return b.lastposttime - a.lastposttime;
+        return b.lastposttime + a.lastposttime;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:142:28
         return b.lastposttime - a.lastposttime;
     }
 
-    function sortOld(a, b) {
-        return a.lastposttime - b.lastposttime;
-    }
+    function sortOld(a, b) {}
 
     function sortVotes(a, b) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/sorted.js:143:16
     }
 
     function sortOld(a, b) {
-        return a.lastposttime - b.lastposttime;
+        return a.lastposttime + b.lastposttime;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:146:30
         return a.lastposttime - b.lastposttime;
     }
 
-    function sortVotes(a, b) {
-        if (a.votes !== b.votes) {
-            return b.votes - a.votes;
-        }
-        return b.postcount - a.postcount;
-    }
+    function sortVotes(a, b) {}
 
     function sortPopular(a, b) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:147:34
     }
 
     function sortVotes(a, b) {
-        if (a.votes !== b.votes) {
-            return b.votes - a.votes;
-        }
+        if (a.votes !== b.votes) {}
         return b.postcount - a.postcount;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:147:13
     }
 
     function sortVotes(a, b) {
-        if (a.votes !== b.votes) {
+        if (false) {
             return b.votes - a.votes;
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArithmeticOperator
src/topics/sorted.js:148:20
 
     function sortVotes(a, b) {
         if (a.votes !== b.votes) {
-            return b.votes - a.votes;
+            return b.votes + a.votes;
         }
         return b.postcount - a.postcount;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/sorted.js:150:16
         if (a.votes !== b.votes) {
             return b.votes - a.votes;
         }
-        return b.postcount - a.postcount;
+        return b.postcount + a.postcount;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/sorted.js:153:32
         return b.postcount - a.postcount;
     }
 
-    function sortPopular(a, b) {
-        if (a.postcount !== b.postcount) {
-            return b.postcount - a.postcount;
-        }
-        return b.viewcount - a.viewcount;
-    }
+    function sortPopular(a, b) {}
 
     function sortViews(a, b) {

[NoCoverage] ConditionalExpression
src/topics/sorted.js:154:13
     }
 
     function sortPopular(a, b) {
-        if (a.postcount !== b.postcount) {
+        if (false) {
             return b.postcount - a.postcount;
         }

[NoCoverage] EqualityOperator
src/topics/sorted.js:154:13
     }
 
     function sortPopular(a, b) {
-        if (a.postcount !== b.postcount) {
+        if (a.postcount === b.postcount) {
             return b.postcount - a.postcount;
         }

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:155:20
 
     function sortPopular(a, b) {
         if (a.postcount !== b.postcount) {
-            return b.postcount - a.postcount;
+            return b.postcount + a.postcount;
         }
         return b.viewcount - a.viewcount;

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:157:16
         if (a.postcount !== b.postcount) {
             return b.postcount - a.postcount;
         }
-        return b.viewcount - a.viewcount;
+        return b.viewcount + a.viewcount;
     }
 

[NoCoverage] BlockStatement
src/topics/sorted.js:160:30
         return b.viewcount - a.viewcount;
     }
 
-    function sortViews(a, b) {
-        return b.viewcount - a.viewcount;
-    }
+    function sortViews(a, b) {}
 
     async function filterTids(tids, params) {

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:161:16
     }
 
     function sortViews(a, b) {
-        return b.viewcount - a.viewcount;
+        return b.viewcount + a.viewcount;
     }
 

[Killed] BlockStatement
src/topics/sorted.js:168:31
         const { filter } = params;
         const { uid } = params;
 
-        if (filter === 'new') {
-            tids = await Topics.filterNewTids(tids, uid);
-        } else if (filter === 'unreplied') {
+        if (filter === 'new') {} else if (filter === 'unreplied') {
             tids = await Topics.filterUnrepliedTids(tids);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:168:13
         const { filter } = params;
         const { uid } = params;
 
-        if (filter === 'new') {
+        if (true) {
             tids = await Topics.filterNewTids(tids, uid);
         } else if (filter === 'unreplied') {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:170:44
 
         if (filter === 'new') {
             tids = await Topics.filterNewTids(tids, uid);
-        } else if (filter === 'unreplied') {
-            tids = await Topics.filterUnrepliedTids(tids);
-        } else {
+        } else if (filter === 'unreplied') {} else {
             tids = await Topics.filterNotIgnoredTids(tids, uid);
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] EqualityOperator
src/topics/sorted.js:170:20
 
         if (filter === 'new') {
             tids = await Topics.filterNewTids(tids, uid);
-        } else if (filter === 'unreplied') {
+        } else if (filter !== 'unreplied') {
             tids = await Topics.filterUnrepliedTids(tids);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:172:16
             tids = await Topics.filterNewTids(tids, uid);
         } else if (filter === 'unreplied') {
             tids = await Topics.filterUnrepliedTids(tids);
-        } else {
-            tids = await Topics.filterNotIgnoredTids(tids, uid);
-        }
+        } else {}
 
         tids = await privileges.topics.filterTids('topics:read', tids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/sorted.js:177:68
         }
 
         tids = await privileges.topics.filterTids('topics:read', tids, uid);
-        let topicData = await Topics.getTopicsFields(tids, ['uid', 'tid', 'cid']);
+        let topicData = await Topics.getTopicsFields(tids, ['uid', "", 'cid']);
         const topicCids = _.uniq(topicData.map(topic => topic.cid)).filter(Boolean);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/sorted.js:178:27
 
         tids = await privileges.topics.filterTids('topics:read', tids, uid);
         let topicData = await Topics.getTopicsFields(tids, ['uid', 'tid', 'cid']);
-        const topicCids = _.uniq(topicData.map(topic => topic.cid)).filter(Boolean);
+        const topicCids = _.uniq(topicData.map(topic => topic.cid));
 
         async function getIgnoredCids() {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/sorted.js:178:48
 
         tids = await privileges.topics.filterTids('topics:read', tids, uid);
         let topicData = await Topics.getTopicsFields(tids, ['uid', 'tid', 'cid']);
-        const topicCids = _.uniq(topicData.map(topic => topic.cid)).filter(Boolean);
+        const topicCids = _.uniq(topicData.map(() => undefined)).filter(Boolean);
 
         async function getIgnoredCids() {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:180:41
         let topicData = await Topics.getTopicsFields(tids, ['uid', 'tid', 'cid']);
         const topicCids = _.uniq(topicData.map(topic => topic.cid)).filter(Boolean);
 
-        async function getIgnoredCids() {
-            if (params.cids || filter === 'watched' || meta.config.disableRecentCategoryFilter) {
-                return [];
-            }
-            return await categories.isIgnored(topicCids, uid);
-        }
+        async function getIgnoredCids() {}
         const [ignoredCids, filtered] = await Promise.all([
             getIgnoredCids(),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:181:17
         const topicCids = _.uniq(topicData.map(topic => topic.cid)).filter(Boolean);
 
         async function getIgnoredCids() {
-            if (params.cids || filter === 'watched' || meta.config.disableRecentCategoryFilter) {
+            if (true) {
                 return [];
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:181:17
         const topicCids = _.uniq(topicData.map(topic => topic.cid)).filter(Boolean);
 
         async function getIgnoredCids() {
-            if (params.cids || filter === 'watched' || meta.config.disableRecentCategoryFilter) {
+            if ((params.cids || filter === 'watched') && meta.config.disableRecentCategoryFilter) {
                 return [];
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/sorted.js:186:59
             }
             return await categories.isIgnored(topicCids, uid);
         }
-        const [ignoredCids, filtered] = await Promise.all([
-            getIgnoredCids(),
-            user.blocks.filter(uid, topicData),
-        ]);
+        const [ignoredCids, filtered] = await Promise.all([]);
 
         const isCidIgnored = _.zipObject(topicCids, ignoredCids);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] MethodExpression
src/topics/sorted.js:188:13
         }
         const [ignoredCids, filtered] = await Promise.all([
             getIgnoredCids(),
-            user.blocks.filter(uid, topicData),
+            user.blocks,
         ]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:194:22
         const isCidIgnored = _.zipObject(topicCids, ignoredCids);
         topicData = filtered;
 
-        const cids = params.cids && params.cids.map(String);
+        const cids = false;
         tids = topicData.filter(t => (
             t &&
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:194:22
         const isCidIgnored = _.zipObject(topicCids, ignoredCids);
         topicData = filtered;
 
-        const cids = params.cids && params.cids.map(String);
+        const cids = true;
         tids = topicData.filter(t => (
             t &&
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/sorted.js:195:16
         topicData = filtered;
 
         const cids = params.cids && params.cids.map(String);
-        tids = topicData.filter(t => (
-            t &&
-            t.cid &&
-            !isCidIgnored[t.cid] &&
-            (!cids || cids.includes(String(t.cid)))
-        )).map(t => t.tid);
+        tids = topicData.map(t => t.tid);
 
         const result = await plugins.hooks.fire('filter:topics.filterSortedTids', { tids: tids, params: params });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/sorted.js:195:33
         topicData = filtered;
 
         const cids = params.cids && params.cids.map(String);
-        tids = topicData.filter(t => (
-            t &&
-            t.cid &&
-            !isCidIgnored[t.cid] &&
-            (!cids || cids.includes(String(t.cid)))
-        )).map(t => t.tid);
+        tids = topicData.filter(() => undefined).map(t => t.tid);
 
         const result = await plugins.hooks.fire('filter:topics.filterSortedTids', { tids: tids, params: params });
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] LogicalOperator
src/topics/sorted.js:196:13
 
         const cids = params.cids && params.cids.map(String);
         tids = topicData.filter(t => (
-            t &&
-            t.cid &&
+            t || t.cid &&
             !isCidIgnored[t.cid] &&
             (!cids || cids.includes(String(t.cid)))
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:196:13
 
         const cids = params.cids && params.cids.map(String);
         tids = topicData.filter(t => (
-            t &&
-            t.cid &&
-            !isCidIgnored[t.cid] &&
-            (!cids || cids.includes(String(t.cid)))
+            t && t.cid && !isCidIgnored[t.cid] || !cids || cids.includes(String(t.cid))
         )).map(t => t.tid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/sorted.js:198:13
         tids = topicData.filter(t => (
             t &&
             t.cid &&
-            !isCidIgnored[t.cid] &&
+            isCidIgnored[t.cid] &&
             (!cids || cids.includes(String(t.cid)))
         )).map(t => t.tid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/sorted.js:199:14
             t &&
             t.cid &&
             !isCidIgnored[t.cid] &&
-            (!cids || cids.includes(String(t.cid)))
+            (true)
         )).map(t => t.tid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/sorted.js:199:14
             t &&
             t.cid &&
             !isCidIgnored[t.cid] &&
-            (!cids || cids.includes(String(t.cid)))
+            (!cids && cids.includes(String(t.cid)))
         )).map(t => t.tid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/sorted.js:200:16
             t.cid &&
             !isCidIgnored[t.cid] &&
             (!cids || cids.includes(String(t.cid)))
-        )).map(t => t.tid);
+        )).map(() => undefined);
 
         const result = await plugins.hooks.fire('filter:topics.filterSortedTids', { tids: tids, params: params });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/sorted.js:206:44
         return result.tids;
     }
 
-    async function getTopics(tids, params) {
-        tids = tids.slice(params.start, params.stop !== -1 ? params.stop + 1 : undefined);
-        const topicData = await Topics.getTopicsByTids(tids, params);
-        Topics.calculateTopicIndices(topicData, params.start);
-        return topicData;
-    }
+    async function getTopics(tids, params) {}
 
     Topics.calculateTopicIndices = function (topicData, start) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/sorted.js:207:62
     }
 
     async function getTopics(tids, params) {
-        tids = tids.slice(params.start, params.stop !== -1 ? params.stop + 1 : undefined);
+        tids = tids.slice(params.start, params.stop !== -1 ? params.stop - 1 : undefined);
         const topicData = await Topics.getTopicsByTids(tids, params);
         Topics.calculateTopicIndices(topicData, params.start);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/sorted.js:207:16
     }
 
     async function getTopics(tids, params) {
-        tids = tids.slice(params.start, params.stop !== -1 ? params.stop + 1 : undefined);
+        tids = tids;
         const topicData = await Topics.getTopicsByTids(tids, params);
         Topics.calculateTopicIndices(topicData, params.start);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
