[Killed] BlockStatement
src/topics/suggested.js:12:84
 const search = require('../search');
 
 module.exports = function (Topics) {
-    Topics.getSuggestedTopics = async function (tid, uid, start, stop, cutoff = 0) {
-        let tids;
-        tid = parseInt(tid, 10);
-        cutoff = cutoff === 0 ? cutoff : (cutoff * 2592000000);
-        const [tagTids, searchTids] = await Promise.all([
-            getTidsWithSameTags(tid, cutoff),
-            getSearchTids(tid, uid, cutoff),
-        ]);
-
-        tids = _.uniq(tagTids.concat(searchTids));
-
-        let categoryTids = [];
-        if (stop !== -1 && tids.length < stop - start + 1) {
-            categoryTids = await getCategoryTids(tid, cutoff);
-        }
-        tids = _.shuffle(_.uniq(tids.concat(categoryTids)));
-        tids = await privileges.topics.filterTids('topics:read', tids, uid);
-
-        let topicData = await Topics.getTopicsByTids(tids, uid);
-        topicData = topicData.filter(topic => topic && topic.tid !== tid);
-        topicData = await user.blocks.filter(uid, topicData);
-        topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined)
-            .sort((t1, t2) => t2.timestamp - t1.timestamp);
-        return topicData;
-    };
+    Topics.getSuggestedTopics = async function (tid, uid, start, stop, cutoff = 0) {};
 
     async function getTidsWithSameTags(tid, cutoff) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/suggested.js:15:18
     Topics.getSuggestedTopics = async function (tid, uid, start, stop, cutoff = 0) {
         let tids;
         tid = parseInt(tid, 10);
-        cutoff = cutoff === 0 ? cutoff : (cutoff * 2592000000);
+        cutoff = false ? cutoff : (cutoff * 2592000000);
         const [tagTids, searchTids] = await Promise.all([
             getTidsWithSameTags(tid, cutoff),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/suggested.js:15:18
     Topics.getSuggestedTopics = async function (tid, uid, start, stop, cutoff = 0) {
         let tids;
         tid = parseInt(tid, 10);
-        cutoff = cutoff === 0 ? cutoff : (cutoff * 2592000000);
+        cutoff = true ? cutoff : (cutoff * 2592000000);
         const [tagTids, searchTids] = await Promise.all([
             getTidsWithSameTags(tid, cutoff),
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrayDeclaration
src/topics/suggested.js:23:28
 
         tids = _.uniq(tagTids.concat(searchTids));
 
-        let categoryTids = [];
+        let categoryTids = ["Stryker was here"];
         if (stop !== -1 && tids.length < stop - start + 1) {
             categoryTids = await getCategoryTids(tid, cutoff);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/suggested.js:24:13
         tids = _.uniq(tagTids.concat(searchTids));
 
         let categoryTids = [];
-        if (stop !== -1 && tids.length < stop - start + 1) {
+        if (stop === -1 && tids.length < stop - start + 1) {
             categoryTids = await getCategoryTids(tid, cutoff);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/suggested.js:24:13
         tids = _.uniq(tagTids.concat(searchTids));
 
         let categoryTids = [];
-        if (stop !== -1 && tids.length < stop - start + 1) {
+        if (false) {
             categoryTids = await getCategoryTids(tid, cutoff);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/suggested.js:31:21
         tids = await privileges.topics.filterTids('topics:read', tids, uid);
 
         let topicData = await Topics.getTopicsByTids(tids, uid);
-        topicData = topicData.filter(topic => topic && topic.tid !== tid);
+        topicData = topicData;
         topicData = await user.blocks.filter(uid, topicData);
         topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined)
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/suggested.js:31:47
         tids = await privileges.topics.filterTids('topics:read', tids, uid);
 
         let topicData = await Topics.getTopicsByTids(tids, uid);
-        topicData = topicData.filter(topic => topic && topic.tid !== tid);
+        topicData = topicData.filter(topic => true);
         topicData = await user.blocks.filter(uid, topicData);
         topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined)
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/suggested.js:32:27
 
         let topicData = await Topics.getTopicsByTids(tids, uid);
         topicData = topicData.filter(topic => topic && topic.tid !== tid);
-        topicData = await user.blocks.filter(uid, topicData);
+        topicData = await user.blocks;
         topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined)
             .sort((t1, t2) => t2.timestamp - t1.timestamp);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/suggested.js:33:44
         let topicData = await Topics.getTopicsByTids(tids, uid);
         topicData = topicData.filter(topic => topic && topic.tid !== tid);
         topicData = await user.blocks.filter(uid, topicData);
-        topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined)
+        topicData = topicData.slice(start, false ? stop + 1 : undefined)
             .sort((t1, t2) => t2.timestamp - t1.timestamp);
         return topicData;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/suggested.js:33:21
         let topicData = await Topics.getTopicsByTids(tids, uid);
         topicData = topicData.filter(topic => topic && topic.tid !== tid);
         topicData = await user.blocks.filter(uid, topicData);
-        topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined)
-            .sort((t1, t2) => t2.timestamp - t1.timestamp);
+        topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined);
         return topicData;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArithmeticOperator
src/topics/suggested.js:34:31
         topicData = topicData.filter(topic => topic && topic.tid !== tid);
         topicData = await user.blocks.filter(uid, topicData);
         topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined)
-            .sort((t1, t2) => t2.timestamp - t1.timestamp);
+            .sort((t1, t2) => t2.timestamp + t1.timestamp);
         return topicData;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/suggested.js:34:19
         topicData = topicData.filter(topic => topic && topic.tid !== tid);
         topicData = await user.blocks.filter(uid, topicData);
         topicData = topicData.slice(start, stop !== -1 ? stop + 1 : undefined)
-            .sort((t1, t2) => t2.timestamp - t1.timestamp);
+            .sort(() => undefined);
         return topicData;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/suggested.js:38:53
         return topicData;
     };
 
-    async function getTidsWithSameTags(tid, cutoff) {
-        const tags = await Topics.getTopicTags(tid);
-        let tids = cutoff === 0 ?
-            await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
-            await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
-        tids = tids.filter(_tid => _tid !== tid); // remove self
-        return _.shuffle(_.uniq(tids)).slice(0, 10).map(Number);
-    }
+    async function getTidsWithSameTags(tid, cutoff) {}
 
     async function getSearchTids(tid, uid, cutoff) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/suggested.js:40:20
 
     async function getTidsWithSameTags(tid, cutoff) {
         const tags = await Topics.getTopicTags(tid);
-        let tids = cutoff === 0 ?
+        let tids = cutoff !== 0 ?
             await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
             await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/suggested.js:40:20
 
     async function getTidsWithSameTags(tid, cutoff) {
         const tags = await Topics.getTopicTags(tid);
-        let tids = cutoff === 0 ?
+        let tids = true ?
             await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
             await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/suggested.js:41:84
     async function getTidsWithSameTags(tid, cutoff) {
         const tags = await Topics.getTopicTags(tid);
         let tids = cutoff === 0 ?
-            await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
+            await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, +1) :
             await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
         tids = tids.filter(_tid => _tid !== tid); // remove self
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/suggested.js:41:52
     async function getTidsWithSameTags(tid, cutoff) {
         const tags = await Topics.getTopicTags(tid);
         let tids = cutoff === 0 ?
-            await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
+            await db.getSortedSetRevRange(tags.map(() => undefined), 0, -1) :
             await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
         tids = tids.filter(_tid => _tid !== tid); // remove self
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArithmeticOperator
src/topics/suggested.js:42:103
         const tags = await Topics.getTopicTags(tid);
         let tids = cutoff === 0 ?
             await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
-            await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
+            await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() + cutoff);
         tids = tids.filter(_tid => _tid !== tid); // remove self
         return _.shuffle(_.uniq(tids)).slice(0, 10).map(Number);

[NoCoverage] UnaryOperator
src/topics/suggested.js:42:91
         const tags = await Topics.getTopicTags(tid);
         let tids = cutoff === 0 ?
             await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
-            await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
+            await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, +1, '+inf', Date.now() - cutoff);
         tids = tids.filter(_tid => _tid !== tid); // remove self
         return _.shuffle(_.uniq(tids)).slice(0, 10).map(Number);

[Killed] ConditionalExpression
src/topics/suggested.js:43:36
         let tids = cutoff === 0 ?
             await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
             await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
-        tids = tids.filter(_tid => _tid !== tid); // remove self
+        tids = tids.filter(_tid => true); // remove self
         return _.shuffle(_.uniq(tids)).slice(0, 10).map(Number);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/suggested.js:43:16
         let tids = cutoff === 0 ?
             await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
             await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
-        tids = tids.filter(_tid => _tid !== tid); // remove self
+        tids = tids; // remove self
         return _.shuffle(_.uniq(tids)).slice(0, 10).map(Number);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/suggested.js:44:16
             await db.getSortedSetRevRange(tags.map(tag => `tag:${tag}:topics`), 0, -1) :
             await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
         tids = tids.filter(_tid => _tid !== tid); // remove self
-        return _.shuffle(_.uniq(tids)).slice(0, 10).map(Number);
+        return _.shuffle(_.uniq(tids)).map(Number);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/suggested.js:47:52
         return _.shuffle(_.uniq(tids)).slice(0, 10).map(Number);
     }
 
-    async function getSearchTids(tid, uid, cutoff) {
-        const topicData = await Topics.getTopicFields(tid, ['title', 'cid']);
-        const data = await search.search({
-            query: topicData.title,
-            searchIn: 'titles',
-            matchWords: 'any',
-            categories: [topicData.cid],
-            uid: uid,
-            returnIds: true,
-            timeRange: cutoff !== 0 ? cutoff / 1000 : 0,
-            timeFilter: 'newer',
-        });
-        data.tids = data.tids.filter(_tid => _tid !== tid); // remove self
-        return _.shuffle(data.tids).slice(0, 10).map(Number);
-    }
+    async function getSearchTids(tid, uid, cutoff) {}
 
     async function getCategoryTids(tid, cutoff) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/suggested.js:48:61
     }
 
     async function getSearchTids(tid, uid, cutoff) {
-        const topicData = await Topics.getTopicFields(tid, ['title', 'cid']);
+        const topicData = await Topics.getTopicFields(tid, ["", 'cid']);
         const data = await search.search({
             query: topicData.title,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/suggested.js:53:25
             query: topicData.title,
             searchIn: 'titles',
             matchWords: 'any',
-            categories: [topicData.cid],
+            categories: [],
             uid: uid,
             returnIds: true,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/suggested.js:55:24
             matchWords: 'any',
             categories: [topicData.cid],
             uid: uid,
-            returnIds: true,
+            returnIds: false,
             timeRange: cutoff !== 0 ? cutoff / 1000 : 0,
             timeFilter: 'newer',
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/suggested.js:56:24
             categories: [topicData.cid],
             uid: uid,
             returnIds: true,
-            timeRange: cutoff !== 0 ? cutoff / 1000 : 0,
+            timeRange: false ? cutoff / 1000 : 0,
             timeFilter: 'newer',
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/suggested.js:56:24
             categories: [topicData.cid],
             uid: uid,
             returnIds: true,
-            timeRange: cutoff !== 0 ? cutoff / 1000 : 0,
+            timeRange: true ? cutoff / 1000 : 0,
             timeFilter: 'newer',
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/suggested.js:59:38
             timeRange: cutoff !== 0 ? cutoff / 1000 : 0,
             timeFilter: 'newer',
         });
-        data.tids = data.tids.filter(_tid => _tid !== tid); // remove self
+        data.tids = data.tids.filter(() => undefined); // remove self
         return _.shuffle(data.tids).slice(0, 10).map(Number);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/suggested.js:59:21
             timeRange: cutoff !== 0 ? cutoff / 1000 : 0,
             timeFilter: 'newer',
         });
-        data.tids = data.tids.filter(_tid => _tid !== tid); // remove self
+        data.tids = data.tids; // remove self
         return _.shuffle(data.tids).slice(0, 10).map(Number);
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/suggested.js:60:16
             timeFilter: 'newer',
         });
         data.tids = data.tids.filter(_tid => _tid !== tid); // remove self
-        return _.shuffle(data.tids).slice(0, 10).map(Number);
+        return _.shuffle(data.tids).map(Number);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/suggested.js:63:49
         return _.shuffle(data.tids).slice(0, 10).map(Number);
     }
 
-    async function getCategoryTids(tid, cutoff) {
-        const cid = await Topics.getTopicField(tid, 'cid');
-        const tids = cutoff === 0 ?
-            await db.getSortedSetRevRange(`cid:${cid}:tids:lastposttime`, 0, 9) :
-            await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
-        return _.shuffle(tids.map(Number).filter(_tid => _tid !== tid));
-    }
+    async function getCategoryTids(tid, cutoff) {}
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/suggested.js:65:22
 
     async function getCategoryTids(tid, cutoff) {
         const cid = await Topics.getTopicField(tid, 'cid');
-        const tids = cutoff === 0 ?
+        const tids = cutoff !== 0 ?
             await db.getSortedSetRevRange(`cid:${cid}:tids:lastposttime`, 0, 9) :
             await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/suggested.js:65:22
 
     async function getCategoryTids(tid, cutoff) {
         const cid = await Topics.getTopicField(tid, 'cid');
-        const tids = cutoff === 0 ?
+        const tids = true ?
             await db.getSortedSetRevRange(`cid:${cid}:tids:lastposttime`, 0, 9) :
             await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArithmeticOperator
src/topics/suggested.js:67:96
         const cid = await Topics.getTopicField(tid, 'cid');
         const tids = cutoff === 0 ?
             await db.getSortedSetRevRange(`cid:${cid}:tids:lastposttime`, 0, 9) :
-            await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
+            await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() + cutoff);
         return _.shuffle(tids.map(Number).filter(_tid => _tid !== tid));
     }

[NoCoverage] StringLiteral
src/topics/suggested.js:67:88
         const cid = await Topics.getTopicField(tid, 'cid');
         const tids = cutoff === 0 ?
             await db.getSortedSetRevRange(`cid:${cid}:tids:lastposttime`, 0, 9) :
-            await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
+            await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, "", Date.now() - cutoff);
         return _.shuffle(tids.map(Number).filter(_tid => _tid !== tid));
     }

[Killed] MethodExpression
src/topics/suggested.js:68:26
         const tids = cutoff === 0 ?
             await db.getSortedSetRevRange(`cid:${cid}:tids:lastposttime`, 0, 9) :
             await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
-        return _.shuffle(tids.map(Number).filter(_tid => _tid !== tid));
+        return _.shuffle(tids.map(Number));
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/suggested.js:68:58
         const tids = cutoff === 0 ?
             await db.getSortedSetRevRange(`cid:${cid}:tids:lastposttime`, 0, 9) :
             await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
-        return _.shuffle(tids.map(Number).filter(_tid => _tid !== tid));
+        return _.shuffle(tids.map(Number).filter(_tid => true));
     }
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
