[Killed] BlockStatement
src/topics/tags.js:18:63
 const cache = require('../cache');
 
 module.exports = function (Topics) {
-    Topics.createTags = async function (tags, tid, timestamp) {
-        if (!Array.isArray(tags) || !tags.length) {
-            return;
-        }
-
-        const cid = await Topics.getTopicField(tid, 'cid');
-        const topicSets = tags.map(tag => `tag:${tag}:topics`).concat(
-            tags.map(tag => `cid:${cid}:tag:${tag}:topics`)
-        );
-        await db.sortedSetsAdd(topicSets, timestamp, tid);
-        await Topics.updateCategoryTagsCount([cid], tags);
-        await Promise.all(tags.map(updateTagCount));
-    };
+    Topics.createTags = async function (tags, tid, timestamp) {};
 
     Topics.filterTags = async function (tags, cid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:19:13
 
 module.exports = function (Topics) {
     Topics.createTags = async function (tags, tid, timestamp) {
-        if (!Array.isArray(tags) || !tags.length) {
+        if (Array.isArray(tags) || !tags.length) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:19:51
 
 module.exports = function (Topics) {
     Topics.createTags = async function (tags, tid, timestamp) {
-        if (!Array.isArray(tags) || !tags.length) {
-            return;
-        }
+        if (!Array.isArray(tags) || !tags.length) {}
 
         const cid = await Topics.getTopicField(tid, 'cid');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:24:36
         }
 
         const cid = await Topics.getTopicField(tid, 'cid');
-        const topicSets = tags.map(tag => `tag:${tag}:topics`).concat(
+        const topicSets = tags.map(() => undefined).concat(
             tags.map(tag => `cid:${cid}:tag:${tag}:topics`)
         );
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:25:22
 
         const cid = await Topics.getTopicField(tid, 'cid');
         const topicSets = tags.map(tag => `tag:${tag}:topics`).concat(
-            tags.map(tag => `cid:${cid}:tag:${tag}:topics`)
+            tags.map(() => undefined)
         );
         await db.sortedSetsAdd(topicSets, timestamp, tid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:32:52
         await Promise.all(tags.map(updateTagCount));
     };
 
-    Topics.filterTags = async function (tags, cid) {
-        const result = await plugins.hooks.fire('filter:tags.filter', { tags: tags, cid: cid });
-        tags = _.uniq(result.tags)
-            .map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
-            .filter(tag => tag && tag.length >= (meta.config.minimumTagLength || 3));
-
-        return await filterCategoryTags(tags, cid);
-    };
+    Topics.filterTags = async function (tags, cid) {};
 
     Topics.updateCategoryTagsCount = async function (cids, tags) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/tags.js:34:16
 
     Topics.filterTags = async function (tags, cid) {
         const result = await plugins.hooks.fire('filter:tags.filter', { tags: tags, cid: cid });
-        tags = _.uniq(result.tags)
-            .map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
-            .filter(tag => tag && tag.length >= (meta.config.minimumTagLength || 3));
+        tags = _.uniq(result.tags).map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength));
 
         return await filterCategoryTags(tags, cid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:35:18
     Topics.filterTags = async function (tags, cid) {
         const result = await plugins.hooks.fire('filter:tags.filter', { tags: tags, cid: cid });
         tags = _.uniq(result.tags)
-            .map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
+            .map(() => undefined)
             .filter(tag => tag && tag.length >= (meta.config.minimumTagLength || 3));
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/tags.js:36:35
         const result = await plugins.hooks.fire('filter:tags.filter', { tags: tags, cid: cid });
         tags = _.uniq(result.tags)
             .map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
-            .filter(tag => tag && tag.length >= (meta.config.minimumTagLength || 3));
+            .filter(tag => tag && tag.length > (meta.config.minimumTagLength || 3));
 
         return await filterCategoryTags(tags, cid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:36:28
         const result = await plugins.hooks.fire('filter:tags.filter', { tags: tags, cid: cid });
         tags = _.uniq(result.tags)
             .map(tag => utils.cleanUpTag(tag, meta.config.maximumTagLength))
-            .filter(tag => tag && tag.length >= (meta.config.minimumTagLength || 3));
+            .filter(tag => true);
 
         return await filterCategoryTags(tags, cid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:41:66
         return await filterCategoryTags(tags, cid);
     };
 
-    Topics.updateCategoryTagsCount = async function (cids, tags) {
-        await Promise.all(cids.map(async (cid) => {
-            const counts = await db.sortedSetsCard(
-                tags.map(tag => `cid:${cid}:tag:${tag}:topics`)
-            );
-            const tagToCount = _.zipObject(tags, counts);
-            const set = `cid:${cid}:tags`;
-
-            const bulkAdd = tags.filter(tag => tagToCount[tag] > 0)
-                .map(tag => [set, tagToCount[tag], tag]);
-
-            const bulkRemove = tags.filter(tag => tagToCount[tag] <= 0)
-                .map(tag => [set, tag]);
-
-            await Promise.all([
-                db.sortedSetAddBulk(bulkAdd),
-                db.sortedSetRemoveBulk(bulkRemove),
-            ]);
-        }));
-
-        await db.sortedSetsRemoveRangeByScore(
-            cids.map(cid => `cid:${cid}:tags`), '-inf', 0
-        );
-    };
+    Topics.updateCategoryTagsCount = async function (cids, tags) {};
 
     Topics.validateTags = async function (tags, cid, uid, tid = null) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:42:51
     };
 
     Topics.updateCategoryTagsCount = async function (cids, tags) {
-        await Promise.all(cids.map(async (cid) => {
-            const counts = await db.sortedSetsCard(
-                tags.map(tag => `cid:${cid}:tag:${tag}:topics`)
-            );
-            const tagToCount = _.zipObject(tags, counts);
-            const set = `cid:${cid}:tags`;
-
-            const bulkAdd = tags.filter(tag => tagToCount[tag] > 0)
-                .map(tag => [set, tagToCount[tag], tag]);
-
-            const bulkRemove = tags.filter(tag => tagToCount[tag] <= 0)
-                .map(tag => [set, tag]);
-
-            await Promise.all([
-                db.sortedSetAddBulk(bulkAdd),
-                db.sortedSetRemoveBulk(bulkRemove),
-            ]);
-        }));
+        await Promise.all(cids.map(async (cid) => {}));
 
         await db.sortedSetsRemoveRangeByScore(
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:44:26
     Topics.updateCategoryTagsCount = async function (cids, tags) {
         await Promise.all(cids.map(async (cid) => {
             const counts = await db.sortedSetsCard(
-                tags.map(tag => `cid:${cid}:tag:${tag}:topics`)
+                tags.map(() => undefined)
             );
             const tagToCount = _.zipObject(tags, counts);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:47:25
                 tags.map(tag => `cid:${cid}:tag:${tag}:topics`)
             );
             const tagToCount = _.zipObject(tags, counts);
-            const set = `cid:${cid}:tags`;
+            const set = ``;
 
             const bulkAdd = tags.filter(tag => tagToCount[tag] > 0)
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/tags.js:49:48
             const tagToCount = _.zipObject(tags, counts);
             const set = `cid:${cid}:tags`;
 
-            const bulkAdd = tags.filter(tag => tagToCount[tag] > 0)
+            const bulkAdd = tags.filter(tag => tagToCount[tag] <= 0)
                 .map(tag => [set, tagToCount[tag], tag]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/tags.js:49:48
             const tagToCount = _.zipObject(tags, counts);
             const set = `cid:${cid}:tags`;
 
-            const bulkAdd = tags.filter(tag => tagToCount[tag] > 0)
+            const bulkAdd = tags.filter(tag => tagToCount[tag] >= 0)
                 .map(tag => [set, tagToCount[tag], tag]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:50:22
             const set = `cid:${cid}:tags`;
 
             const bulkAdd = tags.filter(tag => tagToCount[tag] > 0)
-                .map(tag => [set, tagToCount[tag], tag]);
+                .map(() => undefined);
 
             const bulkRemove = tags.filter(tag => tagToCount[tag] <= 0)
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/tags.js:52:32
             const bulkAdd = tags.filter(tag => tagToCount[tag] > 0)
                 .map(tag => [set, tagToCount[tag], tag]);
 
-            const bulkRemove = tags.filter(tag => tagToCount[tag] <= 0)
+            const bulkRemove = tags
                 .map(tag => [set, tag]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:52:44
             const bulkAdd = tags.filter(tag => tagToCount[tag] > 0)
                 .map(tag => [set, tagToCount[tag], tag]);
 
-            const bulkRemove = tags.filter(tag => tagToCount[tag] <= 0)
+            const bulkRemove = tags.filter(() => undefined)
                 .map(tag => [set, tag]);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:53:22
                 .map(tag => [set, tagToCount[tag], tag]);
 
             const bulkRemove = tags.filter(tag => tagToCount[tag] <= 0)
-                .map(tag => [set, tag]);
+                .map(() => undefined);
 
             await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:62:22
         }));
 
         await db.sortedSetsRemoveRangeByScore(
-            cids.map(cid => `cid:${cid}:tags`), '-inf', 0
+            cids.map(() => undefined), '-inf', 0
         );
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:67:13
     };
 
     Topics.validateTags = async function (tags, cid, uid, tid = null) {
-        if (!Array.isArray(tags)) {
+        if (true) {
             throw new Error('[[error:invalid-data]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:67:13
     };
 
     Topics.validateTags = async function (tags, cid, uid, tid = null) {
-        if (!Array.isArray(tags)) {
+        if (false) {
             throw new Error('[[error:invalid-data]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:76:63
             user.isPrivileged(uid),
             tid ? Topics.getTopicTags(tid) : [],
         ]);
-        if (tags.length < parseInt(categoryData.minTags, 10)) {
-            throw new Error(`[[error:not-enough-tags, ${categoryData.minTags}]]`);
-        } else if (tags.length > parseInt(categoryData.maxTags, 10)) {
+        if (tags.length < parseInt(categoryData.minTags, 10)) {} else if (tags.length > parseInt(categoryData.maxTags, 10)) {
             throw new Error(`[[error:too-many-tags, ${categoryData.maxTags}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:76:13
             user.isPrivileged(uid),
             tid ? Topics.getTopicTags(tid) : [],
         ]);
-        if (tags.length < parseInt(categoryData.minTags, 10)) {
+        if (true) {
             throw new Error(`[[error:not-enough-tags, ${categoryData.minTags}]]`);
         } else if (tags.length > parseInt(categoryData.maxTags, 10)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/tags.js:78:20
         ]);
         if (tags.length < parseInt(categoryData.minTags, 10)) {
             throw new Error(`[[error:not-enough-tags, ${categoryData.minTags}]]`);
-        } else if (tags.length > parseInt(categoryData.maxTags, 10)) {
+        } else if (tags.length >= parseInt(categoryData.maxTags, 10)) {
             throw new Error(`[[error:too-many-tags, ${categoryData.maxTags}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/tags.js:78:20
         ]);
         if (tags.length < parseInt(categoryData.minTags, 10)) {
             throw new Error(`[[error:not-enough-tags, ${categoryData.minTags}]]`);
-        } else if (tags.length > parseInt(categoryData.maxTags, 10)) {
+        } else if (tags.length <= parseInt(categoryData.maxTags, 10)) {
             throw new Error(`[[error:too-many-tags, ${categoryData.maxTags}]]`);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:82:39
             throw new Error(`[[error:too-many-tags, ${categoryData.maxTags}]]`);
         }
 
-        const addedTags = tags.filter(tag => !currentTags.includes(tag));
+        const addedTags = tags.filter(() => undefined);
         const removedTags = currentTags.filter(tag => !tags.includes(tag));
         const systemTags = (meta.config.systemTags || '').split(',');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:82:46
             throw new Error(`[[error:too-many-tags, ${categoryData.maxTags}]]`);
         }
 
-        const addedTags = tags.filter(tag => !currentTags.includes(tag));
+        const addedTags = tags.filter(tag => currentTags.includes(tag));
         const removedTags = currentTags.filter(tag => !tags.includes(tag));
         const systemTags = (meta.config.systemTags || '').split(',');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/tags.js:83:29
         }
 
         const addedTags = tags.filter(tag => !currentTags.includes(tag));
-        const removedTags = currentTags.filter(tag => !tags.includes(tag));
+        const removedTags = currentTags;
         const systemTags = (meta.config.systemTags || '').split(',');
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:83:55
         }
 
         const addedTags = tags.filter(tag => !currentTags.includes(tag));
-        const removedTags = currentTags.filter(tag => !tags.includes(tag));
+        const removedTags = currentTags.filter(tag => tags.includes(tag));
         const systemTags = (meta.config.systemTags || '').split(',');
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:84:29
 
         const addedTags = tags.filter(tag => !currentTags.includes(tag));
         const removedTags = currentTags.filter(tag => !tags.includes(tag));
-        const systemTags = (meta.config.systemTags || '').split(',');
+        const systemTags = (false).split(',');
 
         if (!isPrivileged && systemTags.length &&
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:84:29
 
         const addedTags = tags.filter(tag => !currentTags.includes(tag));
         const removedTags = currentTags.filter(tag => !tags.includes(tag));
-        const systemTags = (meta.config.systemTags || '').split(',');
+        const systemTags = (true).split(',');
 
         if (!isPrivileged && systemTags.length &&
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/tags.js:86:13
         const removedTags = currentTags.filter(tag => !tags.includes(tag));
         const systemTags = (meta.config.systemTags || '').split(',');
 
-        if (!isPrivileged && systemTags.length &&
-            addedTags.length && addedTags.some(tag => systemTags.includes(tag))) {
+        if (!isPrivileged && systemTags.length || addedTags.length && addedTags.some(tag => systemTags.includes(tag))) {
             throw new Error('[[error:cant-use-system-tag]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/tags.js:86:13
         const removedTags = currentTags.filter(tag => !tags.includes(tag));
         const systemTags = (meta.config.systemTags || '').split(',');
 
-        if (!isPrivileged && systemTags.length &&
+        if (!isPrivileged || systemTags.length &&
             addedTags.length && addedTags.some(tag => systemTags.includes(tag))) {
             throw new Error('[[error:cant-use-system-tag]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/tags.js:87:33
         const systemTags = (meta.config.systemTags || '').split(',');
 
         if (!isPrivileged && systemTags.length &&
-            addedTags.length && addedTags.some(tag => systemTags.includes(tag))) {
+            addedTags.length && addedTags.every(tag => systemTags.includes(tag))) {
             throw new Error('[[error:cant-use-system-tag]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:87:82
         const systemTags = (meta.config.systemTags || '').split(',');
 
         if (!isPrivileged && systemTags.length &&
-            addedTags.length && addedTags.some(tag => systemTags.includes(tag))) {
-            throw new Error('[[error:cant-use-system-tag]]');
-        }
+            addedTags.length && addedTags.some(tag => systemTags.includes(tag))) {}
 
         if (!isPrivileged && systemTags.length &&
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:88:29
 
         if (!isPrivileged && systemTags.length &&
             addedTags.length && addedTags.some(tag => systemTags.includes(tag))) {
-            throw new Error('[[error:cant-use-system-tag]]');
+            throw new Error("");
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:91:13
             throw new Error('[[error:cant-use-system-tag]]');
         }
 
-        if (!isPrivileged && systemTags.length &&
+        if (isPrivileged && systemTags.length &&
             removedTags.length && removedTags.some(tag => systemTags.includes(tag))) {
             throw new Error('[[error:cant-remove-system-tag]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:91:13
             throw new Error('[[error:cant-use-system-tag]]');
         }
 
-        if (!isPrivileged && systemTags.length &&
-            removedTags.length && removedTags.some(tag => systemTags.includes(tag))) {
+        if (false) {
             throw new Error('[[error:cant-remove-system-tag]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/tags.js:92:35
         }
 
         if (!isPrivileged && systemTags.length &&
-            removedTags.length && removedTags.some(tag => systemTags.includes(tag))) {
+            removedTags.length && removedTags.every(tag => systemTags.includes(tag))) {
             throw new Error('[[error:cant-remove-system-tag]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:92:52
         }
 
         if (!isPrivileged && systemTags.length &&
-            removedTags.length && removedTags.some(tag => systemTags.includes(tag))) {
+            removedTags.length && removedTags.some(() => undefined)) {
             throw new Error('[[error:cant-remove-system-tag]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] StringLiteral
src/topics/tags.js:93:29
 
         if (!isPrivileged && systemTags.length &&
             removedTags.length && removedTags.some(tag => systemTags.includes(tag))) {
-            throw new Error('[[error:cant-remove-system-tag]]');
+            throw new Error("");
         }
     };

[Killed] BlockStatement
src/topics/tags.js:97:50
         }
     };
 
-    async function filterCategoryTags(tags, cid) {
-        const tagWhitelist = await categories.getTagWhitelist([cid]);
-        if (!Array.isArray(tagWhitelist[0]) || !tagWhitelist[0].length) {
-            return tags;
-        }
-        const whitelistSet = new Set(tagWhitelist[0]);
-        return tags.filter(tag => whitelistSet.has(tag));
-    }
+    async function filterCategoryTags(tags, cid) {}
 
     Topics.createEmptyTag = async function (tag) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/tags.js:98:63
     };
 
     async function filterCategoryTags(tags, cid) {
-        const tagWhitelist = await categories.getTagWhitelist([cid]);
+        const tagWhitelist = await categories.getTagWhitelist([]);
         if (!Array.isArray(tagWhitelist[0]) || !tagWhitelist[0].length) {
             return tags;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:99:13
 
     async function filterCategoryTags(tags, cid) {
         const tagWhitelist = await categories.getTagWhitelist([cid]);
-        if (!Array.isArray(tagWhitelist[0]) || !tagWhitelist[0].length) {
+        if (Array.isArray(tagWhitelist[0]) || !tagWhitelist[0].length) {
             return tags;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:99:13
 
     async function filterCategoryTags(tags, cid) {
         const tagWhitelist = await categories.getTagWhitelist([cid]);
-        if (!Array.isArray(tagWhitelist[0]) || !tagWhitelist[0].length) {
+        if (true) {
             return tags;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:103:28
             return tags;
         }
         const whitelistSet = new Set(tagWhitelist[0]);
-        return tags.filter(tag => whitelistSet.has(tag));
+        return tags.filter(() => undefined);
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/tags.js:103:16
             return tags;
         }
         const whitelistSet = new Set(tagWhitelist[0]);
-        return tags.filter(tag => whitelistSet.has(tag));
+        return tags;
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:106:50
         return tags.filter(tag => whitelistSet.has(tag));
     }
 
-    Topics.createEmptyTag = async function (tag) {
-        if (!tag) {
-            throw new Error('[[error:invalid-tag]]');
-        }
-        if (tag.length < (meta.config.minimumTagLength || 3)) {
-            throw new Error('[[error:tag-too-short]]');
-        }
-        const isMember = await db.isSortedSetMember('tags:topic:count', tag);
-        if (!isMember) {
-            await db.sortedSetAdd('tags:topic:count', 0, tag);
-            cache.del('tags:topic:count');
-        }
-        const allCids = await categories.getAllCidsFromSet('categories:cid');
-        const isMembers = await db.isMemberOfSortedSets(
-            allCids.map(cid => `cid:${cid}:tags`), tag
-        );
-        const bulkAdd = allCids.filter((cid, index) => !isMembers[index])
-            .map(cid => ([`cid:${cid}:tags`, 0, tag]));
-        await db.sortedSetAddBulk(bulkAdd);
-    };
+    Topics.createEmptyTag = async function (tag) {};
 
     Topics.renameTags = async function (data) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:107:13
     }
 
     Topics.createEmptyTag = async function (tag) {
-        if (!tag) {
+        if (tag) {
             throw new Error('[[error:invalid-tag]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:107:13
     }
 
     Topics.createEmptyTag = async function (tag) {
-        if (!tag) {
+        if (false) {
             throw new Error('[[error:invalid-tag]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:108:29
 
     Topics.createEmptyTag = async function (tag) {
         if (!tag) {
-            throw new Error('[[error:invalid-tag]]');
+            throw new Error("");
         }
         if (tag.length < (meta.config.minimumTagLength || 3)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/tags.js:110:13
         if (!tag) {
             throw new Error('[[error:invalid-tag]]');
         }
-        if (tag.length < (meta.config.minimumTagLength || 3)) {
+        if (tag.length >= (meta.config.minimumTagLength || 3)) {
             throw new Error('[[error:tag-too-short]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
