[Killed] ConditionalExpression
src/topics/tags.js:110:13
         if (!tag) {
             throw new Error('[[error:invalid-tag]]');
         }
-        if (tag.length < (meta.config.minimumTagLength || 3)) {
+        if (true) {
             throw new Error('[[error:tag-too-short]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:114:13
             throw new Error('[[error:tag-too-short]]');
         }
         const isMember = await db.isSortedSetMember('tags:topic:count', tag);
-        if (!isMember) {
+        if (false) {
             await db.sortedSetAdd('tags:topic:count', 0, tag);
             cache.del('tags:topic:count');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:114:13
             throw new Error('[[error:tag-too-short]]');
         }
         const isMember = await db.isSortedSetMember('tags:topic:count', tag);
-        if (!isMember) {
+        if (isMember) {
             await db.sortedSetAdd('tags:topic:count', 0, tag);
             cache.del('tags:topic:count');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:115:35
         }
         const isMember = await db.isSortedSetMember('tags:topic:count', tag);
         if (!isMember) {
-            await db.sortedSetAdd('tags:topic:count', 0, tag);
+            await db.sortedSetAdd("", 0, tag);
             cache.del('tags:topic:count');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:120:25
         }
         const allCids = await categories.getAllCidsFromSet('categories:cid');
         const isMembers = await db.isMemberOfSortedSets(
-            allCids.map(cid => `cid:${cid}:tags`), tag
+            allCids.map(() => undefined), tag
         );
         const bulkAdd = allCids.filter((cid, index) => !isMembers[index])
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/tags.js:122:25
         const isMembers = await db.isMemberOfSortedSets(
             allCids.map(cid => `cid:${cid}:tags`), tag
         );
-        const bulkAdd = allCids.filter((cid, index) => !isMembers[index])
+        const bulkAdd = allCids
             .map(cid => ([`cid:${cid}:tags`, 0, tag]));
         await db.sortedSetAddBulk(bulkAdd);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:122:56
         const isMembers = await db.isMemberOfSortedSets(
             allCids.map(cid => `cid:${cid}:tags`), tag
         );
-        const bulkAdd = allCids.filter((cid, index) => !isMembers[index])
+        const bulkAdd = allCids.filter((cid, index) => isMembers[index])
             .map(cid => ([`cid:${cid}:tags`, 0, tag]));
         await db.sortedSetAddBulk(bulkAdd);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:123:18
             allCids.map(cid => `cid:${cid}:tags`), tag
         );
         const bulkAdd = allCids.filter((cid, index) => !isMembers[index])
-            .map(cid => ([`cid:${cid}:tags`, 0, tag]));
+            .map(() => undefined);
         await db.sortedSetAddBulk(bulkAdd);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:127:47
         await db.sortedSetAddBulk(bulkAdd);
     };
 
-    Topics.renameTags = async function (data) {
-        for (const tagData of data) {
-            // eslint-disable-next-line no-await-in-loop
-            await renameTag(tagData.value, tagData.newName);
-        }
-    };
+    Topics.renameTags = async function (data) {};
 
     async function renameTag(tag, newTagName) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/tags.js:128:37
     };
 
     Topics.renameTags = async function (data) {
-        for (const tagData of data) {
-            // eslint-disable-next-line no-await-in-loop
-            await renameTag(tagData.value, tagData.newName);
-        }
+        for (const tagData of data) {}
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/tags.js:135:13
     };
 
     async function renameTag(tag, newTagName) {
-        if (!newTagName || tag === newTagName) {
+        if (!newTagName && tag === newTagName) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/tags.js:135:13
     };
 
     async function renameTag(tag, newTagName) {
-        if (!newTagName || tag === newTagName) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:144:81
         const allCids = {};
 
         await batch.processSortedSet(`tag:${tag}:topics`, async (tids) => {
-            const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'tags']);
+            const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', ""]);
             const cids = topicData.map(t => t.cid);
             topicData.forEach((t) => { allCids[t.cid] = true; });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:145:40
 
         await batch.processSortedSet(`tag:${tag}:topics`, async (tids) => {
             const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'tags']);
-            const cids = topicData.map(t => t.cid);
+            const cids = topicData.map(() => undefined);
             topicData.forEach((t) => { allCids[t.cid] = true; });
             const scores = await db.sortedSetScores(`tag:${tag}:topics`, tids);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:146:57
         await batch.processSortedSet(`tag:${tag}:topics`, async (tids) => {
             const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'tags']);
             const cids = topicData.map(t => t.cid);
-            topicData.forEach((t) => { allCids[t.cid] = true; });
+            topicData.forEach((t) => { allCids[t.cid] = false; });
             const scores = await db.sortedSetScores(`tag:${tag}:topics`, tids);
             // update tag:<tag>:topics
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:146:38
         await batch.processSortedSet(`tag:${tag}:topics`, async (tids) => {
             const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'tags']);
             const cids = topicData.map(t => t.cid);
-            topicData.forEach((t) => { allCids[t.cid] = true; });
+            topicData.forEach((t) => {});
             const scores = await db.sortedSetScores(`tag:${tag}:topics`, tids);
             // update tag:<tag>:topics
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/tags.js:154:17
 
             // update cid:<cid>:tag:<tag>:topics
             await db.sortedSetAddBulk(topicData.map(
-                (t, index) => [`cid:${t.cid}:tag:${newTagName}:topics`, scores[index], t.tid]
+                () => undefined
             ));
             await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tag:${tag}:topics`), tids);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:156:47
             await db.sortedSetAddBulk(topicData.map(
                 (t, index) => [`cid:${t.cid}:tag:${newTagName}:topics`, scores[index], t.tid]
             ));
-            await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tag:${tag}:topics`), tids);
+            await db.sortedSetRemove(cids.map(() => undefined), tids);
 
             // update 'tags' field in topic hash
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:156:54
             await db.sortedSetAddBulk(topicData.map(
                 (t, index) => [`cid:${t.cid}:tag:${newTagName}:topics`, scores[index], t.tid]
             ));
-            await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tag:${tag}:topics`), tids);
+            await db.sortedSetRemove(cids.map(cid => ``), tids);
 
             // update 'tags' field in topic hash
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:159:42
             await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tag:${tag}:topics`), tids);
 
             // update 'tags' field in topic hash
-            topicData.forEach((topic) => {
-                topic.tags = topic.tags.map(tagItem => tagItem.value);
-                const index = topic.tags.indexOf(tag);
-                if (index !== -1) {
-                    topic.tags.splice(index, 1, newTagName);
-                }
-            });
+            topicData.forEach((topic) => {});
             await db.setObjectBulk(
                 topicData.map(t => [`topic:${t.tid}`, { tags: t.tags.join(',') }]),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:160:45
 
             // update 'tags' field in topic hash
             topicData.forEach((topic) => {
-                topic.tags = topic.tags.map(tagItem => tagItem.value);
+                topic.tags = topic.tags.map(() => undefined);
                 const index = topic.tags.indexOf(tag);
                 if (index !== -1) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/tags.js:162:31
             topicData.forEach((topic) => {
                 topic.tags = topic.tags.map(tagItem => tagItem.value);
                 const index = topic.tags.indexOf(tag);
-                if (index !== -1) {
+                if (index !== +1) {
                     topic.tags.splice(index, 1, newTagName);
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:162:21
             topicData.forEach((topic) => {
                 topic.tags = topic.tags.map(tagItem => tagItem.value);
                 const index = topic.tags.indexOf(tag);
-                if (index !== -1) {
+                if (true) {
                     topic.tags.splice(index, 1, newTagName);
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:167:31
                 }
             });
             await db.setObjectBulk(
-                topicData.map(t => [`topic:${t.tid}`, { tags: t.tags.join(',') }]),
+                topicData.map(() => undefined),
             );
         }, {});
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:175:40
         await Topics.updateCategoryTagsCount(Object.keys(allCids), [newTagName]);
     }
 
-    async function updateTagCount(tag) {
-        const count = await Topics.getTagTopicCount(tag);
-        await db.sortedSetAdd('tags:topic:count', count || 0, tag);
-        cache.del('tags:topic:count');
-    }
+    async function updateTagCount(tag) {}
 
     Topics.getTagTids = async function (tag, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/tags.js:177:51
 
     async function updateTagCount(tag) {
         const count = await Topics.getTagTopicCount(tag);
-        await db.sortedSetAdd('tags:topic:count', count || 0, tag);
+        await db.sortedSetAdd('tags:topic:count', false, tag);
         cache.del('tags:topic:count');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/tags.js:177:51
 
     async function updateTagCount(tag) {
         const count = await Topics.getTagTopicCount(tag);
-        await db.sortedSetAdd('tags:topic:count', count || 0, tag);
+        await db.sortedSetAdd('tags:topic:count', count && 0, tag);
         cache.del('tags:topic:count');
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:178:19
     async function updateTagCount(tag) {
         const count = await Topics.getTagTopicCount(tag);
         await db.sortedSetAdd('tags:topic:count', count || 0, tag);
-        cache.del('tags:topic:count');
+        cache.del("");
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:181:59
         cache.del('tags:topic:count');
     }
 
-    Topics.getTagTids = async function (tag, start, stop) {
-        const tids = await db.getSortedSetRevRange(`tag:${tag}:topics`, start, stop);
-        const payload = await plugins.hooks.fire('filter:topics.getTagTids', { tag, start, stop, tids });
-        return payload.tids;
-    };
+    Topics.getTagTids = async function (tag, start, stop) {};
 
     Topics.getTagTidsByCids = async function (tag, cids, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/tags.js:183:78
 
     Topics.getTagTids = async function (tag, start, stop) {
         const tids = await db.getSortedSetRevRange(`tag:${tag}:topics`, start, stop);
-        const payload = await plugins.hooks.fire('filter:topics.getTagTids', { tag, start, stop, tids });
+        const payload = await plugins.hooks.fire('filter:topics.getTagTids', {});
         return payload.tids;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/tags.js:187:71
         return payload.tids;
     };
 
-    Topics.getTagTidsByCids = async function (tag, cids, start, stop) {
-        const keys = cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
-        const tids = await db.getSortedSetRevRange(keys, start, stop);
-        const payload = await plugins.hooks.fire('filter:topics.getTagTidsByCids', { tag, cids, start, stop, tids });
-        return payload.tids;
-    };
+    Topics.getTagTidsByCids = async function (tag, cids, start, stop) {};
 
     Topics.getTagTopicCount = async function (tag, cids = []) {

[NoCoverage] ArrowFunction
src/topics/tags.js:188:31
     };
 
     Topics.getTagTidsByCids = async function (tag, cids, start, stop) {
-        const keys = cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
+        const keys = cids.map(() => undefined);
         const tids = await db.getSortedSetRevRange(keys, start, stop);
         const payload = await plugins.hooks.fire('filter:topics.getTagTidsByCids', { tag, cids, start, stop, tids });

[Killed] BlockStatement
src/topics/tags.js:194:63
         return payload.tids;
     };
 
-    Topics.getTagTopicCount = async function (tag, cids = []) {
-        let count = 0;
-        if (cids.length) {
-            count = await db.sortedSetsCardSum(
-                cids.map(cid => `cid:${cid}:tag:${tag}:topics`)
-            );
-        } else {
-            count = await db.sortedSetCard(`tag:${tag}:topics`);
-        }
-
-        const payload = await plugins.hooks.fire('filter:topics.getTagTopicCount', { tag, count, cids });
-        return payload.count;
-    };
+    Topics.getTagTopicCount = async function (tag, cids = []) {};
 
     Topics.deleteTags = async function (tags) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/tags.js:194:59
         return payload.tids;
     };
 
-    Topics.getTagTopicCount = async function (tag, cids = []) {
+    Topics.getTagTopicCount = async function (tag, cids = ["Stryker was here"]) {
         let count = 0;
         if (cids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:196:13
 
     Topics.getTagTopicCount = async function (tag, cids = []) {
         let count = 0;
-        if (cids.length) {
+        if (false) {
             count = await db.sortedSetsCardSum(
                 cids.map(cid => `cid:${cid}:tag:${tag}:topics`)
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:196:13
 
     Topics.getTagTopicCount = async function (tag, cids = []) {
         let count = 0;
-        if (cids.length) {
+        if (true) {
             count = await db.sortedSetsCardSum(
                 cids.map(cid => `cid:${cid}:tag:${tag}:topics`)
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ArrowFunction
src/topics/tags.js:198:26
         let count = 0;
         if (cids.length) {
             count = await db.sortedSetsCardSum(
-                cids.map(cid => `cid:${cid}:tag:${tag}:topics`)
+                cids.map(() => undefined)
             );
         } else {

[Killed] BlockStatement
src/topics/tags.js:200:16
             count = await db.sortedSetsCardSum(
                 cids.map(cid => `cid:${cid}:tag:${tag}:topics`)
             );
-        } else {
-            count = await db.sortedSetCard(`tag:${tag}:topics`);
-        }
+        } else {}
 
         const payload = await plugins.hooks.fire('filter:topics.getTagTopicCount', { tag, count, cids });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:204:50
             count = await db.sortedSetCard(`tag:${tag}:topics`);
         }
 
-        const payload = await plugins.hooks.fire('filter:topics.getTagTopicCount', { tag, count, cids });
+        const payload = await plugins.hooks.fire("", { tag, count, cids });
         return payload.count;
     };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/tags.js:208:47
         return payload.count;
     };
 
-    Topics.deleteTags = async function (tags) {
-        if (!Array.isArray(tags) || !tags.length) {
-            return;
-        }
-        await removeTagsFromTopics(tags);
-        const keys = tags.map(tag => `tag:${tag}:topics`);
-        await db.deleteAll(keys);
-        await db.sortedSetRemove('tags:topic:count', tags);
-        cache.del('tags:topic:count');
-        const cids = await categories.getAllCidsFromSet('categories:cid');
-
-        await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tags`), tags);
-
-        const deleteKeys = [];
-        tags.forEach((tag) => {
-            deleteKeys.push(`tag:${tag}`);
-            cids.forEach((cid) => {
-                deleteKeys.push(`cid:${cid}:tag:${tag}:topics`);
-            });
-        });
-        await db.deleteAll(deleteKeys);
-    };
+    Topics.deleteTags = async function (tags) {};
 
     async function removeTagsFromTopics(tags) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:209:13
     };
 
     Topics.deleteTags = async function (tags) {
-        if (!Array.isArray(tags) || !tags.length) {
+        if (true) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/tags.js:209:13
     };
 
     Topics.deleteTags = async function (tags) {
-        if (!Array.isArray(tags) || !tags.length) {
+        if (!Array.isArray(tags) && !tags.length) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:213:31
             return;
         }
         await removeTagsFromTopics(tags);
-        const keys = tags.map(tag => `tag:${tag}:topics`);
+        const keys = tags.map(() => undefined);
         await db.deleteAll(keys);
         await db.sortedSetRemove('tags:topic:count', tags);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:217:57
         await db.deleteAll(keys);
         await db.sortedSetRemove('tags:topic:count', tags);
         cache.del('tags:topic:count');
-        const cids = await categories.getAllCidsFromSet('categories:cid');
+        const cids = await categories.getAllCidsFromSet("");
 
         await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tags`), tags);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:219:43
         cache.del('tags:topic:count');
         const cids = await categories.getAllCidsFromSet('categories:cid');
 
-        await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tags`), tags);
+        await db.sortedSetRemove(cids.map(() => undefined), tags);
 
         const deleteKeys = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/tags.js:221:28
 
         await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tags`), tags);
 
-        const deleteKeys = [];
+        const deleteKeys = ["Stryker was here"];
         tags.forEach((tag) => {
             deleteKeys.push(`tag:${tag}`);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:222:31
         await db.sortedSetRemove(cids.map(cid => `cid:${cid}:tags`), tags);
 
         const deleteKeys = [];
-        tags.forEach((tag) => {
-            deleteKeys.push(`tag:${tag}`);
-            cids.forEach((cid) => {
-                deleteKeys.push(`cid:${cid}:tag:${tag}:topics`);
-            });
-        });
+        tags.forEach((tag) => {});
         await db.deleteAll(deleteKeys);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:224:35
         const deleteKeys = [];
         tags.forEach((tag) => {
             deleteKeys.push(`tag:${tag}`);
-            cids.forEach((cid) => {
-                deleteKeys.push(`cid:${cid}:tag:${tag}:topics`);
-            });
+            cids.forEach((cid) => {});
         });
         await db.deleteAll(deleteKeys);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:225:33
         tags.forEach((tag) => {
             deleteKeys.push(`tag:${tag}`);
             cids.forEach((cid) => {
-                deleteKeys.push(`cid:${cid}:tag:${tag}:topics`);
+                deleteKeys.push(``);
             });
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:231:47
         await db.deleteAll(deleteKeys);
     };
 
-    async function removeTagsFromTopics(tags) {
-        await async.eachLimit(tags, 50, async (tag) => {
-            const tids = await db.getSortedSetRange(`tag:${tag}:topics`, 0, -1);
-            if (!tids.length) {
-                return;
-            }
-
-            await db.deleteObjectFields(
-                tids.map(tid => `topic:${tid}`),
-                ['tags'],
-            );
-        });
-    }
+    async function removeTagsFromTopics(tags) {}
 
     Topics.deleteTag = async function (tag) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/tags.js:232:56
     };
 
     async function removeTagsFromTopics(tags) {
-        await async.eachLimit(tags, 50, async (tag) => {
-            const tids = await db.getSortedSetRange(`tag:${tag}:topics`, 0, -1);
-            if (!tids.length) {
-                return;
-            }
-
-            await db.deleteObjectFields(
-                tids.map(tid => `topic:${tid}`),
-                ['tags'],
-            );
-        });
+        await async.eachLimit(tags, 50, async (tag) => {});
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/tags.js:233:77
 
     async function removeTagsFromTopics(tags) {
         await async.eachLimit(tags, 50, async (tag) => {
-            const tids = await db.getSortedSetRange(`tag:${tag}:topics`, 0, -1);
+            const tids = await db.getSortedSetRange(`tag:${tag}:topics`, 0, +1);
             if (!tids.length) {
                 return;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:234:31
     async function removeTagsFromTopics(tags) {
         await async.eachLimit(tags, 50, async (tag) => {
             const tids = await db.getSortedSetRange(`tag:${tag}:topics`, 0, -1);
-            if (!tids.length) {
-                return;
-            }
+            if (!tids.length) {}
 
             await db.deleteObjectFields(
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:234:17
     async function removeTagsFromTopics(tags) {
         await async.eachLimit(tags, 50, async (tag) => {
             const tids = await db.getSortedSetRange(`tag:${tag}:topics`, 0, -1);
-            if (!tids.length) {
+            if (true) {
                 return;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/tags.js:239:26
             }
 
             await db.deleteObjectFields(
-                tids.map(tid => `topic:${tid}`),
+                tids.map(() => undefined),
                 ['tags'],
             );
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:239:33
             }
 
             await db.deleteObjectFields(
-                tids.map(tid => `topic:${tid}`),
+                tids.map(tid => ``),
                 ['tags'],
             );
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/tags.js:245:45
         });
     }
 
-    Topics.deleteTag = async function (tag) {
-        await Topics.deleteTags([tag]);
-    };
+    Topics.deleteTag = async function (tag) {};
 
     Topics.getTags = async function (start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:249:51
         await Topics.deleteTags([tag]);
     };
 
-    Topics.getTags = async function (start, stop) {
-        return await getFromSet('tags:topic:count', start, stop);
-    };
+    Topics.getTags = async function (start, stop) {};
 
     Topics.getCategoryTags = async function (cids, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
