[Killed] BlockStatement
src/topics/tags.js:253:65
         return await getFromSet('tags:topic:count', start, stop);
     };
 
-    Topics.getCategoryTags = async function (cids, start, stop) {
-        if (Array.isArray(cids)) {
-            return await db.getSortedSetRevUnion({
-                sets: cids.map(cid => `cid:${cid}:tags`),
-                start,
-                stop,
-            });
-        }
-        return await db.getSortedSetRevRange(`cid:${cids}:tags`, start, stop);
-    };
+    Topics.getCategoryTags = async function (cids, start, stop) {};
 
     Topics.getCategoryTagsData = async function (cids, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:254:13
     };
 
     Topics.getCategoryTags = async function (cids, start, stop) {
-        if (Array.isArray(cids)) {
+        if (false) {
             return await db.getSortedSetRevUnion({
                 sets: cids.map(cid => `cid:${cid}:tags`),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:254:13
     };
 
     Topics.getCategoryTags = async function (cids, start, stop) {
-        if (Array.isArray(cids)) {
+        if (true) {
             return await db.getSortedSetRevUnion({
                 sets: cids.map(cid => `cid:${cid}:tags`),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] ObjectLiteral
src/topics/tags.js:255:50
 
     Topics.getCategoryTags = async function (cids, start, stop) {
         if (Array.isArray(cids)) {
-            return await db.getSortedSetRevUnion({
-                sets: cids.map(cid => `cid:${cid}:tags`),
-                start,
-                stop,
-            });
+            return await db.getSortedSetRevUnion({});
         }
         return await db.getSortedSetRevRange(`cid:${cids}:tags`, start, stop);

[NoCoverage] ArrowFunction
src/topics/tags.js:256:32
     Topics.getCategoryTags = async function (cids, start, stop) {
         if (Array.isArray(cids)) {
             return await db.getSortedSetRevUnion({
-                sets: cids.map(cid => `cid:${cid}:tags`),
+                sets: cids.map(() => undefined),
                 start,
                 stop,

[Killed] BlockStatement
src/topics/tags.js:264:69
         return await db.getSortedSetRevRange(`cid:${cids}:tags`, start, stop);
     };
 
-    Topics.getCategoryTagsData = async function (cids, start, stop) {
-        return await getFromSet(
-            Array.isArray(cids) ? cids.map(cid => `cid:${cid}:tags`) : `cid:${cids}:tags`,
-            start,
-            stop
-        );
-    };
+    Topics.getCategoryTagsData = async function (cids, start, stop) {};
 
     async function getFromSet(set, start, stop) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/tags.js:266:44
 
     Topics.getCategoryTagsData = async function (cids, start, stop) {
         return await getFromSet(
-            Array.isArray(cids) ? cids.map(cid => `cid:${cid}:tags`) : `cid:${cids}:tags`,
+            Array.isArray(cids) ? cids.map(() => undefined) : `cid:${cids}:tags`,
             start,
             stop
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:266:72
 
     Topics.getCategoryTagsData = async function (cids, start, stop) {
         return await getFromSet(
-            Array.isArray(cids) ? cids.map(cid => `cid:${cid}:tags`) : `cid:${cids}:tags`,
+            Array.isArray(cids) ? cids.map(cid => `cid:${cid}:tags`) : ``,
             start,
             stop
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:272:49
         );
     };
 
-    async function getFromSet(set, start, stop) {
-        let tags;
-        if (Array.isArray(set)) {
-            tags = await db.getSortedSetRevUnion({
-                sets: set,
-                start,
-                stop,
-                withScores: true,
-            });
-        } else {
-            tags = await db.getSortedSetRevRangeWithScores(set, start, stop);
-        }
-
-        const payload = await plugins.hooks.fire('filter:tags.getAll', {
-            tags: tags,
-        });
-        return await Topics.getTagData(payload.tags);
-    }
+    async function getFromSet(set, start, stop) {}
 
     Topics.getTagData = async function (tags) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:274:33
 
     async function getFromSet(set, start, stop) {
         let tags;
-        if (Array.isArray(set)) {
-            tags = await db.getSortedSetRevUnion({
-                sets: set,
-                start,
-                stop,
-                withScores: true,
-            });
-        } else {
+        if (Array.isArray(set)) {} else {
             tags = await db.getSortedSetRevRangeWithScores(set, start, stop);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:274:13
 
     async function getFromSet(set, start, stop) {
         let tags;
-        if (Array.isArray(set)) {
+        if (false) {
             tags = await db.getSortedSetRevUnion({
                 sets: set,
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BooleanLiteral
src/topics/tags.js:279:29
                 sets: set,
                 start,
                 stop,
-                withScores: true,
+                withScores: false,
             });
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:281:16
                 stop,
                 withScores: true,
             });
-        } else {
-            tags = await db.getSortedSetRevRangeWithScores(set, start, stop);
-        }
+        } else {}
 
         const payload = await plugins.hooks.fire('filter:tags.getAll', {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:285:50
             tags = await db.getSortedSetRevRangeWithScores(set, start, stop);
         }
 
-        const payload = await plugins.hooks.fire('filter:tags.getAll', {
+        const payload = await plugins.hooks.fire("", {
             tags: tags,
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:291:47
         return await Topics.getTagData(payload.tags);
     }
 
-    Topics.getTagData = async function (tags) {
-        if (!tags.length) {
-            return [];
-        }
-        tags.forEach((tag) => {
-            tag.valueEscaped = validator.escape(String(tag.value));
-            tag.valueEncoded = encodeURIComponent(tag.valueEscaped);
-            tag.class = tag.valueEscaped.replace(/\s/g, '-');
-        });
-        return tags;
-    };
+    Topics.getTagData = async function (tags) {};
 
     Topics.getTopicTags = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tags.js:292:13
     }
 
     Topics.getTagData = async function (tags) {
-        if (!tags.length) {
+        if (tags.length) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:292:27
     }
 
     Topics.getTagData = async function (tags) {
-        if (!tags.length) {
-            return [];
-        }
+        if (!tags.length) {}
         tags.forEach((tag) => {
             tag.valueEscaped = validator.escape(String(tag.value));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:295:31
         if (!tags.length) {
             return [];
         }
-        tags.forEach((tag) => {
-            tag.valueEscaped = validator.escape(String(tag.value));
-            tag.valueEncoded = encodeURIComponent(tag.valueEscaped);
-            tag.class = tag.valueEscaped.replace(/\s/g, '-');
-        });
+        tags.forEach((tag) => {});
         return tags;
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:303:48
         return tags;
     };
 
-    Topics.getTopicTags = async function (tid) {
-        const data = await Topics.getTopicsTags([tid]);
-        return data && data[0];
-    };
+    Topics.getTopicTags = async function (tid) {};
 
     Topics.getTopicsTags = async function (tids) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/tags.js:305:16
 
     Topics.getTopicTags = async function (tid) {
         const data = await Topics.getTopicsTags([tid]);
-        return data && data[0];
+        return true;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:305:16
 
     Topics.getTopicTags = async function (tid) {
         const data = await Topics.getTopicsTags([tid]);
-        return data && data[0];
+        return false;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:308:50
         return data && data[0];
     };
 
-    Topics.getTopicsTags = async function (tids) {
-        const topicTagData = await Topics.getTopicsFields(tids, ['tags']);
-        return tids.map((tid, i) => topicTagData[i].tags.map(tagData => tagData.value));
-    };
+    Topics.getTopicsTags = async function (tids) {};
 
     Topics.getTopicTagsObjects = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/tags.js:309:65
     };
 
     Topics.getTopicsTags = async function (tids) {
-        const topicTagData = await Topics.getTopicsFields(tids, ['tags']);
+        const topicTagData = await Topics.getTopicsFields(tids, []);
         return tids.map((tid, i) => topicTagData[i].tags.map(tagData => tagData.value));
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:310:25
 
     Topics.getTopicsTags = async function (tids) {
         const topicTagData = await Topics.getTopicsFields(tids, ['tags']);
-        return tids.map((tid, i) => topicTagData[i].tags.map(tagData => tagData.value));
+        return tids.map(() => undefined);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:310:62
 
     Topics.getTopicsTags = async function (tids) {
         const topicTagData = await Topics.getTopicsFields(tids, ['tags']);
-        return tids.map((tid, i) => topicTagData[i].tags.map(tagData => tagData.value));
+        return tids.map((tid, i) => topicTagData[i].tags.map(() => undefined));
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:313:55
         return tids.map((tid, i) => topicTagData[i].tags.map(tagData => tagData.value));
     };
 
-    Topics.getTopicTagsObjects = async function (tid) {
-        const data = await Topics.getTopicsTagsObjects([tid]);
-        return Array.isArray(data) && data.length ? data[0] : [];
-    };
+    Topics.getTopicTagsObjects = async function (tid) {};
 
     Topics.getTopicsTagsObjects = async function (tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/tags.js:314:56
     };
 
     Topics.getTopicTagsObjects = async function (tid) {
-        const data = await Topics.getTopicsTagsObjects([tid]);
+        const data = await Topics.getTopicsTagsObjects([]);
         return Array.isArray(data) && data.length ? data[0] : [];
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:315:16
 
     Topics.getTopicTagsObjects = async function (tid) {
         const data = await Topics.getTopicsTagsObjects([tid]);
-        return Array.isArray(data) && data.length ? data[0] : [];
+        return true ? data[0] : [];
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/tags.js:315:16
 
     Topics.getTopicTagsObjects = async function (tid) {
         const data = await Topics.getTopicsTagsObjects([tid]);
-        return Array.isArray(data) && data.length ? data[0] : [];
+        return Array.isArray(data) || data.length ? data[0] : [];
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:318:57
         return Array.isArray(data) && data.length ? data[0] : [];
     };
 
-    Topics.getTopicsTagsObjects = async function (tids) {
-        const topicTags = await Topics.getTopicsTags(tids);
-        const uniqueTopicTags = _.uniq(_.flatten(topicTags));
-
-        const tags = uniqueTopicTags.map(tag => ({ value: tag }));
-        const tagData = await Topics.getTagData(tags);
-        const tagDataMap = _.zipObject(uniqueTopicTags, tagData);
-
-        topicTags.forEach((tags, index) => {
-            if (Array.isArray(tags)) {
-                topicTags[index] = tags.map(tag => tagDataMap[tag]);
-            }
-        });
-
-        return topicTags;
-    };
+    Topics.getTopicsTagsObjects = async function (tids) {};
 
     Topics.addTags = async function (tags, tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:322:42
         const topicTags = await Topics.getTopicsTags(tids);
         const uniqueTopicTags = _.uniq(_.flatten(topicTags));
 
-        const tags = uniqueTopicTags.map(tag => ({ value: tag }));
+        const tags = uniqueTopicTags.map(() => undefined);
         const tagData = await Topics.getTagData(tags);
         const tagDataMap = _.zipObject(uniqueTopicTags, tagData);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:326:44
         const tagData = await Topics.getTagData(tags);
         const tagDataMap = _.zipObject(uniqueTopicTags, tagData);
 
-        topicTags.forEach((tags, index) => {
-            if (Array.isArray(tags)) {
-                topicTags[index] = tags.map(tag => tagDataMap[tag]);
-            }
-        });
+        topicTags.forEach((tags, index) => {});
 
         return topicTags;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:327:17
         const tagDataMap = _.zipObject(uniqueTopicTags, tagData);
 
         topicTags.forEach((tags, index) => {
-            if (Array.isArray(tags)) {
+            if (true) {
                 topicTags[index] = tags.map(tag => tagDataMap[tag]);
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/tags.js:327:17
         const tagDataMap = _.zipObject(uniqueTopicTags, tagData);
 
         topicTags.forEach((tags, index) => {
-            if (Array.isArray(tags)) {
+            if (false) {
                 topicTags[index] = tags.map(tag => tagDataMap[tag]);
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:328:45
 
         topicTags.forEach((tags, index) => {
             if (Array.isArray(tags)) {
-                topicTags[index] = tags.map(tag => tagDataMap[tag]);
+                topicTags[index] = tags.map(() => undefined);
             }
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:335:50
         return topicTags;
     };
 
-    Topics.addTags = async function (tags, tids) {
-        const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'timestamp', 'tags']);
-        const bulkAdd = [];
-        const bulkSet = [];
-        topicData.forEach((t) => {
-            const topicTags = t.tags.map(tagItem => tagItem.value);
-            tags.forEach((tag) => {
-                bulkAdd.push([`tag:${tag}:topics`, t.timestamp, t.tid]);
-                bulkAdd.push([`cid:${t.cid}:tag:${tag}:topics`, t.timestamp, t.tid]);
-                if (!topicTags.includes(tag)) {
-                    topicTags.push(tag);
-                }
-            });
-            bulkSet.push([`topic:${t.tid}`, { tags: topicTags.join(',') }]);
-        });
-        await Promise.all([
-            db.sortedSetAddBulk(bulkAdd),
-            db.setObjectBulk(bulkSet),
-        ]);
-
-        await Promise.all(tags.map(updateTagCount));
-        await Topics.updateCategoryTagsCount(_.uniq(topicData.map(t => t.cid)), tags);
-    };
+    Topics.addTags = async function (tags, tids) {};
 
     Topics.removeTags = async function (tags, tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:336:77
     };
 
     Topics.addTags = async function (tags, tids) {
-        const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'timestamp', 'tags']);
+        const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', "", 'tags']);
         const bulkAdd = [];
         const bulkSet = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:336:63
     };
 
     Topics.addTags = async function (tags, tids) {
-        const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'timestamp', 'tags']);
+        const topicData = await Topics.getTopicsFields(tids, ["", 'cid', 'timestamp', 'tags']);
         const bulkAdd = [];
         const bulkSet = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/tags.js:337:25
 
     Topics.addTags = async function (tags, tids) {
         const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'timestamp', 'tags']);
-        const bulkAdd = [];
+        const bulkAdd = ["Stryker was here"];
         const bulkSet = [];
         topicData.forEach((t) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:339:34
         const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'timestamp', 'tags']);
         const bulkAdd = [];
         const bulkSet = [];
-        topicData.forEach((t) => {
-            const topicTags = t.tags.map(tagItem => tagItem.value);
-            tags.forEach((tag) => {
-                bulkAdd.push([`tag:${tag}:topics`, t.timestamp, t.tid]);
-                bulkAdd.push([`cid:${t.cid}:tag:${tag}:topics`, t.timestamp, t.tid]);
-                if (!topicTags.includes(tag)) {
-                    topicTags.push(tag);
-                }
-            });
-            bulkSet.push([`topic:${t.tid}`, { tags: topicTags.join(',') }]);
-        });
+        topicData.forEach((t) => {});
         await Promise.all([
             db.sortedSetAddBulk(bulkAdd),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:340:42
         const bulkAdd = [];
         const bulkSet = [];
         topicData.forEach((t) => {
-            const topicTags = t.tags.map(tagItem => tagItem.value);
+            const topicTags = t.tags.map(() => undefined);
             tags.forEach((tag) => {
                 bulkAdd.push([`tag:${tag}:topics`, t.timestamp, t.tid]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:341:35
         const bulkSet = [];
         topicData.forEach((t) => {
             const topicTags = t.tags.map(tagItem => tagItem.value);
-            tags.forEach((tag) => {
-                bulkAdd.push([`tag:${tag}:topics`, t.timestamp, t.tid]);
-                bulkAdd.push([`cid:${t.cid}:tag:${tag}:topics`, t.timestamp, t.tid]);
-                if (!topicTags.includes(tag)) {
-                    topicTags.push(tag);
-                }
-            });
+            tags.forEach((tag) => {});
             bulkSet.push([`topic:${t.tid}`, { tags: topicTags.join(',') }]);
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:344:21
             tags.forEach((tag) => {
                 bulkAdd.push([`tag:${tag}:topics`, t.timestamp, t.tid]);
                 bulkAdd.push([`cid:${t.cid}:tag:${tag}:topics`, t.timestamp, t.tid]);
-                if (!topicTags.includes(tag)) {
+                if (true) {
                     topicTags.push(tag);
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:344:47
             tags.forEach((tag) => {
                 bulkAdd.push([`tag:${tag}:topics`, t.timestamp, t.tid]);
                 bulkAdd.push([`cid:${t.cid}:tag:${tag}:topics`, t.timestamp, t.tid]);
-                if (!topicTags.includes(tag)) {
-                    topicTags.push(tag);
-                }
+                if (!topicTags.includes(tag)) {}
             });
             bulkSet.push([`topic:${t.tid}`, { tags: topicTags.join(',') }]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/tags.js:348:26
                     topicTags.push(tag);
                 }
             });
-            bulkSet.push([`topic:${t.tid}`, { tags: topicTags.join(',') }]);
+            bulkSet.push([]);
         });
         await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tags.js:356:67
         ]);
 
         await Promise.all(tags.map(updateTagCount));
-        await Topics.updateCategoryTagsCount(_.uniq(topicData.map(t => t.cid)), tags);
+        await Topics.updateCategoryTagsCount(_.uniq(topicData.map(() => undefined)), tags);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:359:53
         await Topics.updateCategoryTagsCount(_.uniq(topicData.map(t => t.cid)), tags);
     };
 
-    Topics.removeTags = async function (tags, tids) {
-        const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'tags']);
-        const bulkRemove = [];
-        const bulkSet = [];
-
-        topicData.forEach((t) => {
-            const topicTags = t.tags.map(tagItem => tagItem.value);
-            tags.forEach((tag) => {
-                bulkRemove.push([`tag:${tag}:topics`, t.tid]);
-                bulkRemove.push([`cid:${t.cid}:tag:${tag}:topics`, t.tid]);
-                if (topicTags.includes(tag)) {
-                    topicTags.splice(topicTags.indexOf(tag), 1);
-                }
-            });
-            bulkSet.push([`topic:${t.tid}`, { tags: topicTags.join(',') }]);
-        });
-        await Promise.all([
-            db.sortedSetRemoveBulk(bulkRemove),
-            db.setObjectBulk(bulkSet),
-        ]);
-
-        await Promise.all(tags.map(updateTagCount));
-        await Topics.updateCategoryTagsCount(_.uniq(topicData.map(t => t.cid)), tags);
-    };
+    Topics.removeTags = async function (tags, tids) {};
 
     Topics.updateTopicTags = async function (tid, tags) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:360:70
     };
 
     Topics.removeTags = async function (tags, tids) {
-        const topicData = await Topics.getTopicsFields(tids, ['tid', 'cid', 'tags']);
+        const topicData = await Topics.getTopicsFields(tids, ['tid', "", 'tags']);
         const bulkRemove = [];
         const bulkSet = [];
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tags.js:364:34
         const bulkRemove = [];
         const bulkSet = [];
 
-        topicData.forEach((t) => {
-            const topicTags = t.tags.map(tagItem => tagItem.value);
-            tags.forEach((tag) => {
-                bulkRemove.push([`tag:${tag}:topics`, t.tid]);
-                bulkRemove.push([`cid:${t.cid}:tag:${tag}:topics`, t.tid]);
-                if (topicTags.includes(tag)) {
-                    topicTags.splice(topicTags.indexOf(tag), 1);
-                }
-            });
-            bulkSet.push([`topic:${t.tid}`, { tags: topicTags.join(',') }]);
-        });
+        topicData.forEach((t) => {});
         await Promise.all([
             db.sortedSetRemoveBulk(bulkRemove),
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/tags.js:366:35
 
         topicData.forEach((t) => {
             const topicTags = t.tags.map(tagItem => tagItem.value);
-            tags.forEach((tag) => {
-                bulkRemove.push([`tag:${tag}:topics`, t.tid]);
-                bulkRemove.push([`cid:${t.cid}:tag:${tag}:topics`, t.tid]);
-                if (topicTags.includes(tag)) {
-                    topicTags.splice(topicTags.indexOf(tag), 1);
-                }
-            });
+            tags.forEach((tag) => {});
             bulkSet.push([`topic:${t.tid}`, { tags: topicTags.join(',') }]);
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tags.js:367:34
         topicData.forEach((t) => {
             const topicTags = t.tags.map(tagItem => tagItem.value);
             tags.forEach((tag) => {
-                bulkRemove.push([`tag:${tag}:topics`, t.tid]);
+                bulkRemove.push([``, t.tid]);
                 bulkRemove.push([`cid:${t.cid}:tag:${tag}:topics`, t.tid]);
                 if (topicTags.includes(tag)) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tags.js:369:21
             tags.forEach((tag) => {
                 bulkRemove.push([`tag:${tag}:topics`, t.tid]);
                 bulkRemove.push([`cid:${t.cid}:tag:${tag}:topics`, t.tid]);
-                if (topicTags.includes(tag)) {
+                if (true) {
                     topicTags.splice(topicTags.indexOf(tag), 1);
                 }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
