[Killed] BlockStatement
src/topics/tools.js:18:51
     const topicTools = {};
     Topics.tools = topicTools;
 
-    topicTools.delete = async function (tid, uid) {
-        return await toggleDelete(tid, uid, true);
-    };
+    topicTools.delete = async function (tid, uid) {};
 
     topicTools.restore = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tools.js:19:45
     Topics.tools = topicTools;
 
     topicTools.delete = async function (tid, uid) {
-        return await toggleDelete(tid, uid, true);
+        return await toggleDelete(tid, uid, false);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:22:52
         return await toggleDelete(tid, uid, true);
     };
 
-    topicTools.restore = async function (tid, uid) {
-        return await toggleDelete(tid, uid, false);
-    };
+    topicTools.restore = async function (tid, uid) {};
 
     async function toggleDelete(tid, uid, isDelete) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tools.js:23:45
     };
 
     topicTools.restore = async function (tid, uid) {
-        return await toggleDelete(tid, uid, false);
+        return await toggleDelete(tid, uid, true);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:28:13
 
     async function toggleDelete(tid, uid, isDelete) {
         const topicData = await Topics.getTopicData(tid);
-        if (!topicData) {
+        if (false) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:28:13
 
     async function toggleDelete(tid, uid, isDelete) {
         const topicData = await Topics.getTopicData(tid);
-        if (!topicData) {
+        if (true) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/tools.js:32:34
             throw new Error('[[error:no-topic]]');
         }
         // Scheduled topics can only be purged
-        if (topicData.scheduled) {
-            throw new Error('[[error:invalid-data]]');
-        }
+        if (topicData.scheduled) {}
         const canDelete = await privileges.topics.canDelete(tid, uid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:32:13
             throw new Error('[[error:no-topic]]');
         }
         // Scheduled topics can only be purged
-        if (topicData.scheduled) {
+        if (true) {
             throw new Error('[[error:invalid-data]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tools.js:37:44
         }
         const canDelete = await privileges.topics.canDelete(tid, uid);
 
-        const hook = isDelete ? 'delete' : 'restore';
+        const hook = isDelete ? 'delete' : "";
         const data = await plugins.hooks.fire(`filter:topic.${hook}`, { topicData: topicData, uid: uid, isDelete: isDelete, canDelete: canDelete, canRestore: canDelete });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tools.js:40:72
         const hook = isDelete ? 'delete' : 'restore';
         const data = await plugins.hooks.fire(`filter:topic.${hook}`, { topicData: topicData, uid: uid, isDelete: isDelete, canDelete: canDelete, canRestore: canDelete });
 
-        if ((!data.canDelete && data.isDelete) || (!data.canRestore && !data.isDelete)) {
+        if ((!data.canDelete && data.isDelete) || (!data.canRestore && data.isDelete)) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:40:13
         const hook = isDelete ? 'delete' : 'restore';
         const data = await plugins.hooks.fire(`filter:topic.${hook}`, { topicData: topicData, uid: uid, isDelete: isDelete, canDelete: canDelete, canRestore: canDelete });
 
-        if ((!data.canDelete && data.isDelete) || (!data.canRestore && !data.isDelete)) {
+        if (true) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:43:13
         if ((!data.canDelete && data.isDelete) || (!data.canRestore && !data.isDelete)) {
             throw new Error('[[error:no-privileges]]');
         }
-        if (data.topicData.deleted && data.isDelete) {
+        if (true) {
             throw new Error('[[error:topic-already-deleted]]');
         } else if (!data.topicData.deleted && !data.isDelete) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:43:13
         if ((!data.canDelete && data.isDelete) || (!data.canRestore && !data.isDelete)) {
             throw new Error('[[error:no-privileges]]');
         }
-        if (data.topicData.deleted && data.isDelete) {
+        if (false) {
             throw new Error('[[error:topic-already-deleted]]');
         } else if (!data.topicData.deleted && !data.isDelete) {
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BooleanLiteral
src/topics/tools.js:45:20
         }
         if (data.topicData.deleted && data.isDelete) {
             throw new Error('[[error:topic-already-deleted]]');
-        } else if (!data.topicData.deleted && !data.isDelete) {
+        } else if (data.topicData.deleted && !data.isDelete) {
             throw new Error('[[error:topic-already-restored]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:45:20
         }
         if (data.topicData.deleted && data.isDelete) {
             throw new Error('[[error:topic-already-deleted]]');
-        } else if (!data.topicData.deleted && !data.isDelete) {
+        } else if (false) {
             throw new Error('[[error:topic-already-restored]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:48:28
         } else if (!data.topicData.deleted && !data.isDelete) {
             throw new Error('[[error:topic-already-restored]]');
         }
-        if (data.isDelete) {
-            await Topics.delete(data.topicData.tid, data.uid);
-        } else {
+        if (data.isDelete) {} else {
             await Topics.restore(data.topicData.tid);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:48:13
         } else if (!data.topicData.deleted && !data.isDelete) {
             throw new Error('[[error:topic-already-restored]]');
         }
-        if (data.isDelete) {
+        if (false) {
             await Topics.delete(data.topicData.tid, data.uid);
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:50:16
         }
         if (data.isDelete) {
             await Topics.delete(data.topicData.tid, data.uid);
-        } else {
-            await Topics.restore(data.topicData.tid);
-        }
+        } else {}
         const events = await Topics.events.log(tid, { type: isDelete ? 'delete' : 'restore', uid });
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tools.js:53:83
         } else {
             await Topics.restore(data.topicData.tid);
         }
-        const events = await Topics.events.log(tid, { type: isDelete ? 'delete' : 'restore', uid });
+        const events = await Topics.events.log(tid, { type: isDelete ? 'delete' : "", uid });
 
         data.topicData.deleted = data.isDelete ? 1 : 0;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tools.js:53:72
         } else {
             await Topics.restore(data.topicData.tid);
         }
-        const events = await Topics.events.log(tid, { type: isDelete ? 'delete' : 'restore', uid });
+        const events = await Topics.events.log(tid, { type: isDelete ? "" : 'restore', uid });
 
         data.topicData.deleted = data.isDelete ? 1 : 0;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:57:13
 
         data.topicData.deleted = data.isDelete ? 1 : 0;
 
-        if (data.isDelete) {
+        if (true) {
             plugins.hooks.fire('action:topic.delete', { topic: data.topicData, uid: data.uid });
         } else {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:57:28
 
         data.topicData.deleted = data.isDelete ? 1 : 0;
 
-        if (data.isDelete) {
-            plugins.hooks.fire('action:topic.delete', { topic: data.topicData, uid: data.uid });
-        } else {
+        if (data.isDelete) {} else {
             plugins.hooks.fire('action:topic.restore', { topic: data.topicData, uid: data.uid });
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/tools.js:59:16
 
         if (data.isDelete) {
             plugins.hooks.fire('action:topic.delete', { topic: data.topicData, uid: data.uid });
-        } else {
-            plugins.hooks.fire('action:topic.restore', { topic: data.topicData, uid: data.uid });
-        }
+        } else {}
         const userData = await user.getUserFields(data.uid, ['username', 'userslug']);
         return {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/tools.js:60:56
         if (data.isDelete) {
             plugins.hooks.fire('action:topic.delete', { topic: data.topicData, uid: data.uid });
         } else {
-            plugins.hooks.fire('action:topic.restore', { topic: data.topicData, uid: data.uid });
+            plugins.hooks.fire('action:topic.restore', {});
         }
         const userData = await user.getUserFields(data.uid, ['username', 'userslug']);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tools.js:62:74
         } else {
             plugins.hooks.fire('action:topic.restore', { topic: data.topicData, uid: data.uid });
         }
-        const userData = await user.getUserFields(data.uid, ['username', 'userslug']);
+        const userData = await user.getUserFields(data.uid, ['username', ""]);
         return {
             tid: data.topicData.tid,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tools.js:62:62
         } else {
             plugins.hooks.fire('action:topic.restore', { topic: data.topicData, uid: data.uid });
         }
-        const userData = await user.getUserFields(data.uid, ['username', 'userslug']);
+        const userData = await user.getUserFields(data.uid, ["", 'userslug']);
         return {
             tid: data.topicData.tid,
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ObjectLiteral
src/topics/tools.js:63:16
             plugins.hooks.fire('action:topic.restore', { topic: data.topicData, uid: data.uid });
         }
         const userData = await user.getUserFields(data.uid, ['username', 'userslug']);
-        return {
-            tid: data.topicData.tid,
-            cid: data.topicData.cid,
-            isDelete: data.isDelete,
-            uid: data.uid,
-            user: userData,
-            events,
-        };
+        return {};
     }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:73:50
         };
     }
 
-    topicTools.purge = async function (tid, uid) {
-        const topicData = await Topics.getTopicData(tid);
-        if (!topicData) {
-            throw new Error('[[error:no-topic]]');
-        }
-        const canPurge = await privileges.topics.canPurge(tid, uid);
-        if (!canPurge) {
-            throw new Error('[[error:no-privileges]]');
-        }
-
-        await Topics.purgePostsAndTopic(tid, uid);
-        return { tid: tid, cid: topicData.cid, uid: uid };
-    };
+    topicTools.purge = async function (tid, uid) {};
 
     topicTools.lock = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:79:13
             throw new Error('[[error:no-topic]]');
         }
         const canPurge = await privileges.topics.canPurge(tid, uid);
-        if (!canPurge) {
+        if (true) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/tools.js:79:13
             throw new Error('[[error:no-topic]]');
         }
         const canPurge = await privileges.topics.canPurge(tid, uid);
-        if (!canPurge) {
+        if (false) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:87:49
         return { tid: tid, cid: topicData.cid, uid: uid };
     };
 
-    topicTools.lock = async function (tid, uid) {
-        return await toggleLock(tid, uid, true);
-    };
+    topicTools.lock = async function (tid, uid) {};
 
     topicTools.unlock = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tools.js:88:43
     };
 
     topicTools.lock = async function (tid, uid) {
-        return await toggleLock(tid, uid, true);
+        return await toggleLock(tid, uid, false);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:91:51
         return await toggleLock(tid, uid, true);
     };
 
-    topicTools.unlock = async function (tid, uid) {
-        return await toggleLock(tid, uid, false);
-    };
+    topicTools.unlock = async function (tid, uid) {};
 
     async function toggleLock(tid, uid, lock) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tools.js:92:43
     };
 
     topicTools.unlock = async function (tid, uid) {
-        return await toggleLock(tid, uid, false);
+        return await toggleLock(tid, uid, true);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:95:47
         return await toggleLock(tid, uid, false);
     };
 
-    async function toggleLock(tid, uid, lock) {
-        const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
-        if (!topicData || !topicData.cid) {
-            throw new Error('[[error:no-topic]]');
-        }
-        const isAdminOrMod = await privileges.categories.isAdminOrMod(topicData.cid, uid);
-        if (!isAdminOrMod) {
-            throw new Error('[[error:no-privileges]]');
-        }
-        await Topics.setTopicField(tid, 'locked', lock ? 1 : 0);
-        topicData.events = await Topics.events.log(tid, { type: lock ? 'lock' : 'unlock', uid });
-        topicData.isLocked = lock; // deprecate in v2.0
-        topicData.locked = lock;
-
-        plugins.hooks.fire('action:topic.lock', { topic: _.clone(topicData), uid: uid });
-        return topicData;
-    }
+    async function toggleLock(tid, uid, lock) {}
 
     topicTools.pin = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tools.js:96:68
     };
 
     async function toggleLock(tid, uid, lock) {
-        const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
+        const topicData = await Topics.getTopicFields(tid, ['tid', "", 'cid']);
         if (!topicData || !topicData.cid) {
             throw new Error('[[error:no-topic]]');
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/tools.js:96:75
     };
 
     async function toggleLock(tid, uid, lock) {
-        const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
+        const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', ""]);
         if (!topicData || !topicData.cid) {
             throw new Error('[[error:no-topic]]');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/tools.js:97:13
 
     async function toggleLock(tid, uid, lock) {
         const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
-        if (!topicData || !topicData.cid) {
+        if (!topicData && !topicData.cid) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:97:13
 
     async function toggleLock(tid, uid, lock) {
         const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
-        if (!topicData || !topicData.cid) {
+        if (true) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:101:13
             throw new Error('[[error:no-topic]]');
         }
         const isAdminOrMod = await privileges.categories.isAdminOrMod(topicData.cid, uid);
-        if (!isAdminOrMod) {
+        if (false) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:101:13
             throw new Error('[[error:no-topic]]');
         }
         const isAdminOrMod = await privileges.categories.isAdminOrMod(topicData.cid, uid);
-        if (!isAdminOrMod) {
+        if (true) {
             throw new Error('[[error:no-privileges]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tools.js:104:41
         if (!isAdminOrMod) {
             throw new Error('[[error:no-privileges]]');
         }
-        await Topics.setTopicField(tid, 'locked', lock ? 1 : 0);
+        await Topics.setTopicField(tid, "", lock ? 1 : 0);
         topicData.events = await Topics.events.log(tid, { type: lock ? 'lock' : 'unlock', uid });
         topicData.isLocked = lock; // deprecate in v2.0
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:113:48
         return topicData;
     }
 
-    topicTools.pin = async function (tid, uid) {
-        return await togglePin(tid, uid, true);
-    };
+    topicTools.pin = async function (tid, uid) {};
 
     topicTools.unpin = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tools.js:114:42
     }
 
     topicTools.pin = async function (tid, uid) {
-        return await togglePin(tid, uid, true);
+        return await togglePin(tid, uid, false);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/tools.js:117:50
         return await togglePin(tid, uid, true);
     };
 
-    topicTools.unpin = async function (tid, uid) {
-        return await togglePin(tid, uid, false);
-    };
+    topicTools.unpin = async function (tid, uid) {};
 
     topicTools.setPinExpiry = async (tid, expiry, uid) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/tools.js:118:42
     };
 
     topicTools.unpin = async function (tid, uid) {
-        return await togglePin(tid, uid, false);
+        return await togglePin(tid, uid, true);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BlockStatement
src/topics/tools.js:121:59
         return await togglePin(tid, uid, false);
     };
 
-    topicTools.setPinExpiry = async (tid, expiry, uid) => {
-        if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
-            throw new Error('[[error:invalid-data]]');
-        }
-
-        const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
-        const isAdminOrMod = await privileges.categories.isAdminOrMod(topicData.cid, uid);
-        if (!isAdminOrMod) {
-            throw new Error('[[error:no-privileges]]');
-        }
-
-        await Topics.setTopicField(tid, 'pinExpiry', expiry);
-        plugins.hooks.fire('action:topic.setPinExpiry', { topic: _.clone(topicData), uid: uid });
-    };
+    topicTools.setPinExpiry = async (tid, expiry, uid) => {};
 
     topicTools.checkPinExpiry = async (tids) => {

[NoCoverage] ConditionalExpression
src/topics/tools.js:122:13
     };
 
     topicTools.setPinExpiry = async (tid, expiry, uid) => {
-        if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
+        if (false) {
             throw new Error('[[error:invalid-data]]');
         }

[NoCoverage] BlockStatement
src/topics/tools.js:122:66
     };
 
     topicTools.setPinExpiry = async (tid, expiry, uid) => {
-        if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
-            throw new Error('[[error:invalid-data]]');
-        }
+        if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {}
 
         const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);

[NoCoverage] StringLiteral
src/topics/tools.js:126:68
             throw new Error('[[error:invalid-data]]');
         }
 
-        const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
+        const topicData = await Topics.getTopicFields(tid, ['tid', "", 'cid']);
         const isAdminOrMod = await privileges.categories.isAdminOrMod(topicData.cid, uid);
         if (!isAdminOrMod) {

[NoCoverage] StringLiteral
src/topics/tools.js:126:61
             throw new Error('[[error:invalid-data]]');
         }
 
-        const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
+        const topicData = await Topics.getTopicFields(tid, ["", 'uid', 'cid']);
         const isAdminOrMod = await privileges.categories.isAdminOrMod(topicData.cid, uid);
         if (!isAdminOrMod) {

[NoCoverage] BlockStatement
src/topics/tools.js:128:28
 
         const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
         const isAdminOrMod = await privileges.categories.isAdminOrMod(topicData.cid, uid);
-        if (!isAdminOrMod) {
-            throw new Error('[[error:no-privileges]]');
-        }
+        if (!isAdminOrMod) {}
 
         await Topics.setTopicField(tid, 'pinExpiry', expiry);

[Killed] BlockStatement
src/topics/tools.js:136:49
         plugins.hooks.fire('action:topic.setPinExpiry', { topic: _.clone(topicData), uid: uid });
     };
 
-    topicTools.checkPinExpiry = async (tids) => {
-        const expiry = (await topics.getTopicsFields(tids, ['pinExpiry'])).map(obj => obj.pinExpiry);
-        const now = Date.now();
-
-        tids = await Promise.all(tids.map(async (tid, idx) => {
-            if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
-                await togglePin(tid, 'system', false);
-                return null;
-            }
-
-            return tid;
-        }));
-
-        return tids.filter(Boolean);
-    };
+    topicTools.checkPinExpiry = async (tids) => {};
 
     async function togglePin(tid, uid, pin) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/tools.js:137:80
     };
 
     topicTools.checkPinExpiry = async (tids) => {
-        const expiry = (await topics.getTopicsFields(tids, ['pinExpiry'])).map(obj => obj.pinExpiry);
+        const expiry = (await topics.getTopicsFields(tids, ['pinExpiry'])).map(() => undefined);
         const now = Date.now();
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/tools.js:137:61
     };
 
     topicTools.checkPinExpiry = async (tids) => {
-        const expiry = (await topics.getTopicsFields(tids, ['pinExpiry'])).map(obj => obj.pinExpiry);
+        const expiry = (await topics.getTopicsFields(tids, [""])).map(obj => obj.pinExpiry);
         const now = Date.now();
 
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BlockStatement
src/topics/tools.js:140:63
         const expiry = (await topics.getTopicsFields(tids, ['pinExpiry'])).map(obj => obj.pinExpiry);
         const now = Date.now();
 
-        tids = await Promise.all(tids.map(async (tid, idx) => {
-            if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
-                await togglePin(tid, 'system', false);
-                return null;
-            }
-
-            return tid;
-        }));
+        tids = await Promise.all(tids.map(async (tid, idx) => {}));
 
         return tids.filter(Boolean);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/tools.js:141:17
         const now = Date.now();
 
         tids = await Promise.all(tids.map(async (tid, idx) => {
-            if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
+            if (expiry[idx] || parseInt(expiry[idx], 10) <= now) {
                 await togglePin(tid, 'system', false);
                 return null;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/tools.js:141:17
         const now = Date.now();
 
         tids = await Promise.all(tids.map(async (tid, idx) => {
-            if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
+            if (false) {
                 await togglePin(tid, 'system', false);
                 return null;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BooleanLiteral
src/topics/tools.js:142:48
 
         tids = await Promise.all(tids.map(async (tid, idx) => {
             if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
-                await togglePin(tid, 'system', false);
+                await togglePin(tid, 'system', true);
                 return null;
             }
