[Killed] BooleanLiteral
src/topics/unread.js:225:13
 
     async function doesTidHaveUnblockedUnreadPosts(tid, params) {
         const { userLastReadTimestamp } = params;
-        if (!userLastReadTimestamp) {
+        if (userLastReadTimestamp) {
             return true;
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/unread.js:225:13
 
     async function doesTidHaveUnblockedUnreadPosts(tid, params) {
         const { userLastReadTimestamp } = params;
-        if (!userLastReadTimestamp) {
+        if (true) {
             return true;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:226:20
     async function doesTidHaveUnblockedUnreadPosts(tid, params) {
         const { userLastReadTimestamp } = params;
         if (!userLastReadTimestamp) {
-            return true;
+            return false;
         }
         let start = 0;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:230:20
         }
         let start = 0;
         const count = 3;
-        let done = false;
+        let done = true;
         let hasUnblockedUnread = params.topicTimestamp > userLastReadTimestamp;
         if (!params.blockedUids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/unread.js:231:34
         let start = 0;
         const count = 3;
         let done = false;
-        let hasUnblockedUnread = params.topicTimestamp > userLastReadTimestamp;
+        let hasUnblockedUnread = params.topicTimestamp >= userLastReadTimestamp;
         if (!params.blockedUids.length) {
             return hasUnblockedUnread;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:231:34
         let start = 0;
         const count = 3;
         let done = false;
-        let hasUnblockedUnread = params.topicTimestamp > userLastReadTimestamp;
+        let hasUnblockedUnread = true;
         if (!params.blockedUids.length) {
             return hasUnblockedUnread;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:232:13
         const count = 3;
         let done = false;
         let hasUnblockedUnread = params.topicTimestamp > userLastReadTimestamp;
-        if (!params.blockedUids.length) {
+        if (false) {
             return hasUnblockedUnread;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:232:41
         const count = 3;
         let done = false;
         let hasUnblockedUnread = params.topicTimestamp > userLastReadTimestamp;
-        if (!params.blockedUids.length) {
-            return hasUnblockedUnread;
-        }
+        if (!params.blockedUids.length) {}
         while (!done) {
             /* eslint-disable no-await-in-loop */
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:235:23
         if (!params.blockedUids.length) {
             return hasUnblockedUnread;
         }
-        while (!done) {
-            /* eslint-disable no-await-in-loop */
-            const pidsSinceLastVisit = await db.getSortedSetRangeByScore(`tid:${tid}:posts`, start, count, userLastReadTimestamp, '+inf');
-            if (!pidsSinceLastVisit.length) {
-                return hasUnblockedUnread;
-            }
-            let postData = await posts.getPostsFields(pidsSinceLastVisit, ['pid', 'uid']);
-            postData = postData.filter(post => !params.blockedUids.includes(parseInt(post.uid, 10)));
-
-            done = postData.length > 0;
-            hasUnblockedUnread = postData.length > 0;
-            start += count;
-        }
+        while (!done) {}
         return hasUnblockedUnread;
     }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:235:16
         if (!params.blockedUids.length) {
             return hasUnblockedUnread;
         }
-        while (!done) {
+        while (done) {
             /* eslint-disable no-await-in-loop */
             const pidsSinceLastVisit = await db.getSortedSetRangeByScore(`tid:${tid}:posts`, start, count, userLastReadTimestamp, '+inf');
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:238:17
         while (!done) {
             /* eslint-disable no-await-in-loop */
             const pidsSinceLastVisit = await db.getSortedSetRangeByScore(`tid:${tid}:posts`, start, count, userLastReadTimestamp, '+inf');
-            if (!pidsSinceLastVisit.length) {
+            if (pidsSinceLastVisit.length) {
                 return hasUnblockedUnread;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:238:45
         while (!done) {
             /* eslint-disable no-await-in-loop */
             const pidsSinceLastVisit = await db.getSortedSetRangeByScore(`tid:${tid}:posts`, start, count, userLastReadTimestamp, '+inf');
-            if (!pidsSinceLastVisit.length) {
-                return hasUnblockedUnread;
-            }
+            if (!pidsSinceLastVisit.length) {}
             let postData = await posts.getPostsFields(pidsSinceLastVisit, ['pid', 'uid']);
             postData = postData.filter(post => !params.blockedUids.includes(parseInt(post.uid, 10)));
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/unread.js:242:40
                 return hasUnblockedUnread;
             }
             let postData = await posts.getPostsFields(pidsSinceLastVisit, ['pid', 'uid']);
-            postData = postData.filter(post => !params.blockedUids.includes(parseInt(post.uid, 10)));
+            postData = postData.filter(() => undefined);
 
             done = postData.length > 0;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:242:48
                 return hasUnblockedUnread;
             }
             let postData = await posts.getPostsFields(pidsSinceLastVisit, ['pid', 'uid']);
-            postData = postData.filter(post => !params.blockedUids.includes(parseInt(post.uid, 10)));
+            postData = postData.filter(post => params.blockedUids.includes(parseInt(post.uid, 10)));
 
             done = postData.length > 0;
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/unread.js:244:20
             let postData = await posts.getPostsFields(pidsSinceLastVisit, ['pid', 'uid']);
             postData = postData.filter(post => !params.blockedUids.includes(parseInt(post.uid, 10)));
 
-            done = postData.length > 0;
+            done = true;
             hasUnblockedUnread = postData.length > 0;
             start += count;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/unread.js:244:20
             let postData = await posts.getPostsFields(pidsSinceLastVisit, ['pid', 'uid']);
             postData = postData.filter(post => !params.blockedUids.includes(parseInt(post.uid, 10)));
 
-            done = postData.length > 0;
+            done = postData.length >= 0;
             hasUnblockedUnread = postData.length > 0;
             start += count;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/unread.js:245:34
             postData = postData.filter(post => !params.blockedUids.includes(parseInt(post.uid, 10)));
 
             done = postData.length > 0;
-            hasUnblockedUnread = postData.length > 0;
+            hasUnblockedUnread = postData.length <= 0;
             start += count;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:245:34
             postData = postData.filter(post => !params.blockedUids.includes(parseInt(post.uid, 10)));
 
             done = postData.length > 0;
-            hasUnblockedUnread = postData.length > 0;
+            hasUnblockedUnread = false;
             start += count;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] AssignmentOperator
src/topics/unread.js:246:13
 
             done = postData.length > 0;
             hasUnblockedUnread = postData.length > 0;
-            start += count;
+            start -= count;
         }
         return hasUnblockedUnread;
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:251:51
         return hasUnblockedUnread;
     }
 
-    Topics.pushUnreadCount = async function (uid) {
-        if (!uid || parseInt(uid, 10) <= 0) {
-            return;
-        }
-        const results = await Topics.getUnreadTids({ uid: uid, count: true });
-        require('../socket.io').in(`uid_${uid}`).emit('event:unread.updateCount', {
-            unreadTopicCount: results[''],
-            unreadNewTopicCount: results.new,
-            unreadWatchedTopicCount: results.watched,
-            unreadUnrepliedTopicCount: results.unreplied,
-        });
-    };
+    Topics.pushUnreadCount = async function (uid) {};
 
     Topics.markAsUnreadForAll = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/unread.js:252:21
     }
 
     Topics.pushUnreadCount = async function (uid) {
-        if (!uid || parseInt(uid, 10) <= 0) {
+        if (!uid || parseInt(uid, 10) > 0) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ConditionalExpression
src/topics/unread.js:252:21
     }
 
     Topics.pushUnreadCount = async function (uid) {
-        if (!uid || parseInt(uid, 10) <= 0) {
+        if (!uid || false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:255:71
         if (!uid || parseInt(uid, 10) <= 0) {
             return;
         }
-        const results = await Topics.getUnreadTids({ uid: uid, count: true });
+        const results = await Topics.getUnreadTids({ uid: uid, count: false });
         require('../socket.io').in(`uid_${uid}`).emit('event:unread.updateCount', {
             unreadTopicCount: results[''],
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/unread.js:255:52
         if (!uid || parseInt(uid, 10) <= 0) {
             return;
         }
-        const results = await Topics.getUnreadTids({ uid: uid, count: true });
+        const results = await Topics.getUnreadTids({});
         require('../socket.io').in(`uid_${uid}`).emit('event:unread.updateCount', {
             unreadTopicCount: results[''],
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/unread.js:256:36
             return;
         }
         const results = await Topics.getUnreadTids({ uid: uid, count: true });
-        require('../socket.io').in(`uid_${uid}`).emit('event:unread.updateCount', {
+        require('../socket.io').in(``).emit('event:unread.updateCount', {
             unreadTopicCount: results[''],
             unreadNewTopicCount: results.new,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ObjectLiteral
src/topics/unread.js:256:83
             return;
         }
         const results = await Topics.getUnreadTids({ uid: uid, count: true });
-        require('../socket.io').in(`uid_${uid}`).emit('event:unread.updateCount', {
-            unreadTopicCount: results[''],
-            unreadNewTopicCount: results.new,
-            unreadWatchedTopicCount: results.watched,
-            unreadUnrepliedTopicCount: results.unreplied,
-        });
+        require('../socket.io').in(`uid_${uid}`).emit('event:unread.updateCount', {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/unread.js:257:39
         }
         const results = await Topics.getUnreadTids({ uid: uid, count: true });
         require('../socket.io').in(`uid_${uid}`).emit('event:unread.updateCount', {
-            unreadTopicCount: results[''],
+            unreadTopicCount: results["Stryker was here!"],
             unreadNewTopicCount: results.new,
             unreadWatchedTopicCount: results.watched,
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:264:54
         });
     };
 
-    Topics.markAsUnreadForAll = async function (tid) {
-        await Topics.markCategoryUnreadForAll(tid);
-    };
+    Topics.markAsUnreadForAll = async function (tid) {};
 
     Topics.markAsRead = async function (tids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:269:13
     };
 
     Topics.markAsRead = async function (tids, uid) {
-        if (!Array.isArray(tids) || !tids.length) {
+        if (Array.isArray(tids) || !tids.length) {
             return false;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:269:13
     };
 
     Topics.markAsRead = async function (tids, uid) {
-        if (!Array.isArray(tids) || !tids.length) {
+        if (true) {
             return false;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:270:20
 
     Topics.markAsRead = async function (tids, uid) {
         if (!Array.isArray(tids) || !tids.length) {
-            return false;
+            return true;
         }
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/unread.js:273:43
             return false;
         }
 
-        tids = _.uniq(tids).filter(tid => tid && utils.isNumber(tid));
+        tids = _.uniq(tids).filter(tid => tid || utils.isNumber(tid));
 
         if (!tids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/unread.js:273:36
             return false;
         }
 
-        tids = _.uniq(tids).filter(tid => tid && utils.isNumber(tid));
+        tids = _.uniq(tids).filter(() => undefined);
 
         if (!tids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BooleanLiteral
src/topics/unread.js:276:20
         tids = _.uniq(tids).filter(tid => tid && utils.isNumber(tid));
 
         if (!tids.length) {
-            return false;
+            return true;
         }
         const [topicScores, userScores] = await Promise.all([

[Killed] StringLiteral
src/topics/unread.js:279:50
             return false;
         }
         const [topicScores, userScores] = await Promise.all([
-            Topics.getTopicsFields(tids, ['tid', 'lastposttime', 'scheduled']),
+            Topics.getTopicsFields(tids, ['tid', "", 'scheduled']),
             db.sortedSetScores(`uid:${uid}:tids_read`, tids),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/unread.js:279:42
             return false;
         }
         const [topicScores, userScores] = await Promise.all([
-            Topics.getTopicsFields(tids, ['tid', 'lastposttime', 'scheduled']),
+            Topics.getTopicsFields(tids, []),
             db.sortedSetScores(`uid:${uid}:tids_read`, tids),
         ]);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:283:53
             db.sortedSetScores(`uid:${uid}:tids_read`, tids),
         ]);
 
-        const topics = topicScores.filter((t, i) => t.lastposttime &&
-            (!userScores[i] || userScores[i] < t.lastposttime));
+        const topics = topicScores.filter((t, i) => false);
         tids = topics.map(t => t.tid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/unread.js:283:53
             db.sortedSetScores(`uid:${uid}:tids_read`, tids),
         ]);
 
-        const topics = topicScores.filter((t, i) => t.lastposttime &&
-            (!userScores[i] || userScores[i] < t.lastposttime));
+        const topics = topicScores.filter((t, i) => t.lastposttime || !userScores[i] || userScores[i] < t.lastposttime);
         tids = topics.map(t => t.tid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/unread.js:284:32
         ]);
 
         const topics = topicScores.filter((t, i) => t.lastposttime &&
-            (!userScores[i] || userScores[i] < t.lastposttime));
+            (!userScores[i] || userScores[i] >= t.lastposttime));
         tids = topics.map(t => t.tid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/unread.js:284:14
         ]);
 
         const topics = topicScores.filter((t, i) => t.lastposttime &&
-            (!userScores[i] || userScores[i] < t.lastposttime));
+            (!userScores[i] && userScores[i] < t.lastposttime));
         tids = topics.map(t => t.tid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/unread.js:285:27
 
         const topics = topicScores.filter((t, i) => t.lastposttime &&
             (!userScores[i] || userScores[i] < t.lastposttime));
-        tids = topics.map(t => t.tid);
+        tids = topics.map(() => undefined);
 
         if (!tids.length) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/unread.js:292:35
         }
 
         const now = Date.now();
-        const scores = topics.map(topic => (topic.scheduled ? topic.lastposttime : now));
+        const scores = topics.map(() => undefined);
         const [topicData] = await Promise.all([
             Topics.getTopicsFields(tids, ['cid']),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/unread.js:299:43
             db.sortedSetRemove(`uid:${uid}:tids_unread`, tids),
         ]);
 
-        const cids = _.uniq(topicData.map(t => t && t.cid).filter(Boolean));
+        const cids = _.uniq(topicData.map(() => undefined).filter(Boolean));
         await categories.markAsRead(cids, uid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] MethodExpression
src/topics/unread.js:299:29
             db.sortedSetRemove(`uid:${uid}:tids_unread`, tids),
         ]);
 
-        const cids = _.uniq(topicData.map(t => t && t.cid).filter(Boolean));
+        const cids = _.uniq(topicData.map(t => t && t.cid));
         await categories.markAsRead(cids, uid);
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:303:16
         await categories.markAsRead(cids, uid);
 
         plugins.hooks.fire('action:topics.markAsRead', { uid: uid, tids: tids });
-        return true;
+        return false;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:306:47
         return true;
     };
 
-    Topics.markAllRead = async function (uid) {
-        const cutoff = await Topics.unreadCutoff(uid);
-        const tids = await db.getSortedSetRevRangeByScore('topics:recent', 0, -1, '+inf', cutoff);
-        Topics.markTopicNotificationsRead(tids, uid);
-        await Topics.markAsRead(tids, uid);
-        await db.delete(`uid:${uid}:tids_unread`);
-    };
+    Topics.markAllRead = async function (uid) {};
 
     Topics.markTopicNotificationsRead = async function (tids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] UnaryOperator
src/topics/unread.js:308:79
 
     Topics.markAllRead = async function (uid) {
         const cutoff = await Topics.unreadCutoff(uid);
-        const tids = await db.getSortedSetRevRangeByScore('topics:recent', 0, -1, '+inf', cutoff);
+        const tids = await db.getSortedSetRevRangeByScore('topics:recent', 0, +1, '+inf', cutoff);
         Topics.markTopicNotificationsRead(tids, uid);
         await Topics.markAsRead(tids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/unread.js:308:83
 
     Topics.markAllRead = async function (uid) {
         const cutoff = await Topics.unreadCutoff(uid);
-        const tids = await db.getSortedSetRevRangeByScore('topics:recent', 0, -1, '+inf', cutoff);
+        const tids = await db.getSortedSetRevRangeByScore('topics:recent', 0, -1, "", cutoff);
         Topics.markTopicNotificationsRead(tids, uid);
         await Topics.markAsRead(tids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:314:68
         await db.delete(`uid:${uid}:tids_unread`);
     };
 
-    Topics.markTopicNotificationsRead = async function (tids, uid) {
-        if (!Array.isArray(tids) || !tids.length) {
-            return;
-        }
-        const nids = await user.notifications.getUnreadByField(uid, 'tid', tids);
-        await notifications.markReadMultiple(nids, uid);
-        user.notifications.pushCount(uid);
-    };
+    Topics.markTopicNotificationsRead = async function (tids, uid) {};
 
     Topics.markCategoryUnreadForAll = async function (tid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:315:51
     };
 
     Topics.markTopicNotificationsRead = async function (tids, uid) {
-        if (!Array.isArray(tids) || !tids.length) {
-            return;
-        }
+        if (!Array.isArray(tids) || !tids.length) {}
         const nids = await user.notifications.getUnreadByField(uid, 'tid', tids);
         await notifications.markReadMultiple(nids, uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:315:13
     };
 
     Topics.markTopicNotificationsRead = async function (tids, uid) {
-        if (!Array.isArray(tids) || !tids.length) {
+        if (false) {
             return;
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/unread.js:318:69
         if (!Array.isArray(tids) || !tids.length) {
             return;
         }
-        const nids = await user.notifications.getUnreadByField(uid, 'tid', tids);
+        const nids = await user.notifications.getUnreadByField(uid, "", tids);
         await notifications.markReadMultiple(nids, uid);
         user.notifications.pushCount(uid);
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:323:60
         user.notifications.pushCount(uid);
     };
 
-    Topics.markCategoryUnreadForAll = async function (tid) {
-        const cid = await Topics.getTopicField(tid, 'cid');
-        await categories.markAsUnreadForAll(cid);
-    };
+    Topics.markCategoryUnreadForAll = async function (tid) {};
 
     Topics.hasReadTopics = async function (tids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/unread.js:329:15
     };
 
     Topics.hasReadTopics = async function (tids, uid) {
-        if (!(parseInt(uid, 10) > 0)) {
+        if (!(parseInt(uid, 10) <= 0)) {
             return tids.map(() => false);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/unread.js:329:15
     };
 
     Topics.hasReadTopics = async function (tids, uid) {
-        if (!(parseInt(uid, 10) > 0)) {
+        if (!(parseInt(uid, 10) >= 0)) {
             return tids.map(() => false);
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:330:35
 
     Topics.hasReadTopics = async function (tids, uid) {
         if (!(parseInt(uid, 10) > 0)) {
-            return tids.map(() => false);
+            return tids.map(() => true);
         }
         const [topicScores, userScores, tids_unread, blockedUids] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/unread.js:330:29
 
     Topics.hasReadTopics = async function (tids, uid) {
         if (!(parseInt(uid, 10) > 0)) {
-            return tids.map(() => false);
+            return tids.map(() => undefined);
         }
         const [topicScores, userScores, tids_unread, blockedUids] = await Promise.all([
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrayDeclaration
src/topics/unread.js:332:87
         if (!(parseInt(uid, 10) > 0)) {
             return tids.map(() => false);
         }
-        const [topicScores, userScores, tids_unread, blockedUids] = await Promise.all([
-            db.sortedSetScores('topics:recent', tids),
-            db.sortedSetScores(`uid:${uid}:tids_read`, tids),
-            db.sortedSetScores(`uid:${uid}:tids_unread`, tids),
-            user.blocks.list(uid),
-        ]);
+        const [topicScores, userScores, tids_unread, blockedUids] = await Promise.all([]);
 
         const cutoff = await Topics.unreadCutoff(uid);
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] StringLiteral
src/topics/unread.js:333:32
             return tids.map(() => false);
         }
         const [topicScores, userScores, tids_unread, blockedUids] = await Promise.all([
-            db.sortedSetScores('topics:recent', tids),
+            db.sortedSetScores("", tids),
             db.sortedSetScores(`uid:${uid}:tids_read`, tids),
             db.sortedSetScores(`uid:${uid}:tids_unread`, tids),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
