[Killed] StringLiteral
src/topics/unread.js:334:32
         }
         const [topicScores, userScores, tids_unread, blockedUids] = await Promise.all([
             db.sortedSetScores('topics:recent', tids),
-            db.sortedSetScores(`uid:${uid}:tids_read`, tids),
+            db.sortedSetScores(``, tids),
             db.sortedSetScores(`uid:${uid}:tids_unread`, tids),
             user.blocks.list(uid),
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:340:49
         ]);
 
         const cutoff = await Topics.unreadCutoff(uid);
-        const result = tids.map((tid, index) => {
-            const read = !tids_unread[index] &&
-                (topicScores[index] < cutoff ||
-                !!(userScores[index] && userScores[index] >= topicScores[index]));
-            return { tid: tid, read: read, index: index };
-        });
+        const result = tids.map((tid, index) => {});
 
         return await async.map(result, async (data) => {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:341:26
 
         const cutoff = await Topics.unreadCutoff(uid);
         const result = tids.map((tid, index) => {
-            const read = !tids_unread[index] &&
-                (topicScores[index] < cutoff ||
-                !!(userScores[index] && userScores[index] >= topicScores[index]));
+            const read = false;
             return { tid: tid, read: read, index: index };
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:341:26
 
         const cutoff = await Topics.unreadCutoff(uid);
         const result = tids.map((tid, index) => {
-            const read = !tids_unread[index] &&
-                (topicScores[index] < cutoff ||
-                !!(userScores[index] && userScores[index] >= topicScores[index]));
+            const read = true;
             return { tid: tid, read: read, index: index };
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/unread.js:342:18
         const cutoff = await Topics.unreadCutoff(uid);
         const result = tids.map((tid, index) => {
             const read = !tids_unread[index] &&
-                (topicScores[index] < cutoff ||
-                !!(userScores[index] && userScores[index] >= topicScores[index]));
+                (topicScores[index] < cutoff && !!(userScores[index] && userScores[index] >= topicScores[index]));
             return { tid: tid, read: read, index: index };
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] EqualityOperator
src/topics/unread.js:342:18
         const cutoff = await Topics.unreadCutoff(uid);
         const result = tids.map((tid, index) => {
             const read = !tids_unread[index] &&
-                (topicScores[index] < cutoff ||
+                (topicScores[index] <= cutoff ||
                 !!(userScores[index] && userScores[index] >= topicScores[index]));
             return { tid: tid, read: read, index: index };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:343:18
         const result = tids.map((tid, index) => {
             const read = !tids_unread[index] &&
                 (topicScores[index] < cutoff ||
-                !!(userScores[index] && userScores[index] >= topicScores[index]));
+                !userScores[index] && userScores[index] >= topicScores[index]);
             return { tid: tid, read: read, index: index };
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:343:20
         const result = tids.map((tid, index) => {
             const read = !tids_unread[index] &&
                 (topicScores[index] < cutoff ||
-                !!(userScores[index] && userScores[index] >= topicScores[index]));
+                !!(true));
             return { tid: tid, read: read, index: index };
         });
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:347:56
             return { tid: tid, read: read, index: index };
         });
 
-        return await async.map(result, async (data) => {
-            if (data.read) {
-                return true;
-            }
-            const hasUnblockedUnread = await doesTidHaveUnblockedUnreadPosts(data.tid, {
-                topicTimestamp: topicScores[data.index],
-                userLastReadTimestamp: userScores[data.index],
-                blockedUids: blockedUids,
-            });
-            if (!hasUnblockedUnread) {
-                data.read = true;
-            }
-            return data.read;
-        });
+        return await async.map(result, async (data) => {});
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:348:17
         });
 
         return await async.map(result, async (data) => {
-            if (data.read) {
+            if (false) {
                 return true;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:348:28
         });
 
         return await async.map(result, async (data) => {
-            if (data.read) {
-                return true;
-            }
+            if (data.read) {}
             const hasUnblockedUnread = await doesTidHaveUnblockedUnreadPosts(data.tid, {
                 topicTimestamp: topicScores[data.index],
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BooleanLiteral
src/topics/unread.js:349:24
 
         return await async.map(result, async (data) => {
             if (data.read) {
-                return true;
+                return false;
             }
             const hasUnblockedUnread = await doesTidHaveUnblockedUnreadPosts(data.tid, {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:356:17
                 userLastReadTimestamp: userScores[data.index],
                 blockedUids: blockedUids,
             });
-            if (!hasUnblockedUnread) {
+            if (false) {
                 data.read = true;
             }
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] BooleanLiteral
src/topics/unread.js:356:17
                 userLastReadTimestamp: userScores[data.index],
                 blockedUids: blockedUids,
             });
-            if (!hasUnblockedUnread) {
+            if (hasUnblockedUnread) {
                 data.read = true;
             }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[NoCoverage] BooleanLiteral
src/topics/unread.js:357:29
                 blockedUids: blockedUids,
             });
             if (!hasUnblockedUnread) {
-                data.read = true;
+                data.read = false;
             }
             return data.read;

[Killed] BlockStatement
src/topics/unread.js:363:53
         });
     };
 
-    Topics.hasReadTopic = async function (tid, uid) {
-        const hasRead = await Topics.hasReadTopics([tid], uid);
-        return Array.isArray(hasRead) && hasRead.length ? hasRead[0] : false;
-    };
+    Topics.hasReadTopic = async function (tid, uid) {};
 
     Topics.markUnread = async function (tid, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/unread.js:365:16
 
     Topics.hasReadTopic = async function (tid, uid) {
         const hasRead = await Topics.hasReadTopics([tid], uid);
-        return Array.isArray(hasRead) && hasRead.length ? hasRead[0] : false;
+        return Array.isArray(hasRead) || hasRead.length ? hasRead[0] : false;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:365:16
 
     Topics.hasReadTopic = async function (tid, uid) {
         const hasRead = await Topics.hasReadTopics([tid], uid);
-        return Array.isArray(hasRead) && hasRead.length ? hasRead[0] : false;
+        return false ? hasRead[0] : false;
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:368:51
         return Array.isArray(hasRead) && hasRead.length ? hasRead[0] : false;
     };
 
-    Topics.markUnread = async function (tid, uid) {
-        const exists = await Topics.exists(tid);
-        if (!exists) {
-            throw new Error('[[error:no-topic]]');
-        }
-        await db.sortedSetRemove(`uid:${uid}:tids_read`, tid);
-        await db.sortedSetAdd(`uid:${uid}:tids_unread`, Date.now(), tid);
-    };
+    Topics.markUnread = async function (tid, uid) {};
 
     Topics.filterNewTids = async function (tids, uid) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:370:13
 
     Topics.markUnread = async function (tid, uid) {
         const exists = await Topics.exists(tid);
-        if (!exists) {
+        if (false) {
             throw new Error('[[error:no-topic]]');
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/unread.js:374:31
             throw new Error('[[error:no-topic]]');
         }
         await db.sortedSetRemove(`uid:${uid}:tids_read`, tid);
-        await db.sortedSetAdd(`uid:${uid}:tids_unread`, Date.now(), tid);
+        await db.sortedSetAdd(``, Date.now(), tid);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:377:55
         await db.sortedSetAdd(`uid:${uid}:tids_unread`, Date.now(), tid);
     };
 
-    Topics.filterNewTids = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
-            return [];
-        }
-        const scores = await db.sortedSetScores(`uid:${uid}:tids_read`, tids);
-        return tids.filter((tid, index) => tid && !scores[index]);
-    };
+    Topics.filterNewTids = async function (tids, uid) {};
 
     Topics.filterUnrepliedTids = async function (tids) {
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:378:13
     };
 
     Topics.filterNewTids = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (false) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:378:13
     };
 
     Topics.filterNewTids = async function (tids, uid) {
-        if (parseInt(uid, 10) <= 0) {
+        if (true) {
             return [];
         }
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/unread.js:381:49
         if (parseInt(uid, 10) <= 0) {
             return [];
         }
-        const scores = await db.sortedSetScores(`uid:${uid}:tids_read`, tids);
+        const scores = await db.sortedSetScores(``, tids);
         return tids.filter((tid, index) => tid && !scores[index]);
     };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ArrowFunction
src/topics/unread.js:382:28
             return [];
         }
         const scores = await db.sortedSetScores(`uid:${uid}:tids_read`, tids);
-        return tids.filter((tid, index) => tid && !scores[index]);
+        return tids.filter(() => undefined);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] LogicalOperator
src/topics/unread.js:382:44
             return [];
         }
         const scores = await db.sortedSetScores(`uid:${uid}:tids_read`, tids);
-        return tids.filter((tid, index) => tid && !scores[index]);
+        return tids.filter((tid, index) => tid || !scores[index]);
     };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] BlockStatement
src/topics/unread.js:385:56
         return tids.filter((tid, index) => tid && !scores[index]);
     };
 
-    Topics.filterUnrepliedTids = async function (tids) {
-        const scores = await db.sortedSetScores('topics:posts', tids);
-        return tids.filter((tid, index) => tid && scores[index] !== null && scores[index] <= 1);
-    };
+    Topics.filterUnrepliedTids = async function (tids) {};
 };
 
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] StringLiteral
src/topics/unread.js:386:49
     };
 
     Topics.filterUnrepliedTids = async function (tids) {
-        const scores = await db.sortedSetScores('topics:posts', tids);
+        const scores = await db.sortedSetScores("", tids);
         return tids.filter((tid, index) => tid && scores[index] !== null && scores[index] <= 1);
     };
killedBy: should correctly compare a password and a hash
statusReason: dependencies-missing

[Killed] ArrowFunction
src/topics/unread.js:387:28
 
     Topics.filterUnrepliedTids = async function (tids) {
         const scores = await db.sortedSetScores('topics:posts', tids);
-        return tids.filter((tid, index) => tid && scores[index] !== null && scores[index] <= 1);
+        return tids.filter(() => undefined);
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')

[Killed] ConditionalExpression
src/topics/unread.js:387:77
 
     Topics.filterUnrepliedTids = async function (tids) {
         const scores = await db.sortedSetScores('topics:posts', tids);
-        return tids.filter((tid, index) => tid && scores[index] !== null && scores[index] <= 1);
+        return tids.filter((tid, index) => tid && scores[index] !== null && true);
     };
 };
killedBy: should correctly compare a password and a hash
statusReason: Cannot read properties of undefined (reading 'hasOwnProperty')
